[
  "AGNEL INSTITUTE OF TECHNOLOGY AND DESIGN, ASSAGAO, BARDEZ (Id: C-46329)",
  "Carmel College of Arts Science & Commerce for Women (Id: C-33103)",
  "Centre for Latin American Studies (Id: C-30837)",
  "Centre for Women's Studies (Id: C-30871)",
  "Cuncolim Educational Societys College of Arts & Commerce Cuncolim (Id: C-30867)",
  "Dempo Charities Trust Dhempe College of Arts & Science Miramar (Id: C-30842)",
  "Dempo Charities Trusts S.S. Dempo College of Commerce & Economics Altinho (Id: C-30828)",
  "Devi Sharvani Education Societys V.M. Salgaocar College of Law Miramar Panaji (Id: C-30825)",
  "Directorate of Archives and Archaeology (Id: C-30840)",
  "Dnyan Prabodhini Mandals Shree Mallikarjun College of Arts & Commerce Delem Canacona (Id: C-30865)",
  "Dnyanprassarak Mandals College of Arts Sou. Sheela Premanand Vaidya College of Science & VNS Bandekar College of Commerce Assagao (Id: C-30843)",
  "DON BOSCO COLLEGE OF ENGINEERING, FATORDA, MARGAO (Id: C-46324)",
  "Fisheries Survey of India (Id: C-30870)",
  "Fr. Agnel College of Arts & Commerce Pilar (Id: C-30863)",
  "Goa College of Architecture Altinho Panaji (Id: C-30832)",
  "Goa College of Art Altinho Panaji (Id: C-30835)",
  "Goa College of Home Science Campal Panaji (Id: C-30824)",
  "GOA COLLEGE OF HOSPITALITY AND CULINARY EDUCATION, CIDADE-DE-GOA (Id: C-46325)",
  "Goa College of Music Altinho Panaji (Id: C-30869)",
  "Goa College of Pharmacy Panaji (Id: C-30858)",
  "Goa Dental College & Hospital Bambolim (Id: C-30817)",
  "Goa Medical College Bambolim (Id: C-30851)",
  "Goa Salesian Societys Don Bosco College Panaji (Id: C-30823)",
  "Goa Vidyaprasarak Mandal's Dr. Dada Vaidya College of Education, Ponda (Id: C-35084)",
  "Goa Vidyaprasarak Mandals Gopal Govind Poy Raiturcar College of Commerce and Economics Farmagudi Ponda (Id: C-30818)",
  "Govt. College of Arts & Commerce Virnoda Pernem (Id: C-30862)",
  "Govt.College of Arts Science & Commerce Khandola (Id: C-35081)",
  "Govt.College of Arts Science & Commerce Quepem (Id: C-30845)",
  "Govt.College of Arts Science & Commerce Sanquelim (Id: C-30847)",
  "Govt. College of Commerce Borda Margao (Id: C-30848)",
  "Govt. of Goa College of Engineering, Goa, Farmagudi, Ponda (Id: C-30821)",
  "Institute of Nursing Education Bambolim (Id: C-30836)",
  "Institute of Psychiatry & Human Behaviour Bambolim (Id: C-30855)",
  "Malaria Research Centre (Id: C-30839)",
  "Murgaon Education Societys College of Arts & Commerce Zuarinagar (Id: C-30864)",
  "National Centre for Antarctic & Ocean Research (Id: C-30853)",
  "National Hydrographic School C/o Headquarters Vasco-da-Gama (Id: C-30849)",
  "National Institute of Oceanography (Id: C-30826)",
  "Nirmala Institute of Education Altinho Panaji (Id: C-30850)",
  "Padre Conceicao College of Engineering Agnel Ashram Verna (Id: C-30819)",
  "Parvatibai Chowgule College of Arts & Science (Id: C-30820)",
  "Ponda Education Societys College of Education Farmagudi Ponda (Id: C-30868)",
  "Ponda Education Society Shri Ravi S Naik College of Arts & Science (Id: C-30860)",
  "Ponda Education Society's Rajaram and Tarabai Bandekar College of Pharmacy, Farmagudi, Ponda (Id: C-35083)",
  "Rosary College of Commerce & Arts Navelim (Id: C-30852)",
  "Saraswat Vidyalayas Sridora Caculo College of Commerce & Management Studies Mapusa (Id: C-30834)",
  "Shivgram Education Societys Shri Kamaxidevi Homoeopathic Medical College & Hospital Shiroda (Id: C-30856)",
  "Shree Bharateeya Sanskriti Prabodhinis Gomantak Ayurveda Mahavidyalaya & Research Centre Shiroda (Id: C-30874)",
  "Shree Rayeshwar Institute of Engineering & Information Technology Shiroda (Id: C-44947)",
  "St Xaviers College of Arts Science & Commerce Mapusa (Id: C-30875)",
  "SWAMI VIVEKANAND VIDYA PRASARAK MANDALS COLLEGE OF COMMERCE, (Id: C-46327)",
  "Syngenta Research & Technology Centre (Id: C-30866)",
  "Thomas Stephen's Konkani Kendra (Id: C-30857)",
  "Victor Medical & Research Foundation College of Nursing C/o Apollo Victor Hospital Malbhat Margao (Id: C-30844)",
  "VIDYA PRABODHINI COLLEGE OF COMMERCE, EDUCATION, COMPUTER AND MANAGEMENT, VIDYANAGAR, ALTO PORVORIM (Id: C-46328)",
  "Vidya Vikas Mandals Govind Ramnath Kare College of Law Margao (Id: C-30838)",
  "Vidya Vikas Mandals H.M.N. Gaunekar Institute of Management Training & Research Shre Damodar College Complex Margao (Id: C-30822)",
  "Vidya Vikas Mandals Shree Damodar College of Commerce & Economics Margao (Id: C-30846)",
  "VIKAS PARISHAD MANDRE COLLEGE OF COMMERCE AND ECONOMICS, MANDHLAMANJ, MANDREM (Id: C-46326)",
  "Vrundavan Institute of Nursing Education & College of Nursing Colvale Bardez (Id: C-30872)",
  "Xavier Centre of Historical Research (Id: C-30833)",
  "Zantye Brothers Educational Foundations Narayan Zantye College of Commerce Bicholim (Id: C-30873)",
  "National Centre for Antarctic & Ocean Research, Ministry of Earth Sciences, Headland Sada Vasco-da-gama, Goa-403804 (Id: C-16798)",
  "National Institute of Oceanography, Dona Paula, Goa-403004 (Id: C-16821)",
  "Syngenta Biosciences Pvt. Ltd., Santa Monica Works, Corlim, Ilhas, Goa - 403110 (Id: C-17004)",
  "Pragati Women's College of Education (Id: C-44330)"
]