[
  "Institute of Emerging Sciences & Technology (Id: C-22474)",
  "Institute of Management Studies (Id: C-22473)",
  "Institute of Pharmacy & Emerging Sciences (Id: C-22475)",
  "COLLEGE OF FORESTRY, SOLAN (Id: C-47458)",
  "College of Horticulture ( Main Campus) (Id: C-17666)",
  "Institute of Biotechnology and Environmental Sciences (Id: C-17665)",
  "Himalayan Forest Research Institute (Id: C-44371)",
  "Abhilashi College of Pharmacy, Tanda Po Balt, Ner-Chowk, Distt Mandi (Id: C-11378)",
  "Abhilashi Group Of Institutions, Chail Chowk, Mandi (Id: C-11282)",
  "Abhilashi Group Of Institutions, (School of Pharmacy), Chail Chowk, Distt Mandi (Id: C-11432)",
  "Abhilashi Institute of Management Studies, Tanda,PO Balt, Distt Mandi (Id: C-11509)",
  "Abhilashi Institutes of Bio-Technology, Tanda, Distt Mandi (Id: C-11517)",
  "Bells Institute of Management & Technology, Knowledge City, Mehli, Shimla (Id: C-11417)",
  "Bells Institutes of Mgt. & Tech. Knowledge City Mehli, Distt Shimla (Id: C-11366)",
  "DDM College of Pharmacy, VPO Gondpur, Teh Amb. Distt Una (Id: C-11499)",
  "Dev Bhoomi Group Of Institutes, Chandpur, Distt Una (Id: C-11431)",
  "Dreamz College of Pharmacy, Khirla, PO Mera Masit, Tehsil Sundernager, Distt mandi (Id: C-11386)",
  "Himachal Institute of Engg. & Tech. Vidya Nagar, Shahpur, Kangra (Id: C-11367)",
  "Himachal Institute of Pharmaceutical, Bela, Nadaun. Distt Hamirpur (Id: C-11330)",
  "Himachal Institutes of Pharmacy, Paonta Sahib, Distt Sirmour (Id: C-11425)",
  "Himalayan Institute of Engineering & Technology, Sadhoura Road, Kala Amb. Distt Sirmour (Id: C-11372)",
  "Himalayan Institutes of Management Sadhoura Road, Kala Amb, Distt Sirmour (Id: C-11323)",
  "H.P. Institutes of management Studies, Totu, Distt Shimla (Id: C-11532)",
  "I.I.T.T College of Engineering, Kala Amb, Distt Sirmour (Id: C-11514)",
  "K.C. Education and Socail Welfare Society Group of Research & Professional Institutes, VPO pandoga, Uparla Tehsil & Distt Una (Id: C-11415)",
  "K.C. Education and Social Welfarre Society Group of Research & Professional Institutes, VPO pandoga Uparla Tehsil & Distt Una (Id: C-11309)",
  "K.C. Institute of Management Pandoga, Uparla, Distt Una (Id: C-11519)",
  "K.C. Institute of Pharmaceutical Sciences, VPO Pandoga Uprla, Distt Una (Id: C-11329)",
  "KLB, DAV College for Girls Palampur, Distt Kangra (Id: C-11472)",
  "KLB, DAV College for Girls, Palampur, Distt Kangra (Id: C-11391)",
  "Lauratte Institutes of Pharmacy, kathlog, Dehra, Distt Kangra (Id: C-11336)",
  "L.R. Institute of Engineering & Technology, Jabli Kyar, Distt Solan (Id: C-11284)",
  "L. R. Institutes of Management, Jabli-Kyar, Oachghat, Distt Solan (Id: C-11343)",
  "L.R. Institutes of Management Vill. Jabli Kyar. Distt Solan (Id: C-11481)",
  "L.R. Institutes of Pharmacy, Jabli-Kyar, Oachghat Distt Solan (Id: C-11531)",
  "M.G. Institute of Engineering & Technology, Badhoo, Tehsil Chachyot, Distt Mandi (Id: C-11459)",
  "MIT College of Engineering & Management, Village Ganoh Rajputana, PO Bani Tehsil Barsar, Distt Hamirpur (Id: C-11547)",
  "Sai Ram Education Trust Group of Institutions, Vill Bulhatipper, PO Tipper, Distt Hamirpur (Id: C-11364)",
  "Sai Ram Education Trust Group of Institutions, Vill. Bulhatipper, PO Tipper, Teh. Barsar, Distt Hamirpur (Id: C-11254)",
  "Shimla Institute of Mangement, Sheetal Kunj, Kamlanagar, Sanjauli, Distt Shimla (Id: C-11437)",
  "Shiva Institute of Engineering & Technology, Chandpur, Distt Bilaspur, (Id: C-11497)",
  "SIRDA Institute of Engineering & Technology for Women, Naulakda Troat, Sunder Nagar, Distt Mandi (Id: C-11328)",
  "T.R. Abhilashi Memorial Institute of Engg. & Technology, Tanda, PO Balt, Distt Mandi (Id: C-11316)",
  "Vaishno College Of Engg. Thapkour, Nurpur, Kangra (Id: C-11353)",
  "Vinayaka College Of Pharmacy, Kullu (Id: C-11300)",
  "Abhilashi College of Education, Ner Chowk, Teh. Sadar, Distt Mandi (Id: C-11274)",
  "Adarsh Arya Sanskrit Mahavidyalaya, Saraswati Nagar, Chamba (Id: C-11539)",
  "Adarsh College of Education, Dehar, Tehsil Sundernagar, Distt Mandi (Id: C-11546)",
  "A One College of Education Raja Ka Bag (Nurpur), Kangra (Id: C-11444)",
  "Astha College of Education, Hatkot, Arki, Kunihar, Distt Solan (Id: C-11438)",
  "Astha College of Education, Vill Hatkot, Kunihar, Tehsil Arki, Distt Solan (Id: C-11419)",
  "Awasthi College of Education Shamnagar, Dharamshala, Distt Kangra (Id: C-11469)",
  "Baba balak Nath College of Education & Management, Jawalaji, Baroa, Distt Kangra (Id: C-11359)",
  "BBN College, Chakmoh, Distt Hamirpur (Id: C-11265)",
  "Bhardwaj Shikshan Sansthan, VPO Baral, Tehsil Karsog, Distt Mandi (Id: C-11290)",
  "Bhojia Dental College, Budh (Baddi), Chandigarh-Nalagarh Road, Distt. Solan (Id: C-11473)",
  "Bhojia Institute of Life Sciences, Nalagarh (Id: C-11383)",
  "Bhureshwar Mahadev Sanskrit Madavidyalaya, P.O. Panwa, Teh. Pachad. Distt Sirmour (Id: C-11510)",
  "BKD College for Women, Ponta Sahib, Distt Sirmour (Id: C-11335)",
  "BKD Degree College for Women, Paonta Sahib, Distt Sirmour (Id: C-11402)",
  "Blooms College of Education, Kot, P.O. Chunahan, Distt Mandi (Id: C-11358)",
  "Blooms College Of Education, Kot, PO Chunahan, Teh. Sadar, Distt Mandi (Id: C-11294)",
  "Brijeshwari Sanskrit College, Saranh (Chopal), Distt Shimla (Id: C-11295)",
  "B.T.C., DAV College. Banikhet, Distt Chamba. (Id: C-11376)",
  "Bushehar B.Ed. Institute PO Nogli, Rampur, Distt Shimla (Id: C-11400)",
  "Central Research Institute. Kasauli, Distt Solan (Id: C-11398)",
  "Chamba Millenimum Education College, Saraswati Nagar, PO hardaspur, Distt Chamba (Id: C-11533)",
  "Chamba Millinium Education Society, Saraswati Nagar, Mugla, PO Hardaspura, Chamba (Id: C-11515)",
  "DAV Centenary College Kotkhai, Distt Shimla (Id: C-11491)",
  "Dawarka Dass Memorial Sai College of Education, Vill. Kallar, P.O. Jalari, Teh. Nadaun, Distt Hamirpur (Id: C-11466)",
  "Daya Nand Sanskrit Mahavidalaya, Chamba (Id: C-11530)",
  "DDM College of Sciences & technology, VPO Gondpur, Banehra Upper Amb, Distt Una (Id: C-11278)",
  "DDM College of Sciences & Technology, VPO Gondpur, Teh. Amb. Distt Una (Id: C-11263)",
  "DDMP Degree College, PO Mandoli. Sugh Bhatoli. Distt Kangra (Id: C-11548)",
  "DDM Sai Law College, Nadaun Distt Hamirpur (Id: C-11506)",
  "Dean Dayal Mahesh Public College of Education, Sugh Bhatoli, P.O. Mandoli Distt Kangra (Id: C-11362)",
  "Deen Dayal Upadhayay College of Education, Mehre, Distt Hamirpur (Id: C-11436)",
  "Deen Dayal Upadhayay School of Management & Yoga Studies, Mehre barsar, Distt Hamirpur (Id: C-11484)",
  "Dev Bhoomi Institute of Business Administration and Computer Application, haroli, Distt Una (Id: C-11273)",
  "Din Dayal Upadhyaya Mahavidyalaya, Mehre, Barsar, Distt Hamirpurur (Id: C-11318)",
  "Doon International College of Education. Rajban, Paonta Sahib. Distt Sirmour (Id: C-11299)",
  "Dr. Bimla Sanskrit Mahavidalaya Distt Chamba (Id: C-11479)",
  "Dronacharya College of Education, Rait, Distt Kangra (Id: C-11433)",
  "Droncharya College of Education, P.O. Rait, Tehsil Shahpur, Distt Kangra (Id: C-11507)",
  "Dr. RP Medical College, Tanda, Distt Kangra (Id: C-11393)",
  "Dr. Sharma Prasad Mukherjee College of Physical Education, Nurpur, Distt Kangra (Id: C-11311)",
  "D S College of Management & Technology, Vill Kutkana, PO Kher, Teh. Nurpur, Distt Kangra (Id: C-11409)",
  "FD Public Degree College, Mand Miyani, Teh. Indora, Distt Kangra (Id: C-11301)",
  "Gautam Girls College Hamirpur, Distt Hamirpur (Id: C-11421)",
  "Gayatri College of Education. P.O. Kangoo. Tehsil Sundernagar, Distt Mandi (Id: C-11257)",
  "General Zorawar Singh Samarak Mahavidyalaya, Dhaneta, Distt Hamirpur (Id: C-11272)",
  "GGDSD College Rajpur, Palampur, Distt Kangra (Id: C-11448)",
  "GGDSD College Subathu, Solan (Id: C-11483)",
  "Gian Jyoti Institute of Bachelor Education. NH Road, Vill. Ichhi, P.O. Gagal, Distt Kangra (Id: C-11256)",
  "Gian Jyoti institutes of Teachers Education, Ichhi at Rajol Distt Kangra (Id: C-11396)",
  "GOVERNMENT DEGREE COLLEGE, HARIPURDHAR (Id: C-48679)",
  "Govt. College, Anni at Haripur, Distt Kullu (Id: C-11482)",
  "Govt. College, Arki Distt Solan (Id: C-11475)",
  "Govt. College, Bangana, Una (Id: C-11524)",
  "Govt. College, Banjar, Distt Kullu (Id: C-11315)",
  "Govt. College, Barsar, Distt Hamirpur (Id: C-11377)",
  "Govt. College, Basa, Distt Mandi (Id: C-11298)",
  "Govt. College Bharmour, Distt Chamba (Id: C-11443)",
  "Govt. College Bhoranj (Tarkawari), Distt Hamirpur (Id: C-11542)",
  "Govt. College Bilaspur (Id: C-11349)",
  "Govt. College, Chamba (Id: C-11480)",
  "Govt. College Chowari, Distt Chamba (Id: C-11516)",
  "Govt. College, Daulatpur Chowk, Distt Una (Id: C-11511)",
  "Govt. College, Dhaliara, Distt Kangra (Id: C-11424)",
  "Govt. College, Dharampur, Mandi (Id: C-11307)",
  "Govt. College Dharmashala, Distt Kangra (Id: C-11538)",
  "Govt. College, Drang at Narla, Distt Mandi (Id: C-11334)",
  "Govt. College Hamirpur (Id: C-11275)",
  "Govt. College, Haripur, Distt Kullu (Id: C-11490)",
  "Govt. College, Indora, Distt Kangra (Id: C-11266)",
  "Govt. College, Jhanduta, Distt Bilaspur (Id: C-11344)",
  "Govt. College, Jukhala, Distt Bilaspur (Id: C-11429)",
  "Govt. College, Karsog, Distt Mandi (Id: C-11401)",
  "Govt. College Kukumseri, Distt Lahaul & Spiti (Id: C-11525)",
  "Govt. College, Kullu, Distt Kullu, HP (Id: C-11303)",
  "Govt. College, Nagrota Bagwan, Distt Kangra (Id: C-11407)",
  "Govt. College, Nahan, Distt Sirmour (Id: C-11522)",
  "Govt. College, Nalagarh, Distt. Solan (Id: C-11492)",
  "Govt. College Nurpur, Distt Kangra (Id: C-11384)",
  "Govt. College of Education Dharamshala, Distt Kangra (Id: C-11339)",
  "Govt. College of Pharmacy, Rohroo, Distt Shimla (Id: C-11322)",
  "Govt. College Palampur, Distt Kangra (Id: C-11374)",
  "Govt. College Pangi, Distt Chamba (Id: C-11388)",
  "Govt. College Rajgarh, Distt Sirmour (Id: C-11270)",
  "Govt. College, Reckong Peo, Distt Kinnaur (Id: C-11313)",
  "Govt. College, Salooni, Distt Chamba (Id: C-11468)",
  "Govt. College, Sangrah, Distt Sirmour (Id: C-11439)",
  "Govt. College Sanjauli, Shimla (Centre of Excellence) (Id: C-11528)",
  "Govt. College, Saraj at Lambathach, Tehsil Thunag, Distt Mandi (Id: C-11464)",
  "Govt. College, Sarkaghat, Distt Mandi (Id: C-11456)",
  "Govt. College, Seema (Rohru) Distt Shimla (Id: C-11495)",
  "Govt. College, Shahpur, Distt Kangra (Id: C-11451)",
  "Govt. College, Shillai, Distt Sirmour (Id: C-11296)",
  "Govt. College Solan. Distt Solan (Id: C-11365)",
  "Govt. College, Sunni, Distt Shimla (Id: C-11505)",
  "Govt. College Theog, Distt Shimla (Id: C-11268)",
  "Govt. College, Tissa, Distt Chamba (Id: C-11430)",
  "Govt. College,Una, Distt Una, (Id: C-11537)",
  "Govt. Degree College, Nerwa (Chopal), Distt Shimla (Id: C-11338)",
  "Govt. Degree, Naura, Sulah, Distt Kangra (Id: C-11279)",
  "Govt. Engineering College Sundernagar, Distt Mandi (Id: C-11411)",
  "Govt. Lal Bahadur College, Sawra Saraswati Nagar, Distt Shimla (Id: C-11529)",
  "Govt. Sanskrit College, Kiartu. Teh. Theog. Distt Shimla (Id: C-11325)",
  "Govt. Sanskrit College, Purana Bazaar, Sundernagar, Distt Mandi (Id: C-11314)",
  "Govt. Sanskrit College, Solan (Id: C-11550)",
  "Govt. Snaskrit College, Nahan, Distt Sirmour (Id: C-11395)",
  "G.P. Pant Memorial Govt. College Rampur Bhushar, Distt Shimla (Id: C-11368)",
  "Green Hills Engineering College, Gandhi Gram Road, Kumarhatti, Distt Solan (Id: C-11520)",
  "Guild Institutes of Mangement Education & Technology, Dhanotu, PO Mahadev, Teh. Sundernager, Distt mandi (Id: C-11381)",
  "Guru Gobind Singh Memorial College, Ponta Sahib, Sirmour (Id: C-11420)",
  "Gurukul Bharti College, Vill. Benla, P.O. Chandpur, Distt Bilaspur (Id: C-11264)",
  "Guru Rimpoche Padma Sambhav Degree College, Rewalsar, Distt mandi (Id: C-11357)",
  "Hamirpur College of Education, Ward No. 10. Ram Nagar, Choulla, Hamirpur (Id: C-11283)",
  "Himachal Adarsh Sanskrit College, Jangla, Teh. Rohru Distt Shimla (Id: C-11410)",
  "Himachal College of Education, Nalagarh at Kishanpura, Nalagarh, Distt Solan (Id: C-11289)",
  "Himachal College of Law, Kala Amb to be run Maa Saraswati Educational Trust karnal (Id: C-11450)",
  "Himachal Dental College, Sundernagar, Distt. Mandi (Id: C-11457)",
  "Himachal Institute of Dental Sciences, Paonta Sahib, Distt. Sirmour (Id: C-11255)",
  "Himachal Institute of Education, Bye Pass Road, Near Petrol Pump, Amar Building. Solan (Id: C-11285)",
  "Himachal Institutes of Life Sciences, Paonta Sahib, Sirmour (Id: C-11370)",
  "Himachal Pradesh College of Education, Kala Amb, Distt Sirmour (Id: C-11513)",
  "Himachal Research Institute, Chakmoh, Distt Hamirpur (Id: C-11503)",
  "Himalayan College of Education, Pungh, Sundernagar, Distt Mandi (Id: C-11445)",
  "Himalayan Institutes of Computer Sciences, Sadhoura Roah, Kala Amb, Distt Sirmour (Id: C-11277)",
  "Himalayan Institutes of Pharmacy, Sadoura Road, Kala Amb. Distt Sirmour (Id: C-11496)",
  "HIMCAPES Co-operative school of Legal Studies, Badhera, Distt Una (Id: C-11312)",
  "Him Institute of Education, Ponda, Tehsil Nichar, Distt Kinnaur (Id: C-11493)",
  "H.P. College of Education, Mauja Majeth, P.O. Totu, Shimla-11 (Id: C-11471)",
  "H.P. Govt. Dental College, Shimla (Id: C-11382)",
  "HPU Centre for Evening Studies, The Mall, Shimla (Id: C-11485)",
  "HP University College of Business Studies, Ava Lodge, Shimla (Id: C-11258)",
  "HP University Institute of Legal Studies, Ava Lodge, Shimla (Id: C-11413)",
  "H.P.University, P.G. Center, Shimla (Id: C-11352)",
  "H.P. University Regional Centre, Dharamshala (Id: C-16675)",
  "Indain Institute of Education, Hari Devi, Ghanahatti. Distt Shimla (Id: C-11534)",
  "Indian Institute of Education, Hari Devi Near Ghanahatti Distt Shimla (Id: C-11355)",
  "Indian institute of Legal Studies, Hari Devi, Ghanahatti, Distt Shimla (Id: C-11423)",
  "Indian institutes of management Technology & Research, Basal Teh. & Distt Una (Id: C-11361)",
  "Indira Gandhi Medical College, Shimla (Id: C-11340)",
  "Institutes of management studies, Makhnumajra, Baddi, Distt Solan (Id: C-11467)",
  "Institutes of Pharmacy & Emerging Sciences, Baddi, Distt Solan (Id: C-11331)",
  "Jagriti Institute of Management. PO Talyahar, Deodhar, Distt mandi (Id: C-11348)",
  "Jagriti Teachers Training College Deodhar, PO Talyahar, Distt Mandi (Id: C-11476)",
  "Janak Raj Mahajan, B.Ed. College Gangath, Teh. Nurpur, Distt Kangra (Id: C-11271)",
  "Jawalaji Degree College, Jawalamukhi, Teh Dehra, Distt kangra (Id: C-11477)",
  "Jupitor College of Education, Mairi, Distt Una (Id: C-11523)",
  "Kamakshi Nursing Institutes, Bassa Wazira, Nurpur, Distt Kangra (Id: C-11350)",
  "Kanta College of Education, Chalwara, Teh. Jawali, Distt Kangra (Id: C-11508)",
  "Kanwar Durga Chand Govt Degree College, Jaisinghpur, Distt Kangra (Id: C-11470)",
  "Kol Valley Institutes of Nursing, Vill Nehar, Harnora. Bilaspur (Id: C-11341)",
  "Krishma Education Centre, Vill. Ner Chowk, Distt Mandi (Id: C-11387)",
  "Kshatriya College of Education, Kathgarh Road, Nadaun, Teh. Indora, Kangra (Id: C-11293)",
  "Kshtriya College of Education, Kathgadh Road, Kursain, Indora, Distt Kangra (Id: C-11276)",
  "Kullu College of Education, Vill. Bohgana, PO Garse, Distt Kullu (Id: C-11405)",
  "Lakshay Institute of Education. Arki, Solan (Id: C-11347)",
  "Lala Jagat Narayan Himotkarsh Kanya Mahavidyalaya, Kotla Khurd, Distt Una (Id: C-11306)",
  "Lala Lilu Ram Educational Trust, Jabli PO Kyar, PO Oachghat, Distt Solan (Id: C-11363)",
  "Laurate Institute of Education & Training, Bharari, Shimla (Id: C-11369)",
  "Laureate Institute of Computer & IT Kathog, Jawalaji, Distt Kangra (Id: C-11375)",
  "LLR Institute of Management, Jabli-Kyar, PO Oachghat, Distt Solan (Id: C-11535)",
  "Lord Budha College of Education, Purana Bazar, Sundernagar, Dist mandi (Id: C-11267)",
  "Lord Mahavira B.Sc Nursing College. Ist Floor, PNB Building, Ropar Road, Nalagarh, Distt. Solan (Id: C-11317)",
  "L.R. Institute of Legal Studies, Jali-Kyar, Oachghat, Distt Solan (Id: C-11392)",
  "Maharani Laxmi Bai Kanya Mahavidyalaya, Bhareri, Distt. Hamirpur (Id: C-11458)",
  "Mata Bala Sundari College of Legal Studies, Shimla Road, Nahan, Distt Sirmour (Id: C-11426)",
  "Mehar Chand Mahajan DAV College, Kangra (Id: C-11442)",
  "Mehar Ram Ditta Memorial Physical Education College, Bhareri, Tehsil Bhoranj, Distt. Hamirpur (Id: C-11418)",
  "Minerva College of Education, Vill Changrara, PO Bhapoo, Teh. Indora, Distt Kangra (Id: C-11500)",
  "Minerva Education Society, Baggi, Tehsil & Distt Mandi (Id: C-11305)",
  "MLSM B.ED College, Sunder Nagar, Distt Mandi (Id: C-11428)",
  "M.L.S.M College, Sundernagar, Distt. Mandi (Id: C-11261)",
  "MNDAV Dental College, Tatul, PO Oachghat, Distt. Solan (Id: C-11406)",
  "Modern Education College, Annadale, Shimla (Id: C-11434)",
  "M.P. Govt. College, Amb Distt Una (Id: C-11327)",
  "MSCM Govt. Degree College, Thural, Distt Kangra (Id: C-11397)",
  "Murari Lal Memorial College of Nursing, Solan Distt. Solan (Id: C-11310)",
  "Nalanda College of Education, VPO Jhaniari, Distt Hamirpur (Id: C-11541)",
  "Namdhari Education Society, Bhojpur, Sundernagar, Distt Mandi (Id: C-11389)",
  "Neelam College of Education, 1249/999, Vill. Jimjima, Manja, PO Dul, teh. Jogindernagar, Distt mandi (Id: C-11262)",
  "Nehru Govt. Sanskrit College, Phagli, Shimla (Id: C-11321)",
  "Netaji Subhash Nursing College, Behind Cinema Hall Building, Palampur, Distt. Kangra (Id: C-11501)",
  "Noble College of Education, NH-21, Vill Seog, PO Pandoh, Distt Mandi (Id: C-11435)",
  "Noble Institute of Management Studies, Vill Seog, PO Pandoh, Tehsil Sadar, Distt. Mandi (HP) (Id: C-11351)",
  "Parmar College of Information & Technology, Kailash Nagar, Near Banehra, Tehsil Amb, Una (Id: C-11390)",
  "Priyadarshaini College of Education, VIll. Kudnu, Chowari, Distt Chamba (Id: C-11269)",
  "Pt. Anant Ram S.D. College, Baroh, Distt. Kangra (Id: C-11373)",
  "Pt. Sant Ram Govt. College, Baijnath, Distt Kangra (Id: C-11488)",
  "Rajiv Gandhi Memorial Govt. College, Choura-Maidan, Shimla (Id: C-11286)",
  "Rajiv Gandhi Post Graduate Ayurvedic College, Paprola, Distt Kangra (Id: C-11447)",
  "Rajkiya Kanya Mahavidyala, Lakkar Bazar, Shimla (Id: C-11427)",
  "Raj Rajeshwari College of Education, Ward No. 3, Partap Nagar. Distt Hamirpur (Id: C-11379)",
  "Ramanujam Royal College of Education, Vill. Mangal, Teh. Arki, Distt Solan (Id: C-11463)",
  "Rameshwari Teachers Training Institute Upper HPSEB Colony Sarabai, Distt Kullu (Id: C-11478)",
  "Rameshwari Teachers Training, Institute Upper HPSEB Colony Sarabai, Distt KUllu (Id: C-11502)",
  "R.C. College of Education, Dhanot, PO Adhwani, Teh. Dehra, Distt Kangra (Id: C-11453)",
  "RGM Mem. Govt. College, Jogindernagar, Distt Mandi (Id: C-11452)",
  "Ruldu Ram Garg S.D. College, Shri Naina Devi Ji, Distt. Bilaspur (Id: C-11337)",
  "Santan Dharam Sanskrit College Chamba (Id: C-11544)",
  "Sant Baba Dhangu Wale Gujjer Govt. Degree College, Beetan Distt Una (Id: C-11498)",
  "Sarvopalli Radha Krishan Institute Nogli, NH-22, Rampur Bushaher, Distt Shimla (Id: C-11291)",
  "Scared Heart Education Society, Gutkar, Teh. Sadar, C/O Laljee B.Ed Colalge Distt Mandi (Id: C-11536)",
  "School of Business Management, Bajhol, Distt Solan (Id: C-11521)",
  "School Of Law, HPU, Regional Centre, Dharamshala (Id: C-16676)",
  "School of Pharmacy. Bajhol, Distt Solan (Id: C-11512)",
  "SD Adarsh Sanskrit College, Dohgi, Teh. Bangana, Distt Una (Id: C-11385)",
  "SGSD Sanskrit College, Santokhgarh, Distt Una (Id: C-11518)",
  "Shanti Alya Institute of Education and Training, Vill. Rampur Keonthal, Distt Shimla (Id: C-11394)",
  "Shanti College of Education, Nakroh, Tehsil Amb, Distt. Una (Id: C-11465)",
  "Shanti Educational Society, Kailash Nagar, Nakroh, Teh. Amb. Distt Una (Id: C-11346)",
  "Shanti Niketan College of Education, Hira Nagar, Ward No-1, Distt Hamirpur (Id: C-11360)",
  "Sharan College of Education for Women, Ghurkhari, Distt Kangra (Id: C-11408)",
  "Shiksha Bharti B.Ed College, Kotla Khurd, Distt Una (Id: C-11260)",
  "Shiksha Bharti Institute of Education, Training & Research, Samoor Khurd, Bangana, Distt . Una (Id: C-11304)",
  "Shimla College of Education, Sheetal kunj Estate, Kamla Nagar, Sanjauli Distt Shimla (Id: C-11320)",
  "Shimla Nursing College Anadale, Shimla (Id: C-11489)",
  "Shiva College of Education, Abdhan (Panol), Distt Bilaspur (Id: C-11486)",
  "Shivalik Institutes of Nursing, Chibber Complex, Kamlanagar, Snajauli, Distt. Shimla (Id: C-11543)",
  "Shiv Shakti College of Advanced Society in Education, Kheri Road, Rajgarh, Distt Sirmour (Id: C-11504)",
  "Shoolini Institutes of Life Sciences and Business Management Anand Campus, The mall , Distt Solan (Id: C-11326)",
  "Shri Chander Dhar Govt. Degree College, Haripur, Distt. Kangra (Id: C-11342)",
  "Shri Lal Devi Annapurna, Sanskrit College, Ramsheela Lakkar Bazar, Kullu (Id: C-11333)",
  "Shri Ramanuj Sanskrit Mahavidyalaya Punjgain, Distt Bilaspur (Id: C-11549)",
  "Shri. Saraswati Sanskrit Degree College, Dangar, Teh. Ghurmarwin. Distt Bilaspur (Id: C-11308)",
  "Shri Satya Sai College of Education, Nadaun, Vill Kohla, Distt Hamirpur (Id: C-11462)",
  "Shri Shakti Sanskrit College, Shri naina Devi. Distt Bilaspur (Id: C-11380)",
  "Shri Vashistha Vidya Peeth Tungesh, PO Cheog, Distt Shimla (Id: C-11416)",
  "Shri Vishwa Nath Snaskrit College, Chakmoh, Teh. Barsar, Distt Hamirpur (Id: C-11454)",
  "Sidharth Govt. Degree College, Nadaun. Distt Hamirpur (Id: C-11487)",
  "Sister Nivedita Govt. Nursing College, IGMC, Shimla (Id: C-11356)",
  "Solan College of Business & Computer Education, Chambaghat, Solan (Id: C-11292)",
  "Solan Homeopathic Medical College and Hospital, Barog Bye-Pass, Kumarhatti, Distt. Solan (Id: C-11440)",
  "Sri Ram College of Yoga Education, Village Labkana, PO Saroo, Tehsil & Distt Chamba (Id: C-11460)",
  "St. Bede's College, Shimla (Id: C-11287)",
  "Sunaina Sanskrit Mahavidalaya, Swarghat, Nalagarh, Distt Solan (Id: C-11403)",
  "SVN College of Education, Tarkwari, (Bhoranj) Distt Hamirpur (Id: C-11527)",
  "SVSD Govt. College, Bhatoli, Distt Una (Id: C-11461)",
  "Swami V.G. Degree College, Shivnagar, PO Lahat, Tehsil Jaisinghpur, Distt. Kangra (Id: C-11455)",
  "Swami Vivekanand College, Chintpurni, Distt. Una (Id: C-11449)",
  "Swami Vivekanand Govt. Degree College Ghurmarwin, Distt Bilaspur (Id: C-11404)",
  "Thakur College of Education, Dhaliara, Teh. Dehra, Distt Kangra (Id: C-11288)",
  "Thakur Jagdev Chand Memorial Govt. College, Sujanpur Tihra, Distt Hamirpur (Id: C-11324)",
  "Trigart Sanskrit Mahavidyalaya, Shri Nandikeshwari Mandir, Kangra (Id: C-11371)",
  "Trisha College of Education, Thain, PO Jol Sappar, (RANGAS), Distt Hamirpur (Id: C-11494)",
  "University Institute of Information and Technology, H.P.U, Shimla (Id: C-11332)",
  "Vaidh Shankar Lal Memorial College of Education, VPO Chandi, Teh. Kasauli, Distt Solan (Id: C-11545)",
  "Vaishno College of Education Vill. Thapkour, PO Bhadroya, Teh. Nurpur, Distt kangra (Id: C-11302)",
  "Vallabh Govt. College, Mandi (Id: C-11280)",
  "Venkateshwar Shiksha Samiti, Vill Dhillon, PO Sultanpur, Distt Solan (Id: C-11414)",
  "Venkateshwar Vidyapeeth, Village Dhillo, Kumarhatti, Distt. solan (Id: C-11319)",
  "Vijay Institute of Higher Education, VPO Bhangrotu, Tehsil Sadar, Distt. Mandi (Id: C-11297)",
  "Vijay Memorial College of Education, Ner-Chowk, Distt Mandi (Id: C-11281)",
  "Vijay Vallabh College of Education, Nadaun at Bela, Distt Hamirpur (Id: C-11422)",
  "WRS Govt. College Dehri, Distt Kangra (Id: C-11354)",
  "BRILLIANT CENTRE OF INFORMATION TECHNOLOGY NERCHOWK (Id: C-31590)",
  "CAREER ACADEMY OF TECHNOLOGY & SOFTWARE PALAMPUR (Id: C-31408)",
  "CENTRE OF ASCENT TECHNOLOGY & SCIENCE DHARAMSHALA (Id: C-31594)",
  "CTNT STUDY CENTRE MANDI (Id: C-31083)",
  "DOEACC CENTRE, CHANDIGARH SHIMLA (Id: C-31347)",
  "M.S.PANWAR INSTITUTE OF COMMUNICATION AND MANAGEMENT , SOLAN (Id: C-31188)",
  "OMEGA COMPUTER INSTITUTION MANDI (Id: C-31092)",
  "WEBTECH COMPUTER EDUCATION SHIMLA (Id: C-31167)",
  "NATIONAL INSTITUTE OF FASHION TECHNOLOGY, KANGRA (Id: C-47474)",
  "Writers' Home (Id: C-22285)",
  "VEDVYAS CAMPUS (Id: C-27023)"
]