[
  "Achariya Arts and Science College (Id: C-6586)",
  "Achariya College of Education (Id: C-6571)",
  "Achariya College of Engineering Technology (Id: C-6516)",
  "Alpha B.Ed. College (Id: C-6572)",
  "Alpha College of Engineering & Technology (Id: C-6500)",
  "Amarnath College of Education (Id: C-6531)",
  "Arignar Anna Govt. Arts College (Id: C-6541)",
  "Arutperunchothi Ramalingasammy College of Education (Id: C-6515)",
  "Avvaiyar Govt. College for Women (Id: C-6532)",
  "Bharathiar Palkalaikoodam (Id: C-6558)",
  "Bharathidasan Govt. College for Women (Id: C-6509)",
  "Bharathiyar College of Engineering and Technology (Id: C-6497)",
  "Christ College of Engineering and Technology (Id: C-6522)",
  "College of Nursing, East Coast Institute of Medical Sciences (Id: C-6526)",
  "College of Nursing, Pondicherry Institute of Medical Sciences (Id: C-6537)",
  "Co-operative College of Education (Id: C-6539)",
  "Don Bosco College of Education and Research Institute (Id: C-6568)",
  "Dr. Anbu Paul College of Education (Id: C-6564)",
  "Dr. B.R. Ambedkar Government Law College (Id: C-6589)",
  "Dr. Kalaikannan College of Education for Women (Id: C-6556)",
  "Dr. S.J.S Paul Memorial College of Engineering and Technology (Id: C-6551)",
  "Dr. S.R.K. Govt. Arts College (Id: C-6525)",
  "French Institute of Pondicherry (Id: C-6570)",
  "Idhaya College of Arts and Science for Women (Id: C-6501)",
  "Immaculate College of Education for Women (Id: C-6511)",
  "Indira Gandhi College of Arts and Science (Id: C-6523)",
  "Indira Gandhi Medical College & Research Institute (Id: C-6561)",
  "Indirani College of Nursing (Id: C-6563)",
  "Kanchi Mamunivar Centre for Post Graduate Studies (Id: C-6502)",
  "Kasthurba College for Women (Id: C-6504)",
  "Krishnasamy College of Education for Women (Id: C-6533)",
  "Loyola Institute of Teacher Education (Id: C-6520)",
  "Mahatma Gandhi Govt. Arts College Chalakkara Post (Id: C-6566)",
  "Mahatma Gandhi P.G. Institute of Dental Sciences (Id: C-6548)",
  "Mahe Co-operative College of Higher Education & Technology (Id: C-6545)",
  "Mahe Co-operative College of Teacher Education (Id: C-6583)",
  "Mahe Institute of Dental Sciences & Hospital (Id: C-6503)",
  "ManakulaVinayagar Institute of Technology (Id: C-6499)",
  "Mother Theresa Post Graduate and Research Institute of Health Sciences (Id: C-6554)",
  "Nehru College of Education (Id: C-6562)",
  "Perunthalaivar Kamarajar College of Education (Id: C-6542)",
  "Perunthalaivar Kamarajar Govt. Arts College (Id: C-6552)",
  "Perunthalaivar Kamarajar Institute of Engineering and Technology (Id: C-6508)",
  "Pondicherry Engineering College (Id: C-6581)",
  "Pondicherry Institute of Medical Sciences (Id: C-6549)",
  "Pondicherry University Campus I (Id: C-6567)",
  "Pondicherry University Community College (Id: C-6514)",
  "Pope John Paul II College of Education (Id: C-6588)",
  "Raak Nursing and Paramedical College (Id: C-6512)",
  "Rajiv Gandhi Arts & Science College (Id: C-6506)",
  "Rajiv Gandhi Ayurveda Medical College (Id: C-6555)",
  "Rajiv Gandhi College of Engineering and Technology (Id: C-6580)",
  "Rajiv Gandhi College of Veterinary & Animal Sciences (Id: C-6519)",
  "Rathnavel Subramaniam College of Arts and Science (Id: C-6543)",
  "Regency College of Education (Id: C-6518)",
  "Regency Institute of Technology (Id: C-6521)",
  "R.V.S College of Computer Application (Id: C-6505)",
  "RVS College of Education (Id: C-6534)",
  "RVS College of Engineering and Technology (Id: C-6577)",
  "R.V.S Institute of Management Studies and Computer Application (Id: C-6530)",
  "Sabari College of Education (Id: C-6507)",
  "Sabari College of Nursing (Id: C-6584)",
  "Saradha Gangadharan College (Id: C-6576)",
  "Senthil College of Education (Id: C-6524)",
  "SHRI KRISHNAA COLLEGE OF ENGINEERING AND TECHNOLOGY (Id: C-49748)",
  "Sree Narayana College of Education (Id: C-6557)",
  "Sri Balaji Law School (Id: C-6540)",
  "Sri Ganesh College of Engineering & Technology (Id: C-6544)",
  "Sri Manakula Vinayagar Engineering College (Id: C-6553)",
  "Sri Manakula Vinayagar Medical College and Hospital (Id: C-6550)",
  "Sri Manakula Vinayagar Nursing College (Id: C-6569)",
  "Sri Sai Ram College of Education (Id: C-6579)",
  "Sri Venkateshwaraa College of Para Medical Sciences (Id: C-6578)",
  "Sri Venkateswaraa Medical College & Hospital & Research Centre (Id: C-6536)",
  "Sri Venkateswara College of Education (Id: C-6585)",
  "St. Anne s College of Education and Research Centre (Id: C-6527)",
  "Tagore Arts College (Id: C-6587)",
  "TVR College of Education (Id: C-6513)",
  "Usha Latchumanan College of Education (Id: C-6565)",
  "Vasavi College of Education (Id: C-6517)",
  "Vector Control Research Centre (I.C.M.R.) (Id: C-6559)",
  "Venkateswara College of Education (Id: C-6582)",
  "Vetri Venkateswara College of Education (Id: C-6529)",
  "Vivekanandha College of Education (Id: C-6546)",
  "PONNAIYAH RAMAJAYAM INSTITUTE OF SCIENCE AND TECHNOLOGY, PUDUCHERRY-605 007 (Id: C-31057)",
  "INDIRA GANDHI INSTITUTE OF DENTAL SCIENCES (Id: C-47764)",
  "KASTURBA GANDHI NURSING COLLEGE (Id: C-47763)",
  "MAHATMA GANDHI MEDICAL COLLEGE AND RESEARCH INSTITUTE (Id: C-47762)",
  "PANDIT JAWAHARLAL NEHRU COLLEGE OF AGRICULTURE AND RESEARCH INSTITUTE, KARAIKAL (Id: C-45370)",
  "Aarupadai Veedu Medical College and Hospital (Id: C-10217)",
  "Vinayaka Mission's College of Education (Id: C-10223)",
  "Vinayaka Mission's College of Nursing (Id: C-10226)",
  "Vinayaka Mission's College of Nursing (Id: C-10227)",
  "Vinayaka Mission's Medical College and Hospital (Id: C-10215)"
]