[
  "Adesh Institute of Dental Sciences & Research, Baranala Road, Bathinda (Id: C-29246)",
  "Adesh Institute of Medical Sciences & Research, Barnala Road (Id: C-29187)",
  "Adesh Institute of Pharmacy & Biomedical Sciences, Bathinda (Id: C-10496)",
  "College of Nursing, Adesh Institute of Medical Sciences & Research, Bathinda (Id: C-29249)",
  "College of Physiotherapy, Adesh Institute of Medical Sciences & Research, Bathinda (Id: C-29162)",
  "Adarsh College of Nursing, Village ChontKheri PatialaSamana Road, Patiala (Id: C-29130)",
  "Aggarwal College of Nursing, Tehsil Road, Guru Harsahai, Distt. Ferozepur (Id: C-29232)",
  "Ajit Nursing Institute, Sunam, Distt. Sangrur (Id: C-29152)",
  "All Saints Institute of Medical Sciences & Research, On Sidhwan Canal, P.O. Jaspal Bangar, Ludhiana (Id: C-29122)",
  "AMAN BHALLA COLLEGE OF NURSING, KOTLI (Id: C-49592)",
  "Aman Bhalla College of NUrsing, Village Kotli, Jammu Amritsar Highway, Pathankot (Id: C-29247)",
  "Amar Professional College of Nursing, VPO Dayalpura, Zirakpur-Patiala Highway, Tehsil Derabassi, Distt. Mohali (Id: C-29201)",
  "Ambika College of Nursing, VPO Badali, Badala Road, Distt. Mohali (Id: C-29189)",
  "Anand College of Nursing, Jethuwal, Batala Road , Amritsar (Id: C-29197)",
  "Anil Baghi College of Nursing, Village Malwal, Ferozepur Moga Road, Ferozepur (Id: C-29248)",
  "APS College of Nursing, VPO Malsian, Distt. Jalandhar (Id: C-29188)",
  "Army College of Nursing, C/o Military Hospital, Jalandhar Cantt (Id: C-29235)",
  "Baba Banda Bahadur College of Nursing, Faridkot (Id: C-29173)",
  "Baba Farid College of Nursing, Faridkot Road, Kotkapura (Id: C-29227)",
  "Baba Jaswant Singh Dental College Hospital & Research Institute, Sector 40, Urban Estate, Ludhiana (Id: C-29252)",
  "BABA MANGAL SINGH NURSING INSTITUTE, BARNALA ROAD, BUGHIPURA (Id: C-49590)",
  "Baba Mehar Singh Memorial College of Nursing, VPO Purana Shalla, Distt. Gurdaspur (Id: C-29133)",
  "Baba Moni ji Maharaj, College of Nursing, Lehra Mohabbat, Distt. Bathinda (Id: C-29181)",
  "Babe Ke Ayurvedic Medical College & Hospital, VPO Daudhar, Via Ajitwal (Id: C-29202)",
  "Babe Ke Institute of Nursing, VPO Daudhar, Distt.Moga (Id: C-29234)",
  "Bee Kay Institute of Nursing, VPO Behrampur Zimidara, Distt. Ropar (Id: C-29171)",
  "Bengal Institute of Health Sciences, Village Jalaldiwal, Teh. Raekot, Distt. Ludhiana (Id: C-29207)",
  "Bhai Gurdas General Nursing College, Vpo. Nandpur Kesho, Sirhind Road, Patiala (Id: C-29149)",
  "BHAI GURDAS INSTITUTE OF NURSING, SANGRUR (Id: C-49593)",
  "Bharat Institute of Nursing Training, Jalandhar Nakodar Road, VPO Mundh, Distt. Jalandhar (Id: C-29117)",
  "Bibi Chhankaur College of Nursing, Sardulgarh, Mansa (Id: C-29114)",
  "Bibi Rehmete Christian College of Nursing, Village Kot, Ranjit Sagar Dam Road, Distt. Gurdaspur (Id: C-29230)",
  "BST College of Nursing, Beharipur (Khera Dona), Distt. Kapurthala (Id: C-29124)",
  "Christian Dental College, Brown Road, Ludhiana (Id: C-29150)",
  "Christian Medical College, Brown Road, Ludhiana (Id: C-29209)",
  "College of Nursing, Adesh Institute of Medical Sciences, Kotkapura Road, Muktsar (Id: C-29139)",
  "College of Nursing, Christian Medical College, Brown Road, Ludhiana (Id: C-29203)",
  "College of Nursing, Dayanand Medical College, Civil Lines, Ludhiana (Id: C-29190)",
  "College of Nursing, Govt. Medical College, Majitha Road, Amritsar (Id: C-29182)",
  "College of Nursing, Govt. Rajindra Hospital, Patiala (Id: C-29211)",
  "College of Nursing, Mohan Dai Oswal Cancer Treatment & Research Foundation, G.T. Road, Sherpur Bye Pass, Ludhiana-141009 (Id: C-29163)",
  "College of Nursing, Public Khalsa College for Women, VPO Kandhala Jattan (Adda Saran), Distt. Hoshiarpur (Id: C-29118)",
  "College of Nursing, Sigma Nursing Training Institute, Dakhni Bye Pass, Gill Road, Ludhiana (Id: C-29206)",
  "College of Physiotherapy, Adesh Institute of Medical Sciences, Kotkapura Road, Muktsar (Id: C-29158)",
  "College of Physiotherapy, Christian Medical College, Ludhiana (Id: C-29135)",
  "Dasmesh College of Nursing, Talwandi Road, Faridkot (Id: C-29165)",
  "Dasmesh Institute of Research & Dental Sciences, Talwandi Road, Faridkot (Id: C-29210)",
  "Davindra Memorial College of Nursing, Khemkaran Road, Patti, Distt. Tarn Taran-143416 (Id: C-29214)",
  "DAV Institute of Physiotherapy & Rehabilitation, MHRM, G.T. Road, Jalandhar (Id: C-29142)",
  "Dayanand Ayurvedic College, Mahatma Hans Raj Marg, G.T. Road, Jalandhar (Id: C-29116)",
  "Dayanand Medical College,Civil Lines, Ludhiana (Id: C-29255)",
  "Desh Bhagat Ayurvedic College, VPO Saunti, Amloh (Id: C-29215)",
  "Desh Bhagat College of Nursing, Village Sounti Amloh Road, Mandi Gobindgarh, Distt. Fatehgarh Sahib-147301 (Id: C-29226)",
  "Desh Bhagat Dental College & Hospital, Kotkapura Road, Muktsar (Id: C-29205)",
  "Dr Shyam Lal Thapar College of Nursing, Amritsar Barnala Bypass Road, Moga (Id: C-29138)",
  "Genesis Institute of Dental Sciences & Research(Dental College & Hospital), Ferozepur- Moga Road, Ferozepur (Id: C-29115)",
  "Gian Sagar College of Nursing, Ram Nagar (Banur) Distt. Patiala (Id: C-29168)",
  "Gian Sagar College of Physiotherapy, Ram Nagar, VPO Banur, Distt. Patiala (Id: C-29253)",
  "Gian Sagar Dental College, Village Ram Nagar, Banur (Id: C-29192)",
  "Gian Sagar Medical College & Hospital, Vill. Ram Nagar, Banur (Id: C-29185)",
  "Govt. Ayurvedic College, Lower Mall, Patiala (Id: C-29229)",
  "Govt. Dental College, Amritsar (Id: C-29159)",
  "Govt. Dental College, Sangrur Road, Patiala (Id: C-29178)",
  "Govt. Medical College, Majitha Road, Amritsar (Id: C-29193)",
  "Govt. Medical College, Sangrur Road, Patiala (Id: C-29191)",
  "Gursewa College of Nursing, VPO Panam, Garhshankar, Distt. Hoshiarpur (Id: C-29241)",
  "Guru Gobind Singh College of Nursing, Talwandi Sabo, Sardulgarh Road Distt. Bathinda (Id: C-29169)",
  "Guru Gobind Singh Medical College, Sadiq Road, Faridkot (Id: C-29238)",
  "Guru Nanak Ayurvedic Medical College, Barkandi Road, Near Ajit Cinema (Id: C-29125)",
  "Guru Nanak Ayurvedic Medical College & Research Institute, Malerkotla Road, VPO Gopalpur (Id: C-29218)",
  "Guru Nanak College of Nursing, P.O. Dehlon, Gopalpur, Distt. Ludhiana (Id: C-29240)",
  "Guru Nanak College of Nursing, VPO Dhahan Kaleran,Distt. Nawanshahr (Id: C-29225)",
  "Guru Nanak Dev Dental College & Research Institute, Patiala Bathinda Road, Sunam (Id: C-29119)",
  "Guru Teg Bahadur College of Nursing, Jandiala Guru, Distt. Amritsar (Id: C-29175)",
  "Hakim Kishori Lal College of Nursing, Guruharsahai, Distt. Ferozepur (Id: C-29220)",
  "Homoeopathic Medical College, Hanumangarh Road, Abohar (Id: C-29172)",
  "Indo American College of Nursing, Amritsar Road, Moga-142001 (Id: C-29195)",
  "Institute of Nursing Education, Guru Teg Bahadur Sahib (C) Hospital, Shastri Nagar, Model Town, Ludhiana (Id: C-29140)",
  "International College of Nursing, Ferozepur G.T. Road, Village Piddi, Distt. Tarn Taran (Id: C-29156)",
  "Jhulka College of Nursing & Health Sciences, Julka Nagar, Batala Road, Qudian, Distt. Gurdaspur (Id: C-29132)",
  "JUSS Institute of Nursing, VPO Sekhwan, Distt. Gurdaspur (Id: C-29213)",
  "Kalyan Homoeopathic Medical College & Hospital, Jandiala Road, Tran Taran (Id: C-29161)",
  "KD College of Nursing, Village Dohlron, Mahilpur-Garhshankar Road, Post office Mahilpur, Distt. Hoshiarpur (Id: C-29151)",
  "Khalsa College of Nursing, Amritsar (Id: C-29245)",
  "Kular College of Nursing, VPO Kishangarh, Distt. Ludhiana (Id: C-29113)",
  "Lajjiawati Jain Memorial Nursing Institute, Barnala Chowk, Raekot (Id: C-29196)",
  "Lala Lajpat Rai Institute of Nursing Education, Gulab Devi Hospital, Jalandhar (Id: C-29224)",
  "Lala Laj Pat Rai Institute of Nursing, Moga (Id: C-29128)",
  "Life Guard Nursing Institute, Village Bhindran, Kaloudi Road, Sangrur (Id: C-29219)",
  "Lord Mahavira Homeopathic Medical College, Kitchlu Nagar, Hehneman Road, Ludhiana (Id: C-29243)",
  "LORD SHIVA COLLEGE OF NURSING, HAMIRGARH (Id: C-49594)",
  "Luxmi Bai Institute of Dental Sciences & Hospital, Sirhind Road, VPO Baran (Id: C-29233)",
  "Mahatma Hans Raj DAV Institute of Nursing & Hospital, MHRM, G.T. Road, Jalandhar (Id: C-29144)",
  "Mai Bhago Ayurvedic College (For Women), Ferozepur Road, Muktsar (Id: C-29242)",
  "Mai Bhago College of Nursing, Village Piddi, Distt. Tarn Taran (Id: C-29184)",
  "Malwa College of Nursing, Faridkot Road, Kotkapura (Id: C-29160)",
  "Malwa College of Nursing, Mehal Kalan, Distt. Barnala (Id: C-29254)",
  "Mata Gujri Institute of Nursing, Village Mehmadpur, P.O. Adampur, Distt. Jalandhar (Id: C-29170)",
  "Mata Sahib Kaur College of Nursing, VPO Balongi,Teh. & Distt. Mohali- 140301 (Id: C-29236)",
  "Mata Saraswati Institute of Nursing Education, VPO Birmi, Distt. Ludhiana (Id: C-29223)",
  "MEERA MEDICAL INSTITUTE OF NURSING AND HOSPITAL, ABOHAR (Id: C-49588)",
  "Mother Mary s Institute of Nursing, Deowal Road, Nasrala, Distt. Hoshiarpur (Id: C-29147)",
  "Nam Rattra International College of Nursing, Loharka Road, Near Power House, Amritsar. (Id: C-29180)",
  "National Dental College, VPO Gulabgarh, Tehsil Dera Bassi (Id: C-29204)",
  "National Institute of Nursing, Village Khurana, Distt. Sangrur (Id: C-29228)",
  "Netaji Subhas Institute of Sports, Moti Bagh, Patiala (Id: C-29157)",
  "Nightingale College of Nursing, VPO Narangwal Kalan, Distt. Ludhiana (Id: C-29136)",
  "Phoneix, The Global Institute of Nursing, Vill. Rampur, Lambra (Id: C-29120)",
  "PUNJAB INSTITUTE OF MEDICAL SCIENCES, JALANDHAR (Id: C-46108)",
  "Punjab Public College of Nursing, VPO. Katar Singh Wala, Mansa Road, Distt.Bathinda (Id: C-29176)",
  "Rayat Bahra College of Nursing, Village Sohauran, Tehsil Kharar, Distt. Mohali-140104 (Id: C-29221)",
  "Rayat Bahra College of Nursing, VPO Bohan, Tehsil & Distt. Hoshiarpur (Id: C-29239)",
  "Rayat Bahra Dental College, Village Daon Majra, Tehsil Kharar (Id: C-29141)",
  "Royal Institute of Nursing, Village Jaito Sarja, Tehsil Batala, Distt. Gurdaspur- 143505 (Id: C-29244)",
  "Saint Sahara Ayurvedic Medical College & Hospital, Kot Shameer, Bathinda (Id: C-29177)",
  "Saint Soldier College of Physiotherapy & Rehabilitation, Basant Vihar, Nakodar Road, VPO Khambra (Jalandhar) (Id: C-29194)",
  "Sandhu Institute of Nursing, Mahalon, Nawanshahr (Id: C-29154)",
  "Sanjeevani College of Nursing, Village Daudpur, Khanna-141417 (Id: C-29217)",
  "Sant Baba Bhag Singh Institute of Nursing, Village Khiala, PO Pandhiana, Distt. Jalandhar (Id: C-29212)",
  "Saraswati Nursing Institute, Kurali-Morinda Road, Village Dhyanpura, Distt. Ropar (Id: C-29186)",
  "Saraswati Professional & Higher Education College of Nursing, VPO-Gharuan, Tehsil-Kharar, Mohali (Id: C-29127)",
  "SBS College of Nursing, Village Sodewala, Malanwala Road, Distt. Ferozepur (Id: C-29164)",
  "SBS Institute of Nursing, Village Sohian Kalan, Tehsil Majitha, Fatehgarh Churian Road, Distt. Amritsar (Id: C-29166)",
  "SGL College of Nursing, Village Semi, P.O. Khajurala, Distt. Jalandhar (Id: C-29200)",
  "Shaheed Kartar Singh Sarabha Ayurvedic College & Hospital, VPO Sarabha (Id: C-29208)",
  "Shaheed Kartar Singh Sarabha College of Nursing, Sarabha, Distt Ludhiana (Id: C-29237)",
  "Shaheed Kartar Singh Sarabha Dental College, VPO Sarabha, Distt. Ludhiana (Id: C-29126)",
  "Shiv Shakti College of Nursing, Bhikhi, Distt. Mansa (Id: C-29153)",
  "Shree Lakshmi Narayan Ayurvedic College, O/S Lohgarh Gate, Amritsar (Id: C-29148)",
  "Shri Guru Ram Dass College of Nursing, Canal Road, Hoshiarpur (Id: C-29250)",
  "Shri Guru Ram Dass Nursing Institute, Pandher, Amritsar (Id: C-29131)",
  "Silver Oaks College of Nursing, Abhipur, Tehsil Khizrabad, Distt. Mohali (Id: C-29121)",
  "Smt Urmila Devi Ayurvedic College of Medical Sciences & Hospital, VPO Kharkan, Una Road (Id: C-29222)",
  "Smt. Urmila Devi Institute of B.Sc. (N), VPO Kharkan, Hoshiarpur (Id: C-29216)",
  "Sri Guru Hargobind College of Nursing, Opposite Reliance Petrol Pump, Raikot-141109 (Id: C-29179)",
  "Sri Guru Harkrishan Sahib College of Nursing, Sohana (Id: C-29155)",
  "Sri Guru Nanak Dev Homoeopathic Medical College, Canal Road, Barewal, Near Ayali Kalan, Near Punjab Agriculture University, Ludhiana (Id: C-29251)",
  "Sri Guru Ram Das College of Nursing, Near Gurdwara Shaheed Gunj, Sri Amritsar (Id: C-29198)",
  "Sri Guru Ram Das Institute of Dental Sciences & Research, G.T. Road, Amritsar (Id: C-29174)",
  "Sri Guru Ram Das Institute of Medical Sciences & Research, VPO Vallah (Id: C-29146)",
  "Sri Satya Sai Murlidhar Ayurvedic College, G.T. Road, VPO Dunike, Moga (Id: C-29129)",
  "SRI SUKHMANI DENTAL COLLEGE AND HOSPITAL, DERABASSI (Id: C-49215)",
  "SRI SUKHMANI DENTAL COLLEGE & HOSPITAL, DERABASSI (Id: C-48011)",
  "Sri Sukhmani Institute of Nursing, Dera Bassi, Distt. Mohali (Id: C-29199)",
  "State Institute of Nursing & Paramedical Sciences, Badal (Id: C-29167)",
  "SUKHMANI DENTAL COLLEGE and HOSPITAL, DERABASSI (Id: C-48339)",
  "SV Memorial College of Nursing, VPO Moodhal, Near Verka, Amritsar (Id: C-29145)",
  "Swami Premanand College of Nursing, G.T. Road, Mukerian, Distt. Hoshiarpur-144211 (Id: C-29183)",
  "Swift Institute of Nursing, Village Ghaggar Sarai, Teh. Rajpura Distt. Patiala (Id: C-29123)",
  "University College of Nursing, Faridkot (Id: C-29137)",
  "University College of Physiotherapy, Faridkot (Id: C-29143)",
  "UNIVERSITY INSTITUTE OF PHARMACY, FARIDKOT (Id: C-46107)",
  "VMS College of Nursing & Paramedical Sciences, Said Mubarak, Amritsar Road, Batala (Id: C-29134)",
  "Chitkara College of Education for Women (Id: C-24711)",
  "Chitkara College of Pharmacy (Id: C-24709)",
  "Chitkara School of Planning & Architecture (Id: C-24712)",
  "College of Dairy Science & Technology (Id: C-453)",
  "College of Fisheries (Id: C-452)",
  "College of Veterinary Science (Id: C-451)",
  "Khalsa Veterinary College (Id: C-450)",
  "Polytechnic College (Id: C-454)",
  "School of Animal Biotechnology (Id: C-449)",
  "Akarshan College of Education, Old Tara Garh Road, Dinanagar Gurdaspur. (Id: C-27889)",
  "Aman Bhalla College of Education, Kotli, Pathankot (Id: C-27852)",
  "Anand College of Education for Women, Jhethuwal, Batala Road, Amritsar. (Id: C-27984)",
  "Angel s College of Education Mamun, Pathankot (Id: C-27968)",
  "APJ College of Fine Arts Jalandhar (Id: C-27900)",
  "Army Institute of Higher Education, Pathankot. (Id: C-27932)",
  "ASSM College, Mukandpur (Id: C-27877)",
  "Baba Banda Singh Bahadur College of Education, Vill. Mullianwal, Bidhipur Fatak, Dhariwal, Gurdaspur. (Id: C-27876)",
  "Baba Budha College Bir Sahib. (Id: C-27913)",
  "Baba Mehar Singh Memorial College of Education, Purana Shala, Gurdaspur. (Id: C-27878)",
  "BBK DAV College for women Amritsar (Id: C-27868)",
  "B D Arya Girls College Jalandhar (Id: C-27871)",
  "Bebe Nanaki Khalsa College for Women, Dhariwal (Id: C-27975)",
  "Bebe Nanki University College, Vill. Mithra (Id: C-27980)",
  "BLM Girls College Nawan Shehar (Id: C-27945)",
  "B.U.C. College, Batala (Id: C-27960)",
  "Chacha Satyapal Tuli Memorial College of Education,Vill raipur, P.O Kathlour, Tehsil Pathankot. (Id: C-27935)",
  "Cheema College of Education, VPO Kishan Kot, Tehsil Batala, Gurdaspur. (Id: C-27920)",
  "CT College of Education Jalandhar. (Id: C-27948)",
  "DAN College of Edu. for Women Nawan Shehar (Id: C-27924)",
  "D.A.V. College Amritsar (Id: C-27938)",
  "D.A.V.College Jalandhar (Id: C-27912)",
  "D.A.V College of Education for Women Amritsar (Id: C-27869)",
  "DIPS College (Co-Education) Dhilwan, Kapurthala (Id: C-27885)",
  "DIPS College of Education, Dhilwan, Distt Kapurthala (Id: C-27964)",
  "Doaba College Jalandhar (Id: C-27958)",
  "DRV DAV Centenary College Phillaur (Jalandhar) (Id: C-27950)",
  "GGS Govt.College Jandiala (Jalandhar) (Id: C-27851)",
  "G.G.S. Khalsa College, Sarhali (Distt. Tarn Taran) (Id: C-27875)",
  "GNBL Ramgarhia College for Women, Phagwara (Id: C-27864)",
  "GN College for Women Banga (Id: C-27992)",
  "G.N. College Sukhchainana Sahib (Phagwara) (Id: C-27995)",
  "GND University College, Near Govt. College of Edu., Ladowali Rd. (Id: C-27988)",
  "GN Khalsa College Daroli Kalan (Jalandhar) (Id: C-27977)",
  "G. N. Khalsa College Sultanpur Lodhi (Kapurthala ) (Id: C-27879)",
  "GN Khalsa Girls College, Baba Sang Dhesian (Jalandhar) (Id: C-27847)",
  "GN National College for Women Nakodar (Id: C-27973)",
  "GN National College Nakodar (Id: C-27859)",
  "GN Navbharat College Narur Panchhat (Kapurthala) (Id: C-27955)",
  "GN Prem Karamsar College Nadala (Kapurthala) (Id: C-27971)",
  "Golden College of Education, Hanuman Chowk, Gurdaspur (Id: C-27978)",
  "Govt. Arts & Sports College , Jalandhar (Id: C-27855)",
  "Govt. College Ajnala (Distt. Amritsar) (Id: C-27999)",
  "Govt. College Bholath (Kapurthala) (Id: C-27892)",
  "Govt. College Gurdaspur (Id: C-27909)",
  "Govt. College of Education Jalandhar (Id: C-27873)",
  "Govt. College of Physical Education, Patti (Tarn Taran). (Id: C-27904)",
  "Govt. College Patti (Distt. Tarn Taran) (Id: C-27856)",
  "Govt. G.N. College Kala Afghana (Gurdaspur) (Id: C-27926)",
  "GRD College for Women Phagwara (Id: C-27953)",
  "Guru Arjan Dev Khalsa College, Chohla Sahib, Tarn Taran (Id: C-27917)",
  "Guru Nanak College Batala (Id: C-27916)",
  "Guru Nanak College of Education for Women, Kapurthala (Id: C-27983)",
  "Guru Nanak Dev University College, Chung, Khemkaran Road, Near Bhikhiwind (Id: C-27861)",
  "Guru Nanak Dev University College, Narot Jaimal Singh (Id: C-27974)",
  "Guru Nanak Dev University College, Verka (Id: C-27921)",
  "Guru Nanak Dev University Regional Campus (Id: C-27854)",
  "Guru Nanak Dev University Regional Campus (Id: C-27969)",
  "Guru Nanak Dev University Regional Campus, Fattu Dhinga, Sultanpur Lodhi (Id: C-27922)",
  "Guru Nanak Dev University Regional Campus, Sathiala (Id: C-27863)",
  "Hans Raj Mahila Maha Vidyalaya, Jalandhar (Id: C-27957)",
  "Hindu College Amritsar (Id: C-27893)",
  "Hindu Kanya College Kapurthala (Id: C-27998)",
  "Hindu Kanya Mahavidayala Dhariwal (Id: C-27965)",
  "Innocent Heart College of Education, Green Model Town, Jalandhar (Id: C-27903)",
  "JDS College of Education, Vill. Kot, Tehsil Thar Kalan, Gurdaspur. (Id: C-27972)",
  "Kamla Nehru College for Women Phagwara. (Id: C-27848)",
  "Kamla Nehru College of Education For Women, Phagwara (Id: C-27949)",
  "Kanya Maha Vidyalaya Jalandhar (Id: C-27898)",
  "K.C. College of Education, NawanShehar (Id: C-27907)",
  "KCL Institute of Law, Jalandhar. (Id: C-27910)",
  "Khalsa College Amritsar (Id: C-27937)",
  "Khalsa College, Chawinda Devi, Amritsar (Id: C-27914)",
  "Khalsa College for Women Amritsar (Id: C-27940)",
  "Khalsa College of Education Amritsar (Id: C-27866)",
  "Khalsa College of Physical Education, VPO Heir, Dist Amritsar. (Id: C-27867)",
  "Kirpal Sagar College of Education, Near Rahon, Nawan Shehar (Id: C-27982)",
  "KRM DAV College Nakodar (Id: C-27858)",
  "Lilly Swords Mathodist College of Education, Kanuwan Road, Batala. (Id: C-27872)",
  "Lord Krishna College of Education, Vill Dera Saidan, Sultanpur Lodhi, Kapurthala (Id: C-27894)",
  "Lyallpur Khalsa College of Education For Women, Jalandhar (Id: C-27979)",
  "Ly. Khalsa College for Women Jalandhar (Id: C-27902)",
  "Ly. Khalsa College Jalandhar (Id: C-27849)",
  "Majha College for Women, Tarn Taran. (Id: C-28003)",
  "Mata Ganga Girls College Tarn Taran (Id: C-28007)",
  "Mata Gujri Memorial College of Education, Balwanda, Gurdaspur (Id: C-27887)",
  "Mata Gujri Memorial College, Vill. Balwanda, Teh. Kahnuwan, Gurdaspur. (Id: C-27985)",
  "MGN College of Education Jalandhar (Id: C-27874)",
  "MGSM Janta College Kartarpur (Id: C-27923)",
  "M.K. College of Education, Vill. Shahpur, PO Udhopur, Via Jamsher Khas, Jalandhar (Id: C-27883)",
  "Mohan Lal Memorial Institute of Education, Mudhal, Near Verka, Batala Road, Amritsar. (Id: C-28000)",
  "Mohan Lal Uppal D.A.V.College Phagwara (Id: C-27962)",
  "M.R.S. Punjab Police Academy Phillaur (Id: C-27961)",
  "NJSA Govt. College Kapurthala (Id: C-27976)",
  "Om Prakash Memorial College of Education, Vill. Dyalpur, Tehsil Dhilwan, Kapurthala (Id: C-27941)",
  "Pandit Mohan Lal SD College for Girls, Dera Baba Nanak Road, Fathehgarh Churian, Gurdaspur. (Id: C-27886)",
  "Paradise College of Education, Gita Colony, Kala Sangian Road, Jalandhar. (Id: C-27860)",
  "Pathankot College of Education, Opp. Canada Palace Behind AB College Mammon, Pathankot (Id: C-27845)",
  "PCM SD College for Women Jalandhar (Id: C-27947)",
  "P.T.M. Arya College, Noor Mehal (Jalandhar). (Id: C-27939)",
  "Ramgarhia College of Education Phagwara (Id: C-27906)",
  "Ramgarhia College Phagwara (Id: C-27846)",
  "R.K. Arya College Nawan Shehar (Id: C-27951)",
  "RR Bawa DAV. College for Girls Batala (Id: C-27862)",
  "RRMK Arya Mahila Maha Vidyalaya Pathankot (Id: C-27946)",
  "Sai College of Education, Jadla, NawanShehar (Id: C-27996)",
  "Saint Soldier Law College, Behind R.E.C.(N.I.T.), Jalandhar. (Id: C-27880)",
  "Sant Baba Bhag Singh Institute of Education, Vill. Khiala P.O.Padhiana, Near Adampur Doaba, Jalandhar (Id: C-28001)",
  "Sant Baba Hazara Singh College of Education, Vill. Chhina, PO. Naushehra Majha Singh, Gurdaspur. (Id: C-27970)",
  "Sant Hira Das Kanya Mahavidyalaya Kala Sanghian (Kapurthala) (Id: C-27936)",
  "SBDSM Khalsa College Domeli (Kapurthala) (Id: C-27994)",
  "SDAM College Dina Nagar (Id: C-27986)",
  "S.D. College for Women Sultanpur Lodhi (Kapurthala) (Id: C-27888)",
  "S.D.S.P. Memorial College for Women, Rayya (Distt. Amritsar) (Id: C-27929)",
  "Seva Devi College of Education, Tarntaran . (Id: C-27850)",
  "Sewa Devi S.D.College Tarn Taran (Id: C-27943)",
  "S.G.A.D. College Khadoor Sahib (Distt Tarn Taran) (Id: C-27915)",
  "SGAD College of Education, Khadoor Shahib, Distt-Tarn Taran (Id: C-27882)",
  "S.G.A.D.Govt. College Tarn Taran (Id: C-27881)",
  "S.G.T.B. Govt. College, Sathiala (Id: C-27908)",
  "Shaheed Baba Deep Singh College, Pahuwind, Near Bikiwind, Tarn Taran (Id: C-27959)",
  "Shaheed Bhagat Singh College of Education, Patti. (Id: C-27919)",
  "Shaheed Ram Singh Pathania Memorial College, Niari Block Kalan (Id: C-27967)",
  "Shahzada Nand College. Maqbul Road, Amritsar (Id: C-27944)",
  "Shiwalik College of Education, Vill. Mustafabad Jatta, PO Babbehali, Gurdaspur. (Id: C-27865)",
  "Shri Raghunath Girls College, Circular Road, Jandiala Guru, Amritsar. (Id: C-27901)",
  "Shri Sai College of Education, Badani, Pathankot. (Id: C-27918)",
  "Shri Vishwa Mittar Sekhari College of Law, Plot No. 26-30, Focal Point, Batala (Id: C-27991)",
  "Sidana Institute of Education, Khiala Khurd, Near Ram Tirth, Amritsar. (Id: C-27987)",
  "SL Bawa DAV College, Batala (Id: C-27853)",
  "SMDRSD College of Education Pathankot (Id: C-27952)",
  "S.N. College Banga (Id: C-27981)",
  "S.N. College Qadian (Id: C-27927)",
  "SPSK Khalsa College Begowal (Kapurthala) (Id: C-27899)",
  "SRC SD Kanya Maha Vidyalaya Pathankot (Id: C-27942)",
  "SR Govt. College for Women Amritsar (Id: C-27954)",
  "Sri Guru Teg Bahadur College of Education, Khankot, Amritsar (Id: C-27989)",
  "SRPA Adrash Bhartiya College Pathankot (Id: C-27891)",
  "SS College of Education, Dinanagar. (Id: C-28006)",
  "S.S.M. College Dina Nagar (Id: C-27934)",
  "SSSS College of Commerce for Women, Mall Road Chowk, Majitha Road, Amritsar (Id: C-27990)",
  "St.Soldier College Basti Danashmandan, Jalandhar (Id: C-27890)",
  "St. Soldier College Hadiabad (Phagwara) (Id: C-27925)",
  "St. Soldier College of Education Behind REC (NIT) Jalandhar. (Id: C-27997)",
  "Tagore College of Education For Women, Gurdaspur (Id: C-28005)",
  "Trinity College, Church Nagar, G.G.S.Avenue,Chogitti Jalandhar (Id: C-27928)",
  "Tri Shatabdi GGS Khalsa College Ramsar Road, Amritsar (Id: C-27966)",
  "Vishwa Mitar Shekhri College of Education, Vill. Said Mubarak, Amritsar Road, Batala. (Id: C-27931)",
  "BHARAT COMPUTER & MANAGMENT TECHNOLOGY BHATINDA (Id: C-31403)",
  "NAVRANG INSTITUTE OF COMPUTER EDUCATION AMRITSAR (Id: C-31306)",
  "NEW INSTITUTE OF COMPUTER SANGRUR (Id: C-31516)",
  "Arjan Dass College, Dharamkot (Id: C-29413)",
  "Arya College (Id: C-29273)",
  "A.S.College for Women, Khanna (Id: C-29340)",
  "A.S.College Khanna (Id: C-29396)",
  "A.S.College of Education, Kalalmajra (Id: C-29423)",
  "Baba Ke College of Education, Daudhar (Id: C-29400)",
  "Baba Kundan Rural College Of Education, Kulliawal (Id: C-29339)",
  "Baba Kundan Singh College, Muhar (Id: C-29362)",
  "Baba Kundan Singh Memorial Law College, Dharmkot (Id: C-29408)",
  "Baba Lachman Dass Sidh College For Women, Millinawala (Id: C-29303)",
  "Baba Mangal Singh Institute Of Education, Bughipura (Id: C-29309)",
  "Baba Nihal Singh B.Ed College, Baba Nihal Singh Street (Id: C-29372)",
  "Baba Sheehan Singh Gill Govt. College, Sidhsar (Id: C-29407)",
  "Babe ke College of Education, Mudki (Id: C-29379)",
  "BAM Khalsa College,Garhshankar (Id: C-29448)",
  "B. C. M. College of Education, Sector-32 A Urban Estate (Id: C-29395)",
  "Bhag Singh Khalsa College for Women, Kala Tibba (Id: C-29435)",
  "Bhai Nagahia Singh Memorial Girls College (Id: C-29358)",
  "Bhutta College of Education, Bhutta (Id: C-29281)",
  "B.K.M.College of Education, Balachaur (Id: C-29274)",
  "Dashmesh Girls College, Badal (Id: C-29361)",
  "Dashmesh Girls College Chak Alla Baksh Mukerian (Id: C-31044)",
  "Dashmesh Khalsa College, Muktsar (Id: C-31029)",
  "Dasmesh Girls College of Education, Badal (Id: C-29387)",
  "D.A.V. College, Abohar (Id: C-29337)",
  "DAV College for Girls,Garhshankar (Id: C-29432)",
  "D.A.V.College for Women (Id: C-29373)",
  "DAV College, Hoshiarpur (Id: C-29259)",
  "DAV College, Malout (Id: C-29333)",
  "D.A.V.College of Education, Amritsar (Id: C-31043)",
  "D.A.V.College of Education College Road, Fazilka (Id: C-29354)",
  "D.A.V.College of Education, Hoshiarpur (Id: C-31041)",
  "D.D.Jain College of Education, Kidwai Nagar (Id: C-29315)",
  "DD Jain Memorial College for Women, Ludhiana (Id: C-31039)",
  "Dev Samaj College for Women, Firozpur (Id: C-31037)",
  "Dev Samaj College of Education For Women, Firozpur (Id: C-31049)",
  "DIPS College of Education Rarra Morr, Jalalpur (Id: C-29297)",
  "D.M.College, Moga (Id: C-31035)",
  "D.M. College of Education, Moga (Id: C-31033)",
  "Doraha College of Education, Doraha (Id: C-29355)",
  "GGDSD College, Hariana, (Id: C-29383)",
  "G. G. N. Khalsa College (Id: C-29434)",
  "GGS.DAV Centenary College, Jalalabad (W) (Id: C-29431)",
  "GGS Degree College, Giddarbaha (Id: C-29321)",
  "GHG Harparkash College Of Education for Women, Sidhwan Khurd (Id: C-29306)",
  "G.H.G.Khalsa College, Gurusar Sadhar (Id: C-29285)",
  "G.H.G. Khalsa College of Education Gurusar Sadhar (Id: C-29345)",
  "Giani Kartar Singh Memorial Govt. College,Tanda Urmar (Id: C-29320)",
  "G.M.T. College of Education, Jalandhar Bypass (Id: C-29449)",
  "Gobindgarh College of Education, Alour, Khanna (Id: C-29384)",
  "Gobindgarh Public College, Alour Khanna (Id: C-29305)",
  "Gopi Chand Arya Mahila College, Abohar (Id: C-29376)",
  "Govind National College, Narangwal (Id: C-29264)",
  "Govt Arts & Science College, Talwara (Id: C-29393)",
  "Govt College for Women (Id: C-29394)",
  "Govt College, Hoshiarpur (Id: C-29425)",
  "Govt College, Karamsar-Rara Sahib (Id: C-29364)",
  "Govt College, Muktsar (Id: C-31032)",
  "Govt College, Zira (Id: C-29262)",
  "Guru Gobind Singh College of Education, Dabwali Road (Id: C-29346)",
  "Guru Gobind Singh College of Education, Gidderbaha (Id: C-29272)",
  "Guru Gobind Singh Khalsa College for Women, Jhar Sahib (Id: C-29360)",
  "Guru Gobind Singh Khalsa for Women, Kamalpura (Id: C-29405)",
  "Guru Gobind Singh Khalsaof Education for Women (Id: C-29291)",
  "Guru Hargobind College of Education, Gondwal Raikot (Id: C-29280)",
  "Guru Hargobind Institute Of Law for Women, Sidhwan Khurd (Id: C-29299)",
  "Guru Nanak College, Ferozpur (Id: C-31053)",
  "Guru Nanak College for Girls, Muktsar (Id: C-31050)",
  "Guru Nanak College, Killianwali (Id: C-29414)",
  "Guru Nanak College Of Education, Dalewal (Id: C-29367)",
  "Guru Nanak College of Education, Gopalpur (Id: C-29428)",
  "Guru Nanak Girls College, Model Town, Ludhiana (Id: C-31048)",
  "Guru Nanak Govt College, Guru Teg Bahadurgarh (Id: C-29419)",
  "Guru Nanak Khalsa College, Abohar (Id: C-29349)",
  "Guru Nanak Khalsa College for Women, Model Town (Id: C-29415)",
  "Guru Nanak Khalsa College For Women, Shamchaurasi (Id: C-29439)",
  "Guru Nanak National College, Doraha (Id: C-29319)",
  "Guru Ram Dass B.Ed College, Jalalabad(W) (Id: C-29302)",
  "Guru Teg Bahadur Khalsa College for Women, Dasuya (Id: C-29268)",
  "Guru Teg Bahadur Khalsa College of Education, Dasuya (Id: C-29427)",
  "Guru Teg Bahadur National College, Dakha (Id: C-29350)",
  "H.K.L. College of Education, Guru Harsahai (Id: C-29332)",
  "Jagat Sewak Khalsa College For Women, Amargarh (Id: C-29260)",
  "J.C.D.A.V.College, Dasuya (Id: C-29403)",
  "J.D.College of Education, Muktsar (Id: C-31027)",
  "Joyti B.Ed College Abohar Road, Fazilka (Id: C-29385)",
  "Kalgidhar Institute of Higher Education, Muktsar (Id: C-31052)",
  "Kamla Lohtia S.D College, Subhash Nagar (Id: C-29330)",
  "Kenway College of Education, Azimgarh (Id: C-29352)",
  "Khalsa College for Women, Civil Lines (Id: C-29436)",
  "Khalsa College for Women,Sidhwan Khurd (Id: C-29351)",
  "Khalsa College,Gardhiwala (Id: C-29269)",
  "Khalsa College of Education, Muktsar (Id: C-31047)",
  "Lajpat Rai DAV College, Jagraon (Id: C-29327)",
  "Lala Hans Raj Memorial College of Education, Bhangeria (Id: C-29401)",
  "Lala Jagat Narayan Education College, Jalalabad(W) (Id: C-29347)",
  "Lala Lajpat Rai Govt. College, Dhudike (Id: C-29307)",
  "Lala Lajpat Rai Memorial College of Education, Dhudike (Id: C-29370)",
  "Maharaja Ranjit Singh College, Malout (Id: C-29402)",
  "Maharishi Dayanand CollegeOf Education, Azimgarh (Id: C-29325)",
  "Mai Bhago College for Women, Ramgarh (Id: C-29335)",
  "Malwa Central College of Education for Women, Ludhiana (Id: C-31054)",
  "Malwa College Bondli, Samrala (Id: C-29381)",
  "Mata Ganga Khalsa College for Girls, Kottan (Id: C-29357)",
  "Mata Gurdev Kaur Memorial Shahi Sports College of Physical Education (Id: C-29374)",
  "Mata Misri Devi D.A.V.College, Giddderbaha (Id: C-29386)",
  "M.B.B.G.Gokal Gaur Girls College, Rattewal (Id: C-29295)",
  "M. B. B. G. R. G. C. B.Ed Girls College, Mansowal (Id: C-29409)",
  "M.B.B.G.R.G.C.Girls College, Mansowal (Id: C-29380)",
  "M.L.B.G.Girls College Tapprian Khurd,Balachaur (Id: C-29336)",
  "Moga College of Education for Girls, Ghall Kalan (Id: C-29271)",
  "M.R.Govt College, Fazilka (Id: C-29318)",
  "MTSM College for Women, Ludhiana (Id: C-31045)",
  "Muktisar Institute of Higher Education (Id: C-29326)",
  "Nankana Sahib College of Education (Id: C-29438)",
  "National College for Girls, Chowarianwali (Id: C-29282)",
  "National College for Women, Machhiwara (Id: C-29406)",
  "Panjab University Regional Centre Hoshiarpur (Id: C-29382)",
  "Panjab University Regional Centre, Ludhiana (Id: C-31038)",
  "Panjab University Regional Centre Muktsar (Id: C-29368)",
  "Panjab University Rural Centre Kauni (Id: C-29266)",
  "Partap College of Education, Hambran Road (Id: C-29279)",
  "Public Khalsa College for Women, Khandhala Jattan (Id: C-29369)",
  "Ramgarhia Girls College, Miller Ganj (Id: C-29441)",
  "Rayat Bahra College of Education, Hoshiarpur (Id: C-31036)",
  "Rayat College of Education, Railmajra (Id: C-31031)",
  "Rayat College of Law, Railmajra (Id: C-29429)",
  "Rayat College of Physical Education, Railmajra (Id: C-29270)",
  "R.S.D.College, Ferozepur (Id: C-31042)",
  "Sadhbhavna College of Education For Women Raikot (Id: C-29421)",
  "Saini Bar College, Bulhowal (Id: C-29313)",
  "Saint Sahara College of Education (Id: C-29388)",
  "Sant Baba Bhag Singh Memorial College of Education for Girls, Sukhanand (Id: C-29287)",
  "Sant Baba Bhag Singh Memorial Girls College, Sukhanand (Id: C-29375)",
  "Sant Baba Hari Singh Memorial College of Education, Mahilpur (Id: C-29444)",
  "Sant Darabara Singh College for Women, Lopon (Id: C-29398)",
  "Sant Darbara Singh College of Education for Women Lopon (Id: C-29445)",
  "Sant Hari Singh Memorial College for Women (Id: C-29267)",
  "Sant Majha Singh Karamjot College for Women, Miani (Id: C-29437)",
  "Satyam College of Education, Ghall Kalan (Id: C-29323)",
  "S.C.D.Govt College, Ludhiana (Id: C-29293)",
  "S.D. College for Women, Moga (Id: C-31034)",
  "S.D.College, Hoshiarpur (Id: C-29424)",
  "SDP College for Women, Ludhiana (Id: C-31028)",
  "SGGS Khalsa College, Mahilpur (Id: C-29363)",
  "S.Govt College of Science Education & Research, Jagraon (Id: C-29447)",
  "Shaheed Udham Singh Govt College, Guru Harsahai (Id: C-29399)",
  "Sri Aurobindo College of Commerce & Management, Jhande (Id: C-29296)",
  "Sri Guru Gobind Singh College of Education, Beghpur Kamlooh (Id: C-29397)",
  "Sri Guru Har Rai Sahib College for Women, Chabbewal (Id: C-29288)",
  "Sri Ram College, Dalla (Id: C-29276)",
  "Sri Satya Sai Education College, Karaiwala (Id: C-29301)",
  "Sukhdeva Krishna Collegeof Education for Women (Id: C-29356)",
  "Surjeet Memorial College of Education, Malwal (Id: C-29275)",
  "Swami Ganga Giri Janta Girls College, Raikot (Id: C-29412)",
  "Swami Permanand Mahavidyalaya, Mukerian (Id: C-29258)",
  "Tagore College of Education, Fatehgarh (Id: C-29338)",
  "Tarawati Memorial Degree College, Bringali (Id: C-29261)",
  "The Prinicipal M.B.G.Govt College, Pojewal (Id: C-29263)",
  "University College, Balachaur, Nawanshehar (Id: C-29371)",
  "University College, Guru Har Sahai, Firozpur (Id: C-31040)",
  "University College, Nihal Singh Wala, Moga (Id: C-29417)",
  "University College, Sikhwala, Muktsar (Id: C-29265)",
  "V.V.R.I (Sadhu Ashram), Hoshiarpur (Id: C-31030)",
  "Aasra Institute of Advance Studies, Rajpura, Bhawanigarh, Sangrur (Id: C-22204)",
  "AKAL COLLEGE FOR WOMEN, KHAMANO (Id: C-47297)",
  "Akal College of Education for Women, Village Fatehgarh Chhanna, Distt. Sangrur (Id: C-22195)",
  "Akal College of Education, Mastuana Sahib, Sangrur (Id: C-22280)",
  "Akal College of Physical Education, Mastuana, Sangrur (Id: C-22171)",
  "Akal Degree College for Women, Sangrur (Id: C-22152)",
  "Akal Degree College, Mastuana, Sangrur (Id: C-22110)",
  "Akal Sahae College of Education Kotkapura, Faridkot (Id: C-22219)",
  "Aklia College of Education, Village Akliakalan, P.O. Goniana Mandi, Distt Bathinda (Id: C-22210)",
  "Aklia Degree College, Jaitu Road, Goniana Mandi, Bathinda (Id: C-22094)",
  "Amar Shahid Baba Ajit Singh Jujhar Singh Memorial College, Bela , Ropar (Id: C-22192)",
  "Ambika College of Education, Opp. Village Badali, Badala road, Kharar, Ropar (Id: C-22141)",
  "Army Institute of Law, Sector-68, Mohali. (Id: C-22215)",
  "Arya Bhatta College, Barnala (Id: C-22279)",
  "Aryans College of EducationVillage Nepra, Chandigarh-Patiala Highway, Near Banur, Teh. Rajpura (Id: C-22275)",
  "Asian Educational Institute, Sirhind Road, Patiala (Id: C-22069)",
  "Asra College of Education, Village Rajpura, Near Channo, Tehsil Bhawanigarh, (Id: C-22203)",
  "Attri College of Education for Girls, Lalru Mandi, Near Shiv Mandir Road, Derabassi (Id: C-22100)",
  "Baba Farid College, Deon (Id: C-22250)",
  "Baba Farid College of Education, V&P.O. Deon, Muktsar Road, Bathinda (Id: C-22137)",
  "Baba Farid College of Management & Technology, Mukatsar Road, Deon, Bathinda (Id: C-22185)",
  "Baba Farid Law College, Faridkot (Id: C-22087)",
  "Baba Moni Ji Maharaj Degree College, Lehra Mohabbat (Id: C-22155)",
  "Baba Moni Ji Maharaj Education College, Lehra Mohabbat, Bathinda (Id: C-22099)",
  "BABA PARMANAD KANYA MAHAVIDYALAYA, JAKHEPAL SUNAM (Id: C-47299)",
  "Baba Shri Chand Ji Govt. College, Sardargarh (Id: C-22077)",
  "Baba Zoravar Singh Fateh Singh Khalsa Girls College, Morinda, Ropar (Id: C-22240)",
  "Bathinda College of Information & Technology, Bathinda (Id: C-22149)",
  "Bathinda College of Law, Bathinda (Id: C-22262)",
  "Bhagwati College of Education for girls, Bhikhi, Mansa (Id: C-22086)",
  "Bhai Assa Singh Girls College, Goniana Mandi (Id: C-22167)",
  "BHAI BEHLO KHALSA GIRLS COLLEGE PHAFRE BAHI KE (Id: C-47286)",
  "Bhai Bhagtu girls college, Ramgarh, Bhagtuana, Faridkot (Id: C-22072)",
  "Bhai Gurdas College of Law, Sangrur (Id: C-22229)",
  "Bibi Bhani Panchayati Girls College, Khan-Manpur , Fatehgarh Sahib (Id: C-22134)",
  "Brakkat Girls College of Education, Tallewal, Sangrur (Id: C-22267)",
  "CGC, Ghauran (Department of Biofarma Sciences) V.P.O Ghauran, Tehsil Kharar, Mohali (Id: C-22158)",
  "CGC Group of Colleges, Faculty of Management, V.P.O Ghauran, Tehsil Kharar, Mohali (Id: C-22130)",
  "Chandigarh College of Education, Ladran, Mohali (Id: C-22283)",
  "Chandiragh Business School, V.P.O Ghauran, Tehsil Kharar, Mohali (Id: C-22085)",
  "College of Management and Technology, Shanti Nagar, Back side Urban Estate Phase -II, Patiala (Id: C-22194)",
  "Colonel College of Education, Chural Kalan, Distt. Sangrur (Id: C-22252)",
  "Colonel Degree College for Women, Chural Kalan, (Id: C-22075)",
  "Continental College of Higher Studies, Jalvehra (Fatehgarh Sabib) (Id: C-22268)",
  "Cordia College, Sangol, Fatehgarh Sahib (Id: C-22163)",
  "Cordia Institute of Business Management, Sanghol, Fatehgarh Sahib. (Id: C-22284)",
  "CORIDA HOSPITALITY AND TOURISM MANAGEMENT INSTITUTE SANGHOL (Id: C-47339)",
  "D.A.V. College, Bathinda (Id: C-22148)",
  "Desh Bhagat College, Bardwal Dhuri (Id: C-22187)",
  "Desh Bhagat College of Education, Bardwal Dhuri, (Id: C-22066)",
  "Desh Bhagat College of Education, Mandi Gobindgarh, Fatehgarh Sahib (Id: C-22147)",
  "Desh Bhagat Institute of Management & Computer Sciences, Mandi Gobindgarh, Fatehgarh Sahib (Id: C-22249)",
  "Divya Shikhsha Gurukul College of Education, Village Ghollu Majra, Derabassi-Lalru Highway, Distt. Mohali (Id: C-22183)",
  "Doaba College of Education, Ghatour (Id: C-22103)",
  "Dolhpin (PG) College of Life Sciences, Chuni, Fatehgarh Sahib (Id: C-22189)",
  "FETEH COLLEGE FOR WOMEN RAMPURA PHUL (Id: C-47296)",
  "GANDHI MEMORIAL COLLEGE FOR WOMEN KOTHE KOTAPURA (Id: C-47289)",
  "General Shivdev Singh Diwan Gurbachan Singh Khalsa College, Patiala (Id: C-22129)",
  "G.G.S. College of Education, Talwandi Sabo, Bathinda (Id: C-22112)",
  "GIAN JYOTI GIRLS COLLEGE GURTHARI ROAD SANGAT KALAN (Id: C-47287)",
  "GLOBAL COLLEGE OF HIGHER EDUCATION NAGAL KHURD (Id: C-47298)",
  "Government Bikram College of Commerce, Patiala (Id: C-22139)",
  "Government College for Girls, Patiala (Id: C-22264)",
  "Government College, Mohali (Id: C-22159)",
  "Government College, Rupnagar (Id: C-22113)",
  "Government Mohindra College, Patiala (Id: C-22146)",
  "Government Shivalik College, Naya Nangal (Id: C-22095)",
  "Govt. Barjindra College, Faridkot (Id: C-22076)",
  "Govt. College, Dera Bassi (Id: C-22140)",
  "Govt. College Gurne Khurd Sangrur (Id: C-22258)",
  "Govt. College, Malerkotla, Sangrur (Id: C-22191)",
  "Govt. College, Munak (Id: C-22259)",
  "Govt. College of Education, Malerkotla Sangrur (Id: C-22088)",
  "Govt. Kirti College, Nial Patran (Id: C-22216)",
  "Govt. Rajindra College, Bathinda (Id: C-22227)",
  "Govt. Ranbir College, Sangrur (Id: C-22079)",
  "Govt. Ripudaman College, Nabha (Id: C-22241)",
  "Gurmat College, Patiala (Id: C-22193)",
  "Guru Gobind Singh College of Education (Id: C-22150)",
  "Guru Gobind Singh College, Sanghera (Id: C-22174)",
  "GURU GOBIND SINGH COLLEGE TALWANDI SABO (Id: C-47335)",
  "Guru Hargobind Sahib Khalsa Girls College, Karhali Sahib, Patiala (Id: C-22166)",
  "Guru Hargobind Singh Khalsa College for Women, Hansali Khera Fatehgarh Sahib (Id: C-22260)",
  "Guru Harkrishan Girls College, Phalewal, Ludhiana, Sangrur-Road., Sangrur (Id: C-22261)",
  "Guru Kashi College of Sikh Studies, Damdama Sahib, Talwandi Sabo, Bathinda (Id: C-22091)",
  "Gurukul College, Dera Tupp, Bathinda (Id: C-22114)",
  "Gurukul College For Women, Kothe, Kotkapura (Id: C-22278)",
  "Guru Nanak College, Budhladha, Mansa (Id: C-22274)",
  "Guru Nanak College of Education, Bhikhi, Mansa (Id: C-22182)",
  "Guru Nanak College of Education, for girls, Lehal Khurad, Sangrur (Id: C-22097)",
  "Guru Nanak Dev College of Education, Majatri, Kharar, (Id: C-22125)",
  "Guru Nanak Dev Khalsa Girls College, Bathinda (Id: C-22133)",
  "Guru Teg Bahadur College for Women Village Lehal Khurd, Lehragagga, Sangrur (Id: C-22232)",
  "Guru Teg Bahadur College of Education, Dalelwala, Teh. Budhladha, Mansa (Id: C-22188)",
  "Guru Teg Bahadur College of Education, Village Lehal Khurd, Lehragagga (Id: C-22164)",
  "Guru Tegh Bahadur College, Bhawanigarh, Sangrur (Id: C-22104)",
  "Hans Raj Memorial College of Education, Baja Khana, Kotkapura (Id: C-22127)",
  "Hardik College of Education, Bhawanigarh (Id: C-22220)",
  "HARF COLLEGE MALERKOTLA (Id: C-47300)",
  "Indo Global College of Education, Abhipur, Distt. Mohali (Id: C-22060)",
  "INSTITUTE OF HOSPITALITY AND MANAGEMENT BANUR (Id: C-47292)",
  "International Divine College of Education, Ratwara Sahib Complex, P.O. Mullanpur Garibdass, Tehsil Kharar, (Id: C-22117)",
  "Islamia Girls College, Malerkotla (Id: C-22144)",
  "Jasdev Singh Sandhu College of Education, Rajpura Road, Kauli, Patiala (Id: C-22197)",
  "Jasmer Singh Jeji Degree College, Gurne Kalan, Munak, Sangrur (Id: C-22082)",
  "Jawahar Lal Nehru Government College , Tooran, Mandi Gobindgarh, Fatehgarh Sahib (Id: C-22124)",
  "Kabli Mal Ramji Dass Jain College for Women, Malerkotla (Id: C-22281)",
  "Kay Jay College of Education, Village Rasulpur, P.O. Chapper Seal Road, Patiala. (Id: C-22287)",
  "KHALA COLLEGE(AMRITSAR) OF TECHONOLOGY AND BUSINESS STUDIES MOHALI (Id: C-47294)",
  "KING DEGREE COLLEGE BARNALA (Id: C-47340)",
  "Lal Bahadur Memorial Mahila College, Nabha (Id: C-22111)",
  "L.B.S. Arya Mahila College (Id: C-22061)",
  "Lincoln College of Education, Sirhind, Distt. Fatehgarh Sahib (Id: C-22078)",
  "Lincoln College of Law, Sirhind, Fatehgarh Sahib (Id: C-22247)",
  "Lord Krishna College of Education for Women, Village Sundra, Derabassi (Id: C-22256)",
  "Lord Mahavir College of Education, Hamirgarh (Id: C-22107)",
  "Maghi Memorial College for Women, Amloh, Fatehgarh Sahib (Id: C-22067)",
  "Maharaja Aggarsain College of Education, Jai Singh Wala, Bathinda (Id: C-22108)",
  "Maharaja Aggarsain College of Information Technology, Jai Singh Wala, Bathinda (Id: C-22199)",
  "Maharaj Braham Sagar Brahmanand Bhuriwale College, Tibba Nangal (Id: C-22270)",
  "Mai Bhago College of Education (for girls ) Ralla , Mansa (Id: C-22221)",
  "Mai Bhagoo Degree College (for girls) Ralla, Mansa (Id: C-22236)",
  "Malwa College, Bathinda (Id: C-22102)",
  "Malwa College of Education, Deon, Bathinda (Id: C-22282)",
  "Malwa College of Education, Sardulewala, Mansa (Id: C-22242)",
  "Malwa College of Physical Education, Goniana Road, Bathinda (Id: C-22231)",
  "Malwa College of Trainings and Education, Malakpur Khiala, Mansa (Id: C-22081)",
  "MALWA DEGREE COLLEGE FOR GIRLS KOTAK PURA (Id: C-47336)",
  "M and M College of Education, Village Nagri, (Id: C-22263)",
  "M and M Institue of Management & Technology, Village Nagri, (Sangrur) (Id: C-22207)",
  "Mastermind College of Education, Bathinda (Id: C-22248)",
  "Mata Gujri College, Fatehgarh Sahib (Id: C-22184)",
  "Mata Gurdev Kaur Memorial Education Institute (for girls), Bareta, Mansa (Id: C-22269)",
  "Mata Maisar Khana College of Education for girls, Maisar Khana, Bathinda (Id: C-22083)",
  "Mata Sahib Kaur Girls College, Damdama Sahib, Bathinda (Id: C-22272)",
  "Mata Sahib Kaur Girls College, Village Gaihal, Barnala (Id: C-22230)",
  "Mata Sahib Kaur Khalsa College of Education, Dhamo Majra, Patiala (Id: C-22138)",
  "Mata Sita Ji Degree College (For Girls), Bathinda (Id: C-22062)",
  "Mata Sundri Girls College, Dhade, Bathinda (Id: C-22168)",
  "Meera College of Education, Mansa Road Sardulewala, Mansa (Id: C-22276)",
  "Mehar Chand College of Education, Bhanopli (Id: C-22226)",
  "Milkha Singh Educational Institute, Bareta, Mansa (Id: C-22106)",
  "Miri Piri Khalsa College, Bhadour, Barnala (Id: C-22169)",
  "Modern College of Education, Birkalan, Distt. Sangrur (Id: C-22151)",
  "Modern College of Education (for girls) Bhikhi, Mansa (Id: C-22186)",
  "Modern College of Education, for Girls, Shergarh Cheema Sangrur (Id: C-22214)",
  "Modern College of Education, Ranwan, P.O. Khanpur, Malerkotla , Sangrur (Id: C-22157)",
  "Multani Mal Modi College, Patiala (Id: C-22120)",
  "Nancy College of Education, Samana, Patiala (Id: C-22201)",
  "National College, Bhikhi, Mansa (Id: C-22175)",
  "National College of Physical Education, Village Chupki, Patiala (Id: C-22121)",
  "NAVJIVINI INSTITUTE OF SPECIAL EUCATION AND RESEARCH SULAR (Id: C-47293)",
  "Nawab Sher Mohammad Khan Institute Of Advanced Studies in urdu, Persian & Arabic, Malerkotla (Id: C-22238)",
  "Nehru Memorial Govt. College, Mansa (Id: C-22074)",
  "N.I.S., Patiala (Id: C-22239)",
  "Pandit Chetan Dev Govt. College of Education, Faridkot (Id: C-22073)",
  "Patel Memorial National College, Rajpura, Patiala (Id: C-22153)",
  "Patiala College for Women, Village Hardaspur, Opp. PDA-Omex City, Sirhind Road, Patiala (Id: C-22118)",
  "Patiala College of Education for girls, Village Hardaspur, Patiala (Id: C-22289)",
  "Pine Grove College of Education, Bassi Pathana, Distt. Fatehgarh Sahib (Id: C-22218)",
  "Prof. Gursewak Singh Government College of Physical Education, Patiala (Id: C-22257)",
  "Public College of Education, Samana, Patiala (Id: C-22065)",
  "Public College, Samana, Patiala (Id: C-22179)",
  "Punjab College of Education, Raipur, Bahadurgarh, Distt. Patiala (Id: C-22156)",
  "Punjab College of Education, Sarkapra, Fatehgarh Sahib (Id: C-22200)",
  "Punjab Institute of Oriental & Indian Languages, Patiala (Id: C-22123)",
  "Punjabi University Akali Phulla Singh Neighbourhood Campus, Delha seian (Id: C-22101)",
  "Punjabi University Baba Dhyan Dass Neighbourhood Campus, Jhunir (Id: C-22136)",
  "PUNJABI UNIVERSITY COLLEGE, MEERAPUR (Id: C-48370)",
  "Punjabi University Guru Kashi Neighbourhood Campus (Id: C-22228)",
  "Punjabi University Neighborhood Campus (Id: C-22265)",
  "Punjabi University Neighbourhood Campus, Jaito (Id: C-22222)",
  "Punjabi University Neighbourhood Campus, Karandi (Id: C-22176)",
  "Punjabi University Neighbourhood Campus, Maur Mandi (Id: C-22202)",
  "Punjabi University Neighbourhood Campus, Ralla, Mansa (Id: C-22132)",
  "Punjabi University Neighbourhood Campus, sardulgarh (Id: C-22089)",
  "Punjabi University Regional Centre (Id: C-22064)",
  "Punjabi University Regional Centre for Information Technology & Managment (Id: C-22126)",
  "Rattan College of Education , V&PO Sohana, Mohali (Id: C-22209)",
  "Rattan Professional Education College, V&PO Sohana, Mohali (Id: C-22178)",
  "Rayat and Bahra MMTI College of Education, Village Sahoran Teh : Kharar (Id: C-22213)",
  "Rayat and Bahra MMTI College of Law, Village Sahoran Teh : Kharar (Id: C-22170)",
  "RIMT College of Education, Sirhind Side, Mandi Gobindgarh Fatehgarh Sahib (Id: C-22288)",
  "Ropar Institute of Management & Technology, Village Shekhpura, Ropar-Bela Road, Ropar (Id: C-22070)",
  "R P C DEGREE COLLEGE (Id: C-47288)",
  "Sachdeva College of Education, Gharuan, Tehsil Kharar (Id: C-22109)",
  "Sacred Heart International College of Education, Barnala (Id: C-22162)",
  "SAFFRON COLLEGE GIRLS KOTLA BAJWARA (Id: C-47291)",
  "SAHEED BHAGAT SINGH KHALS COLLEGE FOR WOMEN, PADIALA MOHALI (Id: C-47285)",
  "Saint Kabir College of Education, Kauli, Patiala (Id: C-22093)",
  "S. Amarjit Singh Memorial Institute of Law, Dhainthal (Samana), District Patiala (Id: C-22243)",
  "Sant Baba Attar Singh Khalsa College, Sandour, Sangrur (Id: C-22198)",
  "Sant Baba Sewa Singh Memorial Khalsa College (Girls), Guru Ka Khuh, Mune, Nurpur Bedi, Ropar (Id: C-22246)",
  "Sant Kabir College of Management Arts & Computer Science for Girls, Bhucho Kurad, Bathinda (Id: C-22084)",
  "Sant Namdev Kanya Mahavidiyala, Bassi Pathana, Distt Fetehgarh Sahib (Id: C-22142)",
  "Sant Ram S.D. College, Barnala (Id: C-22068)",
  "Sarasswati College of Management & Computer Science, Gharuan, Kharar (Id: C-22131)",
  "Sardar Rajinder Singh Memorial Mukat College of Eduacation for Women, Rajpura (Id: C-22128)",
  "S. Balraj Singh Bhundarh Memorial university College Sadulgarh (Id: C-22286)",
  "SBRS College for Women, Sadik, Faridkot (Id: C-22211)",
  "S.D. College, Barnala (Id: C-22224)",
  "S.D.College of Education, Barnala (Id: C-22143)",
  "S.D. Kanya Mahavidyala, Mansa (Id: C-22223)",
  "Shaheed Udham Singh College of Education, VPO Mehlan Chowk, Sunam, Sangrur (Id: C-22098)",
  "Shaheed Udham Singh College of Management & Computer Science VPO Mehlan ,Tehsil Sunam, Sangrur (Id: C-22165)",
  "SHAHEED UDHAM SINGH INSTITUTE OF COMPUTER TANGORI MOHALI (Id: C-47295)",
  "Shahid Bhagat Singh Government College, Kotkapura (Id: C-22092)",
  "Shahid Bhagat Singh Khalsa College for Women, Padiala., Ropar (Id: C-22273)",
  "Shahid Kashi Ram College of Physical Education, Bhagoo Majra Kharar (Id: C-22271)",
  "Shahid Kashi Ram Memorial College, Bhagoo Majra (Kharar) (Id: C-22135)",
  "Shahid Udham Singh College of Research & Technology, Tangori, Mohali (Id: C-22266)",
  "Shanti Tara College, Akbarpur Mandi Ahmedgarh, Sangrur (Id: C-22190)",
  "Sh. Balraj Singh Bhundarh Memorial Govt. college, Sardoolgarh., Mansa (Id: C-22063)",
  "Shiva College of Education, Dirba, Sangrur (Id: C-22080)",
  "Shivalik Hills College of Education, Patti, P.O. Manakpur, Anandpur Sahib (Id: C-22255)",
  "Shivalik Institute of Education & Research, Mohali (Id: C-22173)",
  "Shivam College of Education, Khokarkalan, Lehragagga (Id: C-22251)",
  "Shri Guru Teg Bahadur College of Education, Village-Sehke, Malerkotla (Id: C-22096)",
  "Shri. Guru Tegh Bahadur Khalsa College, Anandpur Sahib (Id: C-22277)",
  "Smt. Jawala Devi College of Education, Sanghol, (Id: C-22208)",
  "Sri Guru Harkrishan College of Management and Technology, Raipur, Bahadurgarh (Id: C-22235)",
  "S.S. College for Girls, Bhikhi, Mansa (Id: C-22116)",
  "S.S. College of Education for Girls, Bhikhi, Mansa (Id: C-22206)",
  "SSD Girls College, Bathinda (Id: C-22212)",
  "SSD Girls College of Education, Bhokra,Bathinda (Id: C-22071)",
  "SSD Women's Institute of Technology, Bathinda (Id: C-22180)",
  "S.S. Jain College of Ecucation (for girls) Mansa (Id: C-22234)",
  "State College of Education, Patiala (Id: C-22145)",
  "SURYA WORLD INSTITUTE OF BUSINESS MANAGMENT, SHAMBU PATIALA (Id: C-48369)",
  "S.U.S. Govt. College, Sunam (Id: C-22254)",
  "Swami Dayanand College of Education, Lehra Bega, Bathinda (Id: C-22217)",
  "SWAMI VIVEKANAD FACULITY OF INFORMATION TECHONOLOGY AND BUSINESS MANAGEMENT VILL RAM NAGAR JHANSLA BANUR (Id: C-47337)",
  "Swami Vivekanand College of Education, Moonak, Tohana Road Moonak (Id: C-22172)",
  "Swami Vivekanand College of Education, Village Ram Nagar, Near Banur, Tehsil Rajpura, Distt. Patiala (Id: C-22253)",
  "Swift Technical Campus, Ghaggar Sarai RAJPURA (Id: C-47338)",
  "Tapacharya Hem Kunwar Rasik Lal Dhariwal Jain Girls College, Raman, Bathinda (Id: C-22237)",
  "Tara Vivek College, Gajjan Majra, Malerkotla (Id: C-22115)",
  "The Corporate Gurus of Business School, Tapla Road, Basma, Banur, Patiala (Id: C-22233)",
  "Umang Red Cross Institute of Special Education, Faridkot (Id: C-22225)",
  "University College, Chunni Kalan (Id: C-22245)",
  "University College, Dhilwan (Id: C-22090)",
  "University College, Ghanaur (Id: C-22244)",
  "University College, Ghudda (Id: C-22154)",
  "University College, Jaitu (Id: C-22181)",
  "University College, Moonak (Id: C-22177)",
  "VIDYA SAGAR COLLEGE FOR GIRLS DAULATPU DHURI (Id: C-47341)",
  "Vidya Sagar College of Education (for girls) Dhuri (Id: C-22205)",
  "Vidya Sagar College of Management and Technology, Fatehpur, Patiala (Id: C-22105)",
  "Vidya Sagar College, Sardoolgarh , Mansa (Id: C-22122)",
  "ABBNOOR INSTITUTE OF INFORMATION TECHNOLOGY, FARIDKOT (Id: C-49524)",
  "Adesh Institute of Engineering & Technology, Faridkot (Id: C-10478)",
  "Akal College of Pharmacy and Technical Education, Mastuana (Id: C-10483)",
  "Alkila Education and Research Society Group of Institutions, Aklian (Id: C-10397)",
  "Aman Bhalla Institute of Engg. & Tech, Jhakolari, Pathankot (Id: C-10371)",
  "Amar Shaheed Baba Ajit Singh Jujhar Singh Memorial College of (Id: C-10250)",
  "A&M Institute of Computer & Technology , Pathankot (Id: C-10261)",
  "A & M Institute of Management & Technology, Pathankot (Id: C-10257)",
  "Amritsar College of Engg. & Tech, Amritsar (Id: C-10440)",
  "Anand College of Engg. and Management, Sultnpur (Id: C-10288)",
  "Apeejay Institute of Management, Jalandhar (Id: C-10383)",
  "Arya Bhatta College of Engg. & Tech., Vill Jodhpur Cheema (Id: C-10489)",
  "Arya Bhatta College of Management & Tech., Vill. Cheema (Id: C-10436)",
  "Aryans Buisness School, Vill Nepra (Id: C-10361)",
  "Aryans College of Engineering, Patiala (Id: C-27842)",
  "Aryans Institute of Mangement & Technology (Id: C-10270)",
  "Aryans School of Management, Vill Nepra (Id: C-10368)",
  "A.S. Group of Institutions, Khanna (Id: C-27620)",
  "Asra College of Engg. & Tech, Near Channo, Teh. Bhawani Garh (Id: C-10343)",
  "Baba Banda Singh Engg. College, Fatehgarh Sahib (Id: C-10277)",
  "Baba Banda Singh Engg. & Tech., vill. Deon, Muktsar Road (Id: C-10332)",
  "Baba Farid College of Engineering& Technology, Bathinda (Id: C-27841)",
  "Baba Hira Singh Bhattal Institute of Engg. & Technology, Sunam (Id: C-10284)",
  "Baba Ishar Singh College of Pharmacy, Kot-ise-khan (Id: C-10400)",
  "Baba Isher Singh Institute of Technology VPO-Gagra (Id: C-10282)",
  "Baba Khajandas College of Management and Technology, Ludhiana (Id: C-10410)",
  "Baba Kuma Singh Ji Engg. College, Hushair Nagar, Amritsar (Id: C-10333)",
  "Baba Mangal Singh Institute of Management & Technology, Moga (Id: C-10313)",
  "Baba Sri Chand College of Management , Nurpura (Id: C-30788)",
  "BAHRA INSTITUTE OF PHARMACY (Id: C-49901)",
  "Beant College of Engg. & Tech., Gurdaspur (Id: C-10320)",
  "Bhai Gurdas Business School, Vill Rakhra (Id: C-10266)",
  "Bhai Gurdas Institute of Engineering and Technology (Id: C-29458)",
  "Bhai Gurdas Institute of Management & Technology (Id: C-10370)",
  "Bhai Maha Singh College of Engg. (Id: C-10294)",
  "Bhai Maha Singh College of Information Technology and life Science (Id: C-10479)",
  "Bharat Group of Colleges (Id: C-10389)",
  "Bharat Institute of Management Studies , Vill Khara Khurd (Id: C-10499)",
  "Bhutta College of Engg. and Technology, Bhutta (Id: C-10476)",
  "BIS Baba Isher Singh College of Engg & Technology, Gagra (Id: C-10338)",
  "BNM College of Technical Education, Alamgir (Id: C-10443)",
  "Cambridge Engineering College (Id: C-10354)",
  "Career Institute of Management & Technology for Women (Id: C-10253)",
  "CAREER POINT TECHNICAL CAMPUS, TANGORI (Id: C-49676)",
  "Center for Management Studies (Id: C-10291)",
  "Centre for Development of Advanced Computing (C-DAC), Mohali (Id: C-27840)",
  "Centre for Mangement training and research (Id: C-10446)",
  "CGC College of Engineering, Landran (Id: C-29461)",
  "CGC-Group of Colleges, Gharuan (Id: C-10369)",
  "CGC School of Animation Multimedia and Technology (Id: C-29474)",
  "CGC TECHNICAL CAMPUS, FACULTY OF ENGINEERNIG (Id: C-49525)",
  "CGC TECHNICAL CAMPUS, FACULTY OF MANAGEMENT (Id: C-49526)",
  "Chanakya Institute of Management & Information Technology (Id: C-10433)",
  "Chandigarh Business school, Gharuan (Id: C-10248)",
  "Chandigarh Business school , Landran (Id: C-10420)",
  "Chandigarh Business school of Administration, Landran (Id: C-10245)",
  "Chandigarh College of Hospitality, Landran (Id: C-10249)",
  "Chandigarh College of Hotel Management and Catering Technology (Id: C-10391)",
  "Chandigarh College of Pharmacy, Landran (Id: C-10283)",
  "Chandigarh College of Technology, Landran (Id: C-10323)",
  "Chandigarh Engg College (Department of Computer Applications) (Id: C-10349)",
  "Chandigarh Engg College, Landran (Id: C-10342)",
  "Chitkara Institute of Engg. & Tech. Jansla (Id: C-10464)",
  "Chitkara School of Hospitality, Technology and Management (Id: C-10461)",
  "Chitkara School of Planning and Architecture, Jhansla (Id: C-10376)",
  "CIIST-IST Mohali (Id: C-10404)",
  "College of Architecture, Jhansla (Id: C-10427)",
  "College of Engg. and Management, Kapurthala (Id: C-10497)",
  "Continental Institute of Engg. & Technology, Vill Jalvehra (Id: C-10502)",
  "CT Institute of Advance Management Studies, Jalandhar (Id: C-10515)",
  "CT Institute of Engg. Management and Technology, Shahpur (Id: C-10378)",
  "CT Institute of Hotel Management and Catering Technology (Id: C-10452)",
  "CT Institute of Management and IT , Jalandhar (Id: C-10429)",
  "CT Institute of Management Studies , Shahpur (Id: C-10458)",
  "CT Institute of Management & Technology, Shahpur (Id: C-10416)",
  "CT Institute of Pharmaceutical Sciences, Shahpur (Id: C-10300)",
  "CT Institute of Technology, Shahpur (Id: C-10394)",
  "Dashmesh Institute of Management and Technology, Barnala (Id: C-10339)",
  "DAV Institute of Engineering and Technology, Jalandhar (Id: C-10384)",
  "Desh Bhagat Engg College, Amloh Road, Mandi Gobindgarh (Id: C-10267)",
  "Desh Bhagat Foundation gruoup of Institutions, Moga (Id: C-10367)",
  "Desh Bhagat Institute of Hotel Management (Id: C-10309)",
  "Desh Bhagat Institute of Professional Studies, Mandi Gobindgarh (Id: C-31026)",
  "DIMT, Bulandpur, Jalandhar (Id: C-10493)",
  "DIPS Institute of Management & Technology, Jalandhar (Id: C-10247)",
  "Doaba College of Pharmacy, Ghatuar (Id: C-29460)",
  "Doaba Institute of Engineering & Technology, Ghatuar (Id: C-29459)",
  "Doaba Khalsa trust group of Institutions, Chhokran (Id: C-10290)",
  "Doaba Women Institute of Engg. & Technology (Id: C-10424)",
  "Doraha Institute of management and Technology, Doraha (Id: C-10352)",
  "Dr. I. T Business school , Jalalapur (Id: C-10334)",
  "Dr. I. T Business school (women), Vill Jalalapur (Id: C-10260)",
  "Dr. I. T Institute of Management and Technology , Jalalapur (Id: C-10340)",
  "Ferozpur College of Engg. & Technology (Id: C-32590)",
  "Ferozpur institute of mangagement (Id: C-32589)",
  "GCS Institute of Vocational Studies, Bhaddal (Id: C-30787)",
  "GGS College of Modern Technology, Kharar (Id: C-10350)",
  "G.H.G. Khalsa College of Pharmacy, Gurusar Sadhar, Ludhiana (Id: C-10501)",
  "Ghubaya College of Engg. and Technology (Id: C-10255)",
  "Giani Zail Singh College of Engg. & Technology, Bhatinda (Id: C-27619)",
  "Gian Jyoti Institute of Engg. & Technolog, Shambhu Kalan Patiala (Id: C-10305)",
  "Gian Jyoti Institute of Management and Technology (Id: C-10408)",
  "Gian Jyoti School of Management, Shambhu Kalan Patiala (Id: C-10509)",
  "Global College of Engg and Tech. , Anandpur Sahib (Id: C-10506)",
  "Global College of Pharmacy, Anandpur Sahib (Id: C-10488)",
  "Global Institute of Management and emerging technologies (Id: C-10462)",
  "Global Institute of Management, Sohian Khurd (Id: C-10324)",
  "GNA Institute of Management and Technology (Id: C-10419)",
  "Government Institute of Pharmaceutical Sciences and Engg (Id: C-10292)",
  "Govt. Polytechnic College of Girls, Patila (Id: C-10312)",
  "Gujranwala guru Nanak Institute of Management & Technology (Id: C-10385)",
  "Gulzar Institute of Engg. & Technology, Khanna (Id: C-10318)",
  "Gulzar School of Management, Vill Libra (Id: C-10437)",
  "Gurdasidevi Institute of Management & Technology, Budhlada (Id: C-10345)",
  "Gursewa Institute of Science & Technology, Garhshankar (Id: C-31022)",
  "Guru Arjan Dev College of Management and Technology (Id: C-10450)",
  "Guru Gobind Singh College of Engg. And Technology Talwandi sabo (Id: C-10453)",
  "Guru Gobind Singh College of Management and Technology (Id: C-10262)",
  "Guru Gobind Singh Information Technology and research (Id: C-10251)",
  "Gurukul Institute of Management and Technology, Ramnagar (Id: C-10413)",
  "Gurukul Vidyapeeth Institute of Engg. & Technology, Ramnagar (Id: C-31025)",
  "Gurukul Vidyappeeth Group of Institutes , Banur (Id: C-10254)",
  "Guru nanak College of Management and Technology (Id: C-10319)",
  "Guru Nanak Dev Engineering College, Ludhiana (Id: C-10381)",
  "Guru nanak Institute of Engg. & Management (Id: C-10372)",
  "Guru Nanak Institute of Management and Technology, Ludhina (Id: C-10492)",
  "Guru Ram Dass Institute of Engg. and Technology (Id: C-10407)",
  "Guru Sewa Institute of Science & Tech. Garhshankar (Id: C-10487)",
  "Guru Teg Bahadur Institute of Management & Technology , Dakah (Id: C-10448)",
  "Guru Teg Bahadur Khalsa College of Engg. & Technology (Id: C-10351)",
  "Hoshiarpur Institute of management and Technology, Vill Bhagpur (Id: C-10285)",
  "ICAII college of Management and Technology (Id: C-10307)",
  "Ideal Institute of Management and Technology, Moga (Id: C-10264)",
  "IITT College of Engg. Pojewal (Id: C-10511)",
  "Indo Global College of Architecture, Abhipur (Id: C-27844)",
  "Indo Global College of Engg. Abhipur (Id: C-10460)",
  "Innocent Hearts Group of Institutions (Id: C-10355)",
  "Institute for Management Studies, IET Bhaddal (Id: C-10480)",
  "Institute of Engg. & Tech, Bhaddal (Id: C-10328)",
  "Institute of Tourism and Future Trends (Id: C-10298)",
  "ISF college of Pharmacy, Moga (Id: C-10398)",
  "Jamna Devi Institute of Management and Technology (Id: C-10271)",
  "Jasdev Singh Sandhu Institute of Engg. & Tech, Patiala (Id: C-10304)",
  "Jyoti College of Computer Science and Technology (Id: C-10402)",
  "Kay Jay School of Management and Technology (Id: C-10276)",
  "K.C College of Engg. and Information Technology (Id: C-10357)",
  "K.C Institute of Hotel Management, Nawansheher (Id: C-10456)",
  "KCL Institute of Management and Technology (Id: C-10473)",
  "KC School of Management and Computer Application (Id: C-10442)",
  "Khalsa College of Engg. and Technology (Id: C-10423)",
  "Khalsa College of Pharmacy, Amritsar (Id: C-10445)",
  "Khalsa College of Technical and Business Studies , Amritsar (Id: C-10344)",
  "Khalsa Institute of Management and Technology for Women (Id: C-10477)",
  "KingsGroup of Institutions, Barnala (Id: C-10303)",
  "Lala Jagat Narayan Institute of Information Technology and Management (Id: C-10280)",
  "Lala Lajpat Rai College of Pharmacy , Moga (Id: C-10363)",
  "Lala Lajpat Rai Institute of Engg. & Tech., Moga (Id: C-10486)",
  "Lala Lajpat Rai Memorial Institute of Management and Technology (Id: C-10495)",
  "Laxmi Bai Institute of Management and Technology, Patiala (Id: C-10508)",
  "Lord Krishna Institute of Management and Technology, Khokhar (Id: C-10507)",
  "Ludhiana College of Engg. and Technology, Ludhiana (Id: C-10459)",
  "Ludhiana Group of Colleges (Id: C-10491)",
  "Maharaja Ranjit Singh Khalsa Technical College, Batinda (Id: C-10317)",
  "Mahavir Educatinal and Charitable Trust Group of Institutes (Id: C-10421)",
  "Malout Institute of Management and Information Technology (Id: C-10336)",
  "Malwa Institute of Management, Vill Dhablan (Id: C-10510)",
  "Mata Sahib Kaur Khalsa College for Girls, Jagpalpur (Id: C-10373)",
  "M.K. Education Societies Group of Institutions (Id: C-10405)",
  "M.L.B Institute of Management and Technology (Id: C-10347)",
  "M.L Memorial Technical College (Id: C-10382)",
  "National College of Information Technology, Muktsar (Id: C-10306)",
  "North West Institute of Information Tech (Id: C-10273)",
  "North West Institute of Management & Technology (Id: C-29468)",
  "Patiala Institute of Engg. and Technology for Women (Id: C-10311)",
  "Pine Grove College of Management and Technology, (Id: C-10449)",
  "Pt. J.R Polytechnic, Hoshiarpur (Id: C-10327)",
  "Punjab Business School, Vill Sarkapra (Id: C-10315)",
  "Punjab College of Engg. and Tech. Lalru Mandi (Id: C-10287)",
  "Punjab College of Technical Education, Baddowal (Id: C-10418)",
  "Punjab Institute of Engg. and applied research, Vill Malkapur (Id: C-10431)",
  "Punjab Institute of Management and Technology (Id: C-10441)",
  "Quest infosys foundation group of institutions (Id: C-10403)",
  "Radiant Institute of Engg. and Technology, Abohar (Id: C-10252)",
  "Rakhra Management College, Rakhra (Id: C-10393)",
  "Ram Devi Jindal Educational Charitable Society Group of Institutions (Id: C-10322)",
  "Ramgarhia Institute of Engg. and Tech, Phagwara (Id: C-10279)",
  "Rattan Professional Education College, Sohana (Id: C-10299)",
  "Rayat and Bahra Institute of Hotel Management and Catering Technology (Id: C-10274)",
  "Rayat & Bahra College of Engg. & Biotechnology for Women (Id: C-10380)",
  "Rayat & Bahra College of Engg. &Biotechnology for Women (Id: C-10256)",
  "Rayat & Bahra College of Engg. & Nano-Technology for Women, Hoshairpur (Id: C-32588)",
  "Rayat & Bahra Institute of Engg. & Biotechnology (Id: C-10395)",
  "Rayat & Bahra Institute of Management, Bohan (Id: C-10390)",
  "Rayat & Bahra Institute of Pharmacy, Bohan (Id: C-10281)",
  "Rayat & Bahra Institute of Pharmacy, Sahauran (Id: C-10289)",
  "Rayat Institute of Engg. and Nano Technology, Hoshiarpur (Id: C-10514)",
  "Rayat Institute of engg. & Information Technology, Railmajra (Id: C-10296)",
  "Rayat Institute of Management and Technology, Railmajra (Id: C-10377)",
  "Rayat Institute of Pharmacy, Railmajra (Id: C-10258)",
  "R&B Institute of Management, Sahauran Campus, Mohali (Id: C-10302)",
  "Regional Institute of Management and Technology (Id: C-10425)",
  "RIMT- College of Architecture, Mandi Gobindgarh (Id: C-10417)",
  "RIMT- Institute of Engg. and Technology, Mandi Gobindgarh (Id: C-10434)",
  "RIMT- Institute of Management and Computer Technology, Mandi Gobindgarh (Id: C-10422)",
  "RIMT- Maharaja Agrasen Engg. College, Mandi Gobindgarh (Id: C-10297)",
  "RIMT- School of Management Studies, Mandi Gobindgarh (Id: C-10467)",
  "Sachdeva College of Pharmacy, VPO- Gharaun (Id: C-10316)",
  "Sachdeva Engg. College for Girls VPO Mohali (Id: C-10310)",
  "Sahibzada Ajit Singh Institute of Information Technology & Research (Id: C-10470)",
  "Sai Institute of Engg. & Tech, Manawala (Id: C-10335)",
  "Sai Institute of Management, Manawala (Id: C-10512)",
  "Sai Institute of Pharmaceutical Education, Manawala (Id: C-10463)",
  "Sant Baba Bhag Singh Institute of Engg. and Tech, Padhiana (Id: C-10468)",
  "Satyam Institute of Management Amritsar (Id: C-10471)",
  "satyam Institute of Management and Technology, Nakodar (Id: C-10330)",
  "S.B.S College of Engg. & Technology, Firozpur (Id: C-10426)",
  "S.D College ofPharmacy, Barnala (Id: C-10366)",
  "S.D Sabha Institute of Technology, Barnala (Id: C-10484)",
  "S.G.A.D Institute of IT and Management Verowal Road (Id: C-10504)",
  "S.G.T.B Institute of Management and IT, Bhogpur (Id: C-10331)",
  "Shaheed Bhagat Singh Polytechnic and Pharmacy College (Id: C-10375)",
  "Shaheed Udham Singh College of Engg. and Tech, Tangori (Id: C-10286)",
  "Shaheed Udham Singh College of Management and Technology (Id: C-10341)",
  "Shaheed Udham Singh College of Pharmacy, Tangori (Id: C-10388)",
  "Shaheed Udham Singh Engg. College (Id: C-10275)",
  "Shaheed Udham Singh Institute of Information Technology and Research (Id: C-10329)",
  "Shivalik College of Pharmacy, Nangal (Id: C-10399)",
  "Shivshankar Institute of Engg. & Tech, Patti (Id: C-10438)",
  "Shree Atam Vallabh Jain College (Id: C-10406)",
  "Shree Ganesh Group of Institutions, Vill- Rakhra (Id: C-10246)",
  "Shree Ganesh Institute of Management and Technology, Rakhra (Id: C-10360)",
  "Shree Krishna Educational Charitable Society Groups of Institutions (Id: C-10411)",
  "Shri Balaji Faculty of Information Technology & Business Management (Id: C-10278)",
  "Shri Balaji Group of Institutions, Bhedpura, Patiala (Id: C-10498)",
  "Shri Guru Ram Das Institute of Mgt & Tech, VPO- Halwara (Id: C-10364)",
  "Shri Raghunath Rai memorial School of Management (Id: C-10447)",
  "Shri Sai College of Pharmacy, Badhani (Id: C-10337)",
  "Sidana Institute of Management and Technology, Vill Khiala Khurd (Id: C-10308)",
  "S.M degree College, Lehragaga (Id: C-10414)",
  "Social Institute of Management and Technology, Jalandhar (Id: C-10439)",
  "Soldier Institute of Pharmacy,Jalandhar (Id: C-10432)",
  "Sri Sai College of Engg and Technology , Badhani (Id: C-10353)",
  "Sri Sai Lqbal College of Management and IT, Badhani (Id: C-10503)",
  "Sri Sukhmani Institute of Engg. and Technology, Dera Bassi (Id: C-10348)",
  "Sri Sukhmani Institute of Hospitality Management and Technology (Id: C-10365)",
  "S. Sukhjinder Singh Engg. & Tech College, VPO- Hayat Nagar (Id: C-10415)",
  "S. Sukhjinder Singh Institute of Science & Tech, VPO- Hayat Nagar (Id: C-10430)",
  "St. Kabir Institute of Information and Management Technology (Id: C-10396)",
  "St. Soldier Institute of Engg. and Technology, Jalandhar (Id: C-10513)",
  "St. Soldier Institute of Hotel Mangement and Catering Technology (Id: C-10401)",
  "St. Soldier Management and Technical Institute, Jalandhar (Id: C-10321)",
  "Surya Educational and Charitable Trust Group of Institutes (Id: C-10358)",
  "Surya Group of Institutions, Tangori (Id: C-10301)",
  "Swami Parmanand College of Engg. and Technology (Id: C-10295)",
  "Swami Parmanand Engg. College (Id: C-10472)",
  "Swami Sarvanand Institute of Engg. & Technology, Dinanagar (Id: C-10485)",
  "Swami Sarvanand Institute of Mangement and Technology (Id: C-10269)",
  "Swami Satyanand College of Management and Technology , Amritsar (Id: C-10346)",
  "Swami Vivekanand Business School, Ramnagar (Id: C-10451)",
  "Swami Vivekanand College of Management , Ramnagar (Id: C-10500)",
  "Swami Vivekanand College of Pharmacy, Ramnagar (Id: C-10272)",
  "Swami Vivekanand Institute of Engg. & Technology, Ramnagar (Id: C-10362)",
  "Swami Vivekanand Institute of Management and Technologies (Id: C-10325)",
  "Swami Vivekanand Institute of Management (women) Banur (Id: C-10466)",
  "Swami Vivekanand Institute of Technology, Banur (Id: C-10435)",
  "Swift Institute of Management and Technology, Ghaggar (Id: C-10412)",
  "Swift School of Pharmacy, Ghaggar (Id: C-10263)",
  "SWIFT TECHNICAL CAMPUS, PATIALA (Id: C-49523)",
  "Tagore Institute of Management, Patran (Id: C-10475)",
  "Takshila Management and Technology Campus, vill Hassanpura (Id: C-10465)",
  "Technical Education College , Handiya (Id: C-10505)",
  "The Berkley College, Dharamkot (Id: C-10268)",
  "Universal Business School, Desa Bassi, SAS, Nagar (Id: C-27839)",
  "Universal Institute of Engg. & Technology , Vill Ballopur, Lalru (Id: C-10494)",
  "Universal Institute of Management & Technology , Vill Ballopur, Lalru (Id: C-10293)",
  "Vidya Jyoti Educational Society, VPO-Gholu Majra (Id: C-10265)",
  "VMS College of Pharmacy, Batala (Id: C-10314)",
  "VMS Institute of Management, Batala (Id: C-10387)"
]