[
  "Alagappa Government Arts College, Karaikudi (Id: C-28526)",
  "ALAGAPPA UNIVERSITY CONSTITUENT COLLEGE (Id: C-47507)",
  "ALAGAPPA UNIVERSITY EVENING COLLEGE, PARAMAKKUDI (Id: C-47508)",
  "ALAGAPPA UNIVERSITY EVENING COLLEGE, RAMANATHAPURAM (Id: C-47509)",
  "ALAGAPPA UNIVERSITY EVENING COLLEGE, RAMESWARAM (Id: C-47510)",
  "ALAGAPPA UNIVERSITY EVENING COLLEGE, THIRUPPUVANAM (Id: C-47512)",
  "ALAGAPPA UNIVERSITY EVENING COLLEGE, THONDI (Id: C-47511)",
  "Ananda College, Devakottai (Id: C-28510)",
  "Arumugam Pillai Seethaiammal College, Tiruppathur (Id: C-28532)",
  "Caussanel College of Arts and Science, Muthuppettai (Id: C-28508)",
  "Dr. Umayal Ramanathan College for Women, Karaikudi (Id: C-28518)",
  "Dr.Zakir Hussain College, Ilayangudi (Id: C-28533)",
  "Government Arts College for Women, Ramanathapuram (Id: C-28521)",
  "Government Arts College for Women, Sivaganga (Id: C-28524)",
  "Government Arts College, Paramakudi (Id: C-28523)",
  "Idhaya College for Women, Sarugani (Id: C-28509)",
  "Madurai Sivakasi Nadar Pioneer Meenaksmi Women college, Poovanthi (Id: C-28534)",
  "Matha College of Arts and Science, Manamadurai (Id: C-28519)",
  "PMT Memorial college, Kamuthi (Id: C-28530)",
  "Raja Doraisingam Government Arts College, Sivaganga (Id: C-28512)",
  "Ramasamy Tamil College, Karaikudi (Id: C-28525)",
  "Seethalakshmi Achi College for Women, Pallathur (Id: C-28516)",
  "Sethupathi Govt. Arts College, Ramanathapuram (Id: C-28520)",
  "Sonai Meenal Arts and Science College, Mudukulathur (Id: C-28528)",
  "Sree Sevugan Annamalai College, Devakottai (Id: C-28535)",
  "Sri Sarada Niketan college for Women, Amaravathipudur (Id: C-28513)",
  "Syed Ammal College of Arts and Science, Ramanathapuram (Id: C-28527)",
  "Syed Hameedha Arabic College, Kilakarai (Id: C-28511)",
  "Syed Hameetha Arts and Science College, Kilakarai (Id: C-28531)",
  "The Thassim Beevi Abdul Kadar College for Women, Kilakarai (Id: C-28515)",
  "THIAGI THARMAKKAN AMIRTHAM COLLEGE OF ARTS AND SCIENCE (Id: C-47506)",
  "VSS Government Arts College, Poolankurichi (Id: C-28522)",
  "Amrita School of Business, Coimbatore (Id: C-7023)",
  "Amrita School of Engineering, Coimbatore (Id: C-7021)",
  "Department of Communication, Coimbatore (Id: C-7024)",
  "Department of Social Work, Coimbatore (Id: C-7033)",
  "Aalim Muhammed Salegh College of Engineering (Id: C-16533)",
  "A.C. College of Technology Campus (Id: C-25071)",
  "A C T College of Engineering and Technology (Id: C-16600)",
  "Adhi College of Engineering and Technology (Id: C-16554)",
  "Adhiparasakthi College of Engineering (Id: C-16562)",
  "Adhiparasakthi Engineering College (Id: C-16487)",
  "Adithya Institute of Technology (Id: C-37053)",
  "Adiyaman College of Engineering (Id: C-37105)",
  "AGNI SCHOOL OF BUSINESS EXCELLENCE (Id: C-48268)",
  "AISHWARYA COLLEGE OF ENGINEERING AND TECHNOLOGY, ERODE (Id: C-45289)",
  "AJK Institute of Management (Id: C-37098)",
  "Akshaya College of Engineering and Technology (Id: C-36985)",
  "AKSHAYA INSTITUTE OF MANAGEMENT STUDIES, COIMBATORE (Id: C-46582)",
  "Aksheyaa College of Engineering (Id: C-16574)",
  "A.K.T. Memorial College of Engineering & Technology (Id: C-16591)",
  "Alagappa Chettiar College of Engg &Tech, Karaikudi (Id: C-26789)",
  "Al-Ameen Engineering College (Id: C-36951)",
  "Alpha College of Engineering (Id: C-16474)",
  "Alpha Institute of Management (Id: C-36953)",
  "Anand Institute of Higher Technology (Id: C-16618)",
  "Anand School of Architecture (Id: C-48245)",
  "Angel College of Engineering and Technology (Id: C-36981)",
  "Anjalai Ammal Mahalingam Engineering College (Id: C-25004)",
  "Annai College of Engineering and Technology (Id: C-25040)",
  "Annai Mathammal Sheela Engineering College (Id: C-37045)",
  "ANNAI MIRA COLLEGE OF ENGINEERING AND TECHNOLOGY (Id: C-48246)",
  "Annai Teresa College of Engineering (Id: C-16505)",
  "Annai Vailankanni College of Engineering (Id: C-27088)",
  "Annamalaiar College of Engineering (Id: C-16467)",
  "Annapoorana Engineering College (Id: C-36971)",
  "Anna University of Technology Madurai, Dindigul Campus (Id: C-26786)",
  "Anna University of Technology Madurai, Madurai Campus (Id: C-26778)",
  "Anna University of Technology Madurai, Ramnad Campus (Id: C-26803)",
  "Anna University of Technology, Tiruchirappalli - Ariyalur Campus (Id: C-25048)",
  "Anna University of Technology Tiruchirappalli - Panruti Campus (Id: C-25056)",
  "Anna University of Technology Tiruchirappalli - Pattukkottai Campus (Id: C-24997)",
  "Anna University of Technology Tiruchirappalli - Tirukkuvalai Campus (Id: C-25034)",
  "Apollo Engineering College (Id: C-16514)",
  "Apollo Priyadarshanam Institute of Technology (Id: C-16517)",
  "Arasu Engineering College (Id: C-24993)",
  "A R Engineering College (Id: C-16544)",
  "Arignar Anna Institute of Science and Technology (Id: C-16536)",
  "A.R.J. College of Engineering and Technology (Id: C-25039)",
  "A.R.J. Institute of Management Studies (Id: C-25044)",
  "A R M College of Engineering and Technology (Id: C-16575)",
  "AR SCHOOL OF BUSINESS (Id: C-48269)",
  "Arul College of Technology (Id: C-27073)",
  "Arulmigu Meenakshi Amman College of Engineering (Id: C-16506)",
  "ARULMURUGA TECHNICAL CAMPUS (Id: C-48254)",
  "Arunachala College of Engineering for Women (Id: C-27061)",
  "Arunai Engineering College (Id: C-16610)",
  "Asan Memorial College of Engineering and Technology (Id: C-16486)",
  "ASL Pauls College of Engineering and Technology (Id: C-37009)",
  "As-Salam College of Engineering and Technology (Id: C-25033)",
  "A.V.C. College of Engineering (Id: C-24992)",
  "AVS Engineering College (Id: C-36970)",
  "Balaji Institute of Engineering and Technology (Id: C-16584)",
  "Balamani Arunachalam Educational & Charitable Trusts Group of Institution (Id: C-16581)",
  "Bannari Amman Institute of Technology (Id: C-36984)",
  "BANNARI AMMAN INSTITUTE OF TECHNOLOGY - MCA PROGRAMME (Id: C-46583)",
  "Bhajarang Engineering College (Id: C-16481)",
  "Bharathidasan Engineering College (Id: C-16475)",
  "Bharathiyar Institute of Engineering for Women (Id: C-37076)",
  "Bharath Niketan Engineering College, Theni (Id: C-26806)",
  "B K R College of Engineering and Technology (Id: C-16465)",
  "BRAHMA SCHOOL OF BUSINESS, NAMAKKAL (Id: C-45294)",
  "C. Abdul Hakeem College of Engineering and Technology (Id: C-16495)",
  "Cape Institute of Technology (Id: C-27081)",
  "C.A.R.E School of Architecture (New) (Id: C-25047)",
  "C.A.R.E. School of Engineering (Id: C-25053)",
  "Cauvery College of Engineering and Technology (Id: C-25029)",
  "Central Electro Chemicals Researh Institute, Karaikudi (Id: C-26800)",
  "Central Institute of Plastics Engineering and Technology (Id: C-16479)",
  "Chandy College of Engineering (Id: C-27076)",
  "Chendhuran College of Engineering and Technology (Id: C-25027)",
  "Chendu College of Engineering & Technology (Id: C-16553)",
  "Chennai Institute of Technology (Id: C-16576)",
  "CHERAN COLLEGE OF ENGINEERING (Id: C-48255)",
  "CHERAN SCHOOL OF ARCHITECTURE (Id: C-48256)",
  "Chettinad College of Engineering & Technology (Id: C-37006)",
  "Christian College of Engineering and Technology, Oddanchatram, Palani (Id: C-26780)",
  "Christ The King Engineering College (Id: C-36941)",
  "C K College of Engineering & Technology (Formerly Sri Jayaram Engineering College) (Id: C-25014)",
  "CMS College of Engineering (Id: C-37005)",
  "CMS College of Engineering and Technology (Id: C-37075)",
  "Coimbatore Institute of Engineering and Technology (Id: C-36942)",
  "Coimbatore Institute of Technology (Id: C-36969)",
  "College of Business Management (Id: C-36925)",
  "College of Engg., Guindy Campus (Id: C-25072)",
  "CR ENGINEERING COLLEGE, VALAYAPATTI, MADURAI (Id: C-45317)",
  "CSI College of Engineering (Id: C-37016)",
  "C.S.I.Institute of Technology (Id: C-27093)",
  "DA VINCI SCHOOL OF DESIGN AND ARCHITECTURE (Id: C-48248)",
  "Designed Environment Academy & Research Institute (DEAR) (Id: C-25013)",
  "Dhaanish Ahmed College of Engineering (Id: C-16615)",
  "Dhanalakshmi College of Engineering (Id: C-16567)",
  "Dhanalakshmi Srinivasan College of Engineering (Id: C-37103)",
  "Dhanalakshmi Srinivasan College of Engineering and Technology (Id: C-16625)",
  "Dhanalakshmi Srinivasan Engineering College (Id: C-24984)",
  "Dhanalakshmi Srinivasan Institute of Management (Id: C-25023)",
  "DHANALAKSHMI SRINIVASAN INSTITUTE OF RESEARCH AND TECHNOLOGY (Id: C-48277)",
  "DHANALAKSHMI SRINIVASAN INSTITUTE OF TECHNOLOGY (Id: C-48278)",
  "DHIRAJLAL GANDHI COLLEGE OF TECHNOLOGY, SALEM (Id: C-45299)",
  "DMI College of Engineering (Id: C-16503)",
  "DMI Engineering College (Id: C-27086)",
  "Dr.G.U.Pope College of Engineering (Id: C-27084)",
  "Dr.Mahalingam College of Engineering and Technology (Id: C-37050)",
  "Dr.Nagarathinam's College of Engineering (Id: C-37095)",
  "Dr.Nallini Institute of Engineering and Technology (Id: C-37101)",
  "Dr.Navalar Nedunchezhiyan College of Engineering (Id: C-25037)",
  "Dr N.G.P. Institute of Technology (Id: C-36929)",
  "Dr. Paul's Engineering College (Id: C-16623)",
  "Dr.Sivanthi Adithanar College of Engineering (Id: C-27038)",
  "Easa College of Engineering & Technology (Id: C-36991)",
  "Easwari Engineering College (Id: C-16560)",
  "Edayathangudy G.S.Pillay Engineering College (Id: C-24989)",
  "Einstein College of Engineering (Id: C-27050)",
  "Erode Builder Educational Trust's Group of Institutions (Id: C-37104)",
  "Erode Sengunthar Engineering College (Id: C-37099)",
  "Er. Perumal Manimekalai College of Engineering (Id: C-37033)",
  "E.S. College of Engineering and Technology (Id: C-16565)",
  "Excel Business School (Id: C-37019)",
  "Excel College of Architecture and Planning (Id: C-36963)",
  "Excel College of Engineering & Technology (Id: C-37073)",
  "Excel College of Technology (Id: C-37011)",
  "Excel Engineering College (Id: C-36930)",
  "Fatima Michael College of Engineering and Technology, Madurai (Id: C-26784)",
  "Francis Xavier Engineering College (Id: C-27091)",
  "Ganadipathy Tulsi's Engineering College (Id: C-16478)",
  "Ganapathy Chettiar College of Engineering and Technology, Paramakudi (Id: C-26801)",
  "GANESH COLLEGE OF ENGINEERING, SALEM (Id: C-45300)",
  "Gem Business Academy (Id: C-36997)",
  "GGR College of Engineering (Id: C-16469)",
  "G.K.M. College of Engineering and Technology (Id: C-16521)",
  "Global Institute of Engineering and Technology (Id: C-16473)",
  "Gnanamani College of Engineering (Id: C-36996)",
  "Gnanamani College of Technology (Id: C-36937)",
  "Gnanamani Institute of Management Studies (Id: C-37088)",
  "Gnanam School of Business (Id: C-25000)",
  "Gojan School of Business and Technology (Id: C-16580)",
  "Gopal Ramalingam Memorial Engineering College (Id: C-16592)",
  "Government College of Engineering (Id: C-27034)",
  "Government College of Engineering (Id: C-37003)",
  "Government College of Engineering (Id: C-36980)",
  "Government College of Technology (Id: C-36975)",
  "Greentech College of Engineering for Women (Id: C-37039)",
  "Hallmark Business School (Id: C-25061)",
  "Happy Valley Business School (Id: C-36939)",
  "Hindusthan College of Engineering and Technology (Id: C-37063)",
  "Hindusthan Institute of Technology (Id: C-37046)",
  "Holy Angels School of Business (New) (Id: C-24994)",
  "Holycross Engineering Colleges (Id: C-27054)",
  "HOSUR INSTITUTE OF TECHNOLOGY AND SCIENCE (Id: C-48257)",
  "Idhaya Engineering College for Women (Id: C-16523)",
  "I.F.E.T. College of Engineering (Id: C-16543)",
  "Imayam College of Engineering (Id: C-25031)",
  "Imayam College of Information Technology (Id: C-25021)",
  "Immanuel Arasar J.J.College of Engineering (Id: C-27094)",
  "Indira Gandhi College of Engineering and Technology for Women (Id: C-16566)",
  "Indira Institute of Engineering and Technology (Id: C-16582)",
  "Indra Ganesan College of Engineering (Id: C-25066)",
  "Indus College of Engineering (Id: C-36934)",
  "Infant Jesus College of Engineering (Id: C-27045)",
  "Infant Jesus College of Engineering and Technology (Id: C-27090)",
  "Info Institute of Engineering (Id: C-37031)",
  "Institute of Road and Transport Technology (Id: C-36974)",
  "JAIRUPAA COLLEGE OF ENGINEERING (Id: C-49357)",
  "James College of Engineering and Technology (Id: C-27083)",
  "Jansons Institute of Technology (Id: C-37021)",
  "Jawahar Engineering College (Id: C-16569)",
  "Jawaharlal Institute of Technology (Id: C-37090)",
  "Jaya Engineering College (Id: C-16577)",
  "Jayalakshmi Institute of Technology (Id: C-37056)",
  "Jayamatha Engineering College (Id: C-27085)",
  "Jayam College of Engineering and Technology (Id: C-37097)",
  "Jayaraj Annapackiam CSI College of Engineering (Id: C-27080)",
  "Jayaram College of Engineering and Technology (Id: C-25011)",
  "Jayaram College of Engineering and Technology (Standalone MCA Institution) (Id: C-25015)",
  "Jaya Suriya Engineering College (Id: C-16509)",
  "Jay Shriram Group of Institutions (Id: C-36950)",
  "JCT College of Engineering and Technology (Id: C-37055)",
  "J E I Mathaajee College of Engineering (Id: C-16596)",
  "Jeppiaar Engineering College (Id: C-16539)",
  "Jerusalem College of Engineering (Id: C-16525)",
  "JEYARAJ CHELLATHURAI COLLEGE (Id: C-36503)",
  "J.J. College of Engineering and Technology (Id: C-25008)",
  "JKK Munirajah College of Technology (Id: C-37051)",
  "J.K.K Munirajah School of Architecture (Id: C-36986)",
  "J.K.K.Nattraja College of Engineering & Technology (Id: C-37096)",
  "J N N Institute of Engineering (Id: C-16512)",
  "Joe Suresh Engineering College (Id: C-27072)",
  "John Bosco Engineering College (Id: C-16520)",
  "J.P.College of Engineering (Id: C-27051)",
  "Kalaignar Karunanidhi Institute of Technology (Id: C-37070)",
  "Kalaivani College of Technology (Id: C-37042)",
  "Kalasalingam Institute of Technology (Id: C-27066)",
  "Kalsar College of Engineering (Id: C-16585)",
  "Kamaraj College of Engineering and Technology (Id: C-27075)",
  "Kamban Engineering College (Id: C-16586)",
  "Kanchi Pallavan Engineering College (Id: C-16588)",
  "KARAIKUDI INSTITUTE OF TECHNOLOGY AND KARAIKUDI INSTITUTE OF MANAGEMENT, KARAIKUDI (Id: C-45319)",
  "Karpagam College of Engineering (Id: C-37044)",
  "Karpagam Institute of Technology (Id: C-37035)",
  "Karpaga Vinayaga College of Engineering and Technology (Id: C-16599)",
  "Karpaga Vinayaga Institute of Management (Id: C-24980)",
  "Karur College of Engineering (Id: C-36982)",
  "Kathir College of Engineering (Id: C-36988)",
  "KCG College of Technology (Id: C-16611)",
  "KGiSL Institute of Technology (Id: C-36989)",
  "King College of Technology (Id: C-36959)",
  "Kings College of Engineering (Id: C-25038)",
  "Kings Engineering College (Id: C-16466)",
  "Kingston Engineering College (Id: C-16602)",
  "K.K.C. College of Engineering and Technology (New) (Id: C-25035)",
  "K.L.N. College of Engineering Pottapalayam, Sivagangai Dist (Id: C-26785)",
  "K.L.N. College of Information Technology, Pottapalayam, Sivagangai Dist (Id: C-26812)",
  "KNOWLEDGE BUSINESS SCHOOL, SALEM (Id: C-45301)",
  "Knowledge Institute of Technology (Id: C-37058)",
  "K.N.S.K. College of Engineering and Technology (Id: C-27092)",
  "Kodaikanal Institute of Technology, Kodaikanal (Id: C-26782)",
  "Kongu Engineering College (Id: C-37065)",
  "Kongunadu College of Engineering and Technology (Id: C-24986)",
  "KPR Institute of Engineering and Technology (Id: C-36999)",
  "KPR School of Business (Id: C-37079)",
  "K.Ramakrishnan College of Engineering (Id: C-24983)",
  "K.Ramakrishnan College of Technology(New) (Id: C-25054)",
  "Krishnaswamy College of Engineering (Id: C-25020)",
  "KRS College of Engineering (Id: C-16589)",
  "K.S.K College of Engineering and Technology (New) (Id: C-24999)",
  "K.S.Rangasamy College of Technology (Id: C-39247)",
  "K S R College of Engineering (Id: C-36924)",
  "KSR INSTITUTE FOR ENGINEERING AND TECHNOLOGY, NAMAKKAL (Id: C-45295)",
  "KTVR Knowledge Park for Engineering & Technology (Id: C-36931)",
  "Kumaraguru college of Technology (Id: C-36926)",
  "KUMARAN INSTITUTE OF TECHNOLOGY (Id: C-48249)",
  "Kurinji College of Engineering and Technology (Id: C-25060)",
  "KV Institute of Management and Information Studies (Id: C-36946)",
  "Lakshmi Chand Rajani College of Engineering and Technology (Id: C-16494)",
  "Latha Mathavan Engineering College, Madurai (Id: C-26797)",
  "Lord Ayyappa Institute of Engineering and Technology (Id: C-16605)",
  "Lord Jagannath College of Engineering and Technology (Id: C-27042)",
  "Lord Venkateshwara Engineering College (Id: C-16556)",
  "Loyola-ICAM College of Engineering and Technology (Id: C-16477)",
  "Loyola Institute of Technology (Id: C-16518)",
  "Loyola Institute of Technology and Science (Id: C-27087)",
  "Maamallan Institute of Technology (Id: C-16483)",
  "Madha Engineering College (Id: C-16595)",
  "Madha Institute of Engineering & Technology (Id: C-16528)",
  "Madras Institute of Technology Campus (Id: C-25070)",
  "Madurai Institute of Engineering and Technology, Sivagangai (Id: C-26793)",
  "MADURAI SCHOOL OF MANAGEMENT (Id: C-48270)",
  "Magna College of Engineering (Id: C-16545)",
  "Maha Bharathi Engineering College (Id: C-16496)",
  "Mahakavi Bharathiyar College of Engineering and Technology (Id: C-27055)",
  "Mahalakshmi Engineering College (New) (Id: C-25065)",
  "Maharaja Engineering College (Id: C-36998)",
  "Maharaja Engineering College for Women (Id: C-36965)",
  "Maharaja Institute of Technology (Id: C-37007)",
  "Maharaja Prithvi Engineering College (Id: C-37071)",
  "Mahath Amma Institute of Engineering and Technology (Id: C-25005)",
  "Mahendra College of Engineering (Id: C-37074)",
  "Mahendra Engineering College (Id: C-37054)",
  "Mahendra Engineering College for Women (Id: C-36978)",
  "Mahendra Institute of Engineering and Technology (Id: C-36952)",
  "Mahendra Institute of Technology (Id: C-37004)",
  "Mailam Engineering College (Id: C-16468)",
  "M.A.M. B. School(New) (Id: C-25064)",
  "M.A.M. College of Engineering (Id: C-25012)",
  "M.A.M. College of Engineering and Technology (Id: C-25045)",
  "M.A.M. School Architecture (New) (Id: C-25067)",
  "M.A.M. School of Engineering (New) (Id: C-25007)",
  "M.A.R. College of Engineering and Technology (Id: C-25042)",
  "Mar Ephraem College of Engineering and Technology (Id: C-27039)",
  "Maria College of Engineering and Technology (Id: C-27028)",
  "Marthandam College of Engineering and Technology (Id: C-27057)",
  "McGan's Ooty School of Architecture (Id: C-36933)",
  "MEASI Academy of Architecture (Id: C-16489)",
  "Meenaakshi Ramaswamy Engineering College (Id: C-25063)",
  "Meenakshi College of Engineering (Id: C-16551)",
  "Meenakshi Sundararajan Engineering College (Id: C-16480)",
  "Mepco Schlenk Engineering College (Id: C-27058)",
  "M.E.T. Engineering College (Id: C-27046)",
  "Michael Institute of Management, Madurai (Id: C-26805)",
  "M.I.E.T. Engineering College (Id: C-25046)",
  "Misrimal Navajee Munoth Jain Engineering College (Id: C-16488)",
  "MISRIMAL NAVAJEE MUNOTH JAIN SCHOOL OF ARCHITECTURE (Id: C-48250)",
  "M.Kumarasamy College of Engineering (Id: C-37059)",
  "M.K. UNIVERSITY COLLEGE, KOTTUR (Id: C-36570)",
  "M.N.S.K. College of Engineering (Id: C-25049)",
  "Mohamed Sathak A.J. Academy of Architecture (Id: C-16578)",
  "Mohamed Sathak A.J. College of Engineering (Id: C-16571)",
  "Mohamed Sathak Engineering College, Kilakarai (Id: C-26795)",
  "Mookambigai College of Engineering (Id: C-25032)",
  "Mother Terasa College of Engineering and Technology (Id: C-25069)",
  "Mount Zion College of Engineering and Technology (Id: C-25024)",
  "M.P.Nachimuthu M.Jaganathan Engineering College (Id: C-36960)",
  "M.R.K. Institute of Technology (Id: C-25043)",
  "Muthayammal Engineering College (Id: C-36954)",
  "MUTHAYAMMAL ENGINEERING COLLEGE (MCA PROGRAMME), NAMAKKAL (Id: C-45296)",
  "MUTHAYAMMAL TECHNICAL CAMPUS, NAMAKKAL (Id: C-45297)",
  "NALANDA SCHOOL OF BUSINESS (Id: C-48279)",
  "NALANDA SCHOOL OF BUSINESS, TRICHY (Id: C-46106)",
  "Nandha College of Technology (Id: C-37038)",
  "Nandha Engineering College (Id: C-36958)",
  "Narasu's Sarathy Institute of Technology (Id: C-37026)",
  "Narayana Guru College of Engineering (Id: C-27062)",
  "National College of Engineerings (Id: C-27053)",
  "National Engineering College (Id: C-27089)",
  "Nehru Institute of Engineering and Technology (Id: C-37025)",
  "Nehru Institute of Information Technology and Management (Id: C-37037)",
  "Nehru Institute of Management Studies (Id: C-36962)",
  "New Prince Shri Bhavani College of Engineering and Technology (Id: C-16470)",
  "NIGHTINGALE INSTITUTE OF TECHNOLOGY (Id: C-48258)",
  "N.P.R. College of Engineering and Technology, Natham Village, Dindigul (Id: C-26811)",
  "N.R. SCHOOL OF ARCHITECTURE, COIMBATORE (Id: C-45286)",
  "N.S.N COLLEGE OF ENGINEERING AND TECHNOLOGY, KARUR (Id: C-45292)",
  "OAS Institute of Technology and Management Group of Institutions (New) (Id: C-25036)",
  "Odaiaappa Engineering College, Theni (Id: C-26809)",
  "OOA-MAVMM SCHOOL OF MANAGEMENT, MADURAI (Id: C-45369)",
  "Oxford College of Engineering (Id: C-16558)",
  "Oxford Engineering College (Id: C-25057)",
  "Paavaai Group of Institutions (Id: C-36955)",
  "Paavai College of Engineering (Id: C-37017)",
  "Paavai Engineering College (Id: C-37000)",
  "P.A.College of Engineering and Technology (Id: C-37041)",
  "Pallavan College of Engineering (Id: C-16498)",
  "Pandiyan Saraswathi Yadav Engineering College, Arasanoor, Sivagangai (Id: C-26775)",
  "Panimalar Engineering College (Id: C-16620)",
  "Panimalar Institute of Technology (Id: C-16484)",
  "Pannai College of Engineering and Technology, Manamadurai, Sivagangai Dist (Id: C-26798)",
  "Pannaikkadu Veerammal Paramasivam College of Engineering and Technology for Women, Dindigul (Id: C-26799)",
  "Parisutham Institute of Technology and Science (Id: C-25003)",
  "Park College of Engineering and Technology (Id: C-37015)",
  "Park College of Technology (Id: C-37049)",
  "Pavai College of Technology (Id: C-36967)",
  "Pavendar Bharathidasan College of Engineering and Technology (Id: C-25058)",
  "Pavendar Bharathidasan Institute of Information Technology (Id: C-25019)",
  "P.B. College of Engineering (Id: C-16546)",
  "PERI Institute of Technology (Id: C-16482)",
  "PET Engineering College (Id: C-27037)",
  "PGP college of Engineering and Technology (Id: C-36928)",
  "P M R Engineering College (Id: C-16557)",
  "Podhigai College of Engineering and Technology (Id: C-16462)",
  "POLLACHI INSTITUTE OF ENGINEERING AND TECHNOLOGY (Id: C-48259)",
  "Ponjesly College of Engineering (Id: C-27043)",
  "Ponnaiyah Ramajayam College of Engineering and Technology (Id: C-24985)",
  "PPG Business School (Id: C-37014)",
  "PPG Institute of Technology (Id: C-37043)",
  "Prahar School of Architecture (Id: C-37072)",
  "Prathyusha Institute of Technology and Management (Id: C-16485)",
  "P.R. Engineering College (Id: C-24996)",
  "Prime College of Architecture and Planning (New) (Id: C-25001)",
  "Prince Dr. K. Vasudevan College of Engineering & Technology (Id: C-16608)",
  "Prince Shri Venkateshwara Padmavathy Engineering College (Id: C-16609)",
  "Priyadarshini Engineering College (Id: C-16515)",
  "Professional Group of Institutions (Id: C-36940)",
  "PSG College of Technology (Id: C-37013)",
  "P.S.N.A. College of Engineering and Technology, Dindigul (Id: C-26783)",
  "PSN College of Engineering and Technology (Id: C-27041)",
  "PSN Engineering College (Id: C-27070)",
  "PSN Institute of Technology and Science (Id: C-27079)",
  "P.S.R.Engineering College (Id: C-27082)",
  "P.S.R.Rengasamy College of Engineering for Women (Id: C-27067)",
  "P.S.V.College of Engineering and Technology (Id: C-37061)",
  "P.T. Lee Chengalvaraya Naicker College of Engineering and Technology (Id: C-16627)",
  "PTR College of Engineering, Madurai (Id: C-26810)",
  "Raja College of Engineering, Madurai (Id: C-26814)",
  "Raja International Institute of Technology for Women (Id: C-27031)",
  "Rajalakshmi Engineering College (Id: C-16626)",
  "Rajalakshmi Institute of Technology (Id: C-16532)",
  "Rajiv Gandhi College of Engineering (Id: C-16540)",
  "Ranganathan Architecture College (Id: C-37093)",
  "Ranganathan Engineering College (Id: C-36972)",
  "Ranippettai Engineering College (Id: C-16613)",
  "RATHINAM TECHNICAL CAMPUS, COIMBATORE (Id: C-45287)",
  "RENGNAYAHI VARATHARAJ COLLEGE OF ENGINEERING TECHNOLOGY, VIRUDHUNAGAR (Id: C-45259)",
  "RKKR School Of Management Studies (Id: C-37083)",
  "R.M.D Engineering College (Id: C-16527)",
  "R M K College of Engineering and Technology (Id: C-16497)",
  "R.M.K Engineering College (Id: C-16614)",
  "Roever College of Engineering and Technology (Id: C-25009)",
  "Roever Engineering College (Id: C-25010)",
  "Roever Institute of Management (Id: C-25052)",
  "ROHINI COLLEGE OF ENGINEERING AND TECHNOLOGY (Id: C-48273)",
  "Rrase College of Engineering (Id: C-16622)",
  "RVS College of Computer Application (Id: C-36973)",
  "RVS College of Engineering and Technology (Id: C-36938)",
  "R.V.S. College of Engineering and Technology, Dindigul (Id: C-26791)",
  "RVS Educational Trust's Group of Institutions (Id: C-37001)",
  "RVS Institute of Management Studies (Id: C-37086)",
  "RVS - KVK Institute of Business Management (Id: C-25055)",
  "RVS - KVK School of Architecture (New) (Id: C-25068)",
  "RVS PADMAVATHY SCHOOL OF ARCHITECTURE (Id: C-48251)",
  "R.V.S. School of Architecture (Id: C-37082)",
  "RVS School of Business Management, Dindigul (Id: C-26788)",
  "RVS School of Computer Applications, Dindigul (Id: C-26790)",
  "RVS School of Engineering and Technology, Dindigul (Id: C-26787)",
  "RVS Schoool of Architecture, Dindigul (Id: C-26779)",
  "SACS MAVMM Engineering College, Madurai (Id: C-26792)",
  "S.A Engineering College (Id: C-16463)",
  "Sakthi Engineering College (Id: C-16493)",
  "Sakthi Institute of Information and Management Studies (Id: C-37067)",
  "Sakthi Mariamman Engineering College (Id: C-16555)",
  "Salem College of Engineering and Technology (Id: C-37023)",
  "Sams College of Engineering and Technology (Id: C-16510)",
  "SAN International Business School (Id: C-37102)",
  "SAN International Info School (Id: C-37081)",
  "Sapthagiri College of Engineering (Id: C-36979)",
  "Saranathan College of Engineering (Id: C-25006)",
  "Saraswathi Velu College of Engineering (Id: C-16522)",
  "Saraswathy College of Engineering and Technology (Id: C-16538)",
  "Sardar Raja College of Engineerings (Id: C-27030)",
  "SASI CREATIVE SCHOOL OF ARCHITECTURE (Id: C-48260)",
  "Sasi Creative School of Business (Id: C-37066)",
  "Sasurie Academy of Engineering (Id: C-36977)",
  "Sasurie College of Engineering (Id: C-36935)",
  "Satyam College of Engineering and Technology (Id: C-27096)",
  "Saveetha Engineering College (Id: C-16590)",
  "SBM College of Engineering and Technology, Dindigul (Id: C-26796)",
  "SCAD College of Engineering and Technology (Id: C-27048)",
  "Scad Engineering College (Id: C-27056)",
  "SCAD INSTITUTE OF TECHNOLOGY (Id: C-48261)",
  "School of Architecture & Planning Campus (Id: C-25073)",
  "Selvam College of Technology (Id: C-37068)",
  "Sembodai Rukmani Varatharajan Engineering College (Id: C-24998)",
  "Sengunthar B-School for Women (Id: C-36992)",
  "Sengunthar College of Engineering (Id: C-36945)",
  "Sengunthar Engineering College (Id: C-36966)",
  "Sethu Institute of Technology (Id: C-27064)",
  "Shanmuganathan Engineering College (Id: C-25059)",
  "Shivani Engineering College (Id: C-25030)",
  "Shivani Institute of Technology (Id: C-25025)",
  "Shivani School of Business Management (Id: C-29110)",
  "Shree Motilal Kanhaiyalal Fomra Institute of Technology (Id: C-16508)",
  "Shreenivasa Engineering College (Id: C-36976)",
  "SHREE SATHYAM COLLEGE OF ENGINEERING AND TECHNOLOGY, SALEM (Id: C-45302)",
  "Shree Venkateshwara Hi-Tech Engineering College (Id: C-37087)",
  "Shri Andal Alagar College of Engineering (Id: C-16464)",
  "Shri Angalamman College of Engineering and Technology (Id: C-25051)",
  "Shri Sapthagiri Institute of Technology (Id: C-16502)",
  "SIGMA COLLEGE OF ARCHITECTURE (Id: C-48274)",
  "Sir Isaac Newton College of Engineering and Technology (New) (Id: C-25002)",
  "Sivaji College of Engineering and Technology (Id: C-27049)",
  "SKANDHA SCHOOL OF ARCHITECTURE, NAMAKKAL (Id: C-45298)",
  "S.K.P Engineering College (Id: C-16459)",
  "S.K.P. Institute of Technology (Id: C-16524)",
  "S.K.R Engineering College (Id: C-16593)",
  "SMR East Coast College of Engineering and Technology (New) (Id: C-24982)",
  "SNS College of Engineering (Id: C-37036)",
  "SNS College of Technology (Id: C-36947)",
  "SNT Global Academy of Management Studies and Technology (Id: C-36964)",
  "Sona College of Technology (Id: C-37028)",
  "Sree Krishna College of Engineering (Id: C-16501)",
  "Sree Narayana Guru Institute of Management Studies (Id: C-37085)",
  "Sree Sakthi Engineering College (Id: C-36956)",
  "Sree Sastha College of Engineering (Id: C-16542)",
  "Sree Sastha Institute of Engineering and Technology (Id: C-16491)",
  "Sree Sowdambika College of Engineering (Id: C-27095)",
  "SRG Engineering College (Id: C-37091)",
  "Sri Aravindar Engineering College (Id: C-16601)",
  "Sri Balaji Chockalingam Engineering College (Id: C-16460)",
  "Sri Bharathi Engineering College for Women (Id: C-25017)",
  "S.R.I. College of Engineering & Technology (Id: C-16612)",
  "Sri Eshwar College of Engineering (Id: C-37057)",
  "Sri Ganesh School of Business management (Id: C-37062)",
  "Sriguru Institute Of Technology (Id: C-36994)",
  "Sri Krishna College of Engineering (Id: C-16603)",
  "Sri Krishna College of Engineering and Technology (Id: C-36995)",
  "Sri Krishna College of Technology (Id: C-37064)",
  "Sri Krishna Engineering College (Id: C-16597)",
  "Sri Krishna Institute of Management (Id: C-37008)",
  "Sri Krishna Institute of Technology (Id: C-16499)",
  "Sri Lakshmi Ammal Engineering College (Id: C-16573)",
  "Sri Muthukumaran Institute of Technology (Id: C-16531)",
  "Sri Nandhanam College of Engineering and Technology (Id: C-16564)",
  "Srinivasa Institute of Engineering and Technology (Id: C-16594)",
  "Srinivasan Engineering College (Id: C-24995)",
  "Sri Raaja Raajan College of Engineering and Technology, Karaikudi (Id: C-26804)",
  "SRI RAMAKRISHNA COLLEGE OF ENGINEERING (Id: C-48280)",
  "Sri Ramakrishna Engineering College (Id: C-37089)",
  "Sri Ramakrishna Institute of Technology (Id: C-37032)",
  "Sri Ramana Maharishi College of Engineering (Id: C-16492)",
  "Sri Ramanathan Engineering College (Id: C-37077)",
  "Sri Ramanujar Engineering College (Id: C-16583)",
  "Sri Ram Engineering College (Id: C-16548)",
  "SRI RANGANATHAR INSTITUTE OF ENGINEERING AND TECHNOLOGY, COIMBATORE (Id: C-45288)",
  "Sri Rangapoopathy College of Engineering (Id: C-16606)",
  "Sri Sairam Engineering College (Id: C-16547)",
  "Sri Sai Ram Institute of Technology (Id: C-16476)",
  "Sri Shakthi Institute of Engineering and Technology (Id: C-37080)",
  "SRI SHANMUGHA COLLEGE OF ENGINEERING AND TECHNOLOGY, SALEM (Id: C-45303)",
  "Sri Sivasubramaniya Nadar College of Engineering (Id: C-16604)",
  "Sri Subramanya College of Engineering and Technology, Palani (Id: C-26815)",
  "SRI VENKATESHWARA INSTITUTE OF ENGINEERING, KRISHNAGIRI (Id: C-45293)",
  "Sri Venkateswaraa College of Technology (Id: C-16526)",
  "Sri Venkateswara College of Computer Applications and Management (Id: C-37100)",
  "Sri Venkateswara College of Engineering (Id: C-16572)",
  "Sri Venkateswara College of Engineering and Technology (Id: C-16504)",
  "Sri Venkateswara Institute of Information Technology and Management (Id: C-37024)",
  "Sri Venkateswara Institute of Science and Technology (Id: C-16561)",
  "Sri Vidya College of Engineering and Technology (Id: C-27059)",
  "SRR Engineering College (Id: C-16552)",
  "SRS College of Engineering & Technology (Id: C-36932)",
  "SSM College of Engineering (Id: C-37002)",
  "SSM INSTITUTE OF ENGINEERING AND TECHNOLOGY, DINDIGUL (Id: C-45320)",
  "SSM School of Management and Computer Applications (Id: C-36936)",
  "St.Anne's College of Engineering and Technology (Id: C-25062)",
  "Star Lion College of Engineering and Technology (New) (Id: C-25016)",
  "St. Johns College of Engineering & Technology for Women (Id: C-16579)",
  "St. Joseph College of Engineering (Id: C-16549)",
  "St. Josephs College of Engineering (Id: C-16537)",
  "St.Joseph's College of Engineering and Technology (Id: C-25022)",
  "St. Michael College of Engineering and Technology, Kalayarkoil, Sivagangai Dist (Id: C-26808)",
  "St. Mother Theresa Engineering College (Id: C-27071)",
  "St Peter's College of Engineering and Technology (Id: C-16511)",
  "St.Xavier' Catholic College of Engineering (Id: C-27077)",
  "Sudharsan Engineering College (Id: C-24990)",
  "SUGUNA COLLEGE OF ENGINEERING (Id: C-48263)",
  "Sun College of Engineering and Technology (Id: C-27065)",
  "SUREYA COLLEGE OF ENGINEERING (Id: C-48281)",
  "Surya College of Engineering and Technology (Id: C-16563)",
  "Surya Engineering College (Id: C-36927)",
  "Surya Institute of Management Studies (Id: C-16471)",
  "S.Veerasamy Chettiar College of Engineering (Id: C-27063)",
  "SVS College Of Engineering (Id: C-37084)",
  "SVS Institute of Computer Applications (Id: C-37060)",
  "SVS Institute of Management Studies (Id: C-36968)",
  "SVS School of Architecture (Id: C-37078)",
  "Syed Ammal Engineering College, Lanthai, Ramanathapuram Dist (Id: C-26807)",
  "Tagore Engineering College (Id: C-16541)",
  "Tagore Institute of Engineering and Technology (Id: C-37029)",
  "Tamilnadu College of Engineering (Id: C-37010)",
  "Tamilnadu School of Architecture (Id: C-37030)",
  "Tamizhan College of Engineering and Technology (Id: C-27047)",
  "Tejaa Shakthi Institute of Technology for Women (Id: C-37012)",
  "THAMIRABHARANI ENGINEERING COLLEGE, TIRUNELVELI (Id: C-45261)",
  "Thangavelu Engineering College (Id: C-16530)",
  "THANTHAI PERIYAR GOVERNMENT INSTITUTE OF TECHNOLOGY (Id: C-48283)",
  "The Kavery College of Engineering (Id: C-37040)",
  "The Kavery Engineering College (Id: C-36948)",
  "The New Royal College of Engineering and Technology (Id: C-16500)",
  "Theni Kamavar Sangam College of Technology, Theni (Id: C-26802)",
  "The Rajaas Engineering Colleges (Id: C-27069)",
  "Thiagarajar College of Engineering, Madurai (Id: C-26794)",
  "Thirumalai Engineering College (Id: C-16513)",
  "Thiruvalluvar College of Engineering and Technology (Id: C-16507)",
  "T.J. Institute of Technology (Id: C-16617)",
  "T.J.S. Engineering College (Id: C-16619)",
  "Trichy Engineering College (Id: C-24991)",
  "TRP Engineering College (New) (Id: C-25028)",
  "T.S.M. Jain College of Technology (Id: C-16559)",
  "Udaya School of Engineerings (Id: C-27044)",
  "Ultra College of Engineering and Technology for Women, Madurai (Id: C-26813)",
  "United Institute of Technology (Id: C-36990)",
  "UNIVERSAL COLLEGE OF ENGINEERING TECHNOLOGY, TIRUNELVELI (Id: C-45260)",
  "University College of Engineering Arni (Id: C-16472)",
  "University College of Engineering Kancheepuram (Id: C-16461)",
  "University College of Engineering Nagercoil (Id: C-27035)",
  "University College of Engineering Tindivanam (Id: C-16598)",
  "University College of Engineering Villupuram (Id: C-16587)",
  "University Departments of Anna University of Technology Tirunelveli (Id: C-27033)",
  "University V.O.Chidambaranar College of Engineering Tuticorin (Id: C-27060)",
  "Unnamalai Institute of Technology (Id: C-27068)",
  "VAIGAI COLLEGE OF ENGINEERING (Id: C-48272)",
  "Valliammai Engineering College (Id: C-16624)",
  "Vandayar Engineering College (Id: C-25041)",
  "Varuvan Vadivelan Institute of Technology (Id: C-37092)",
  "Vasavi Vidya Trust Group of Institutions Faculty of MBA (Id: C-36949)",
  "VEDHANTHA INSTITUTE OF TECHNOLOGY (Id: C-48253)",
  "Velalar College of Engineering and Technology (Id: C-37094)",
  "Velammal College of Engineering & Technology, Madurai (Id: C-26781)",
  "Velammal Engineering College (Id: C-16535)",
  "Velammal Institute of Technology (Id: C-16550)",
  "Vels Srinivasa College of Engineering and Technology (Id: C-16570)",
  "Vel Tech (Id: C-16534)",
  "Vel Tech High Tech Dr.Rangarajan Dr.Sakunthala Engineering College (Id: C-16616)",
  "Vel Tech Multi Tech Dr. Rangarajan Dr. Sakunthala Engineering College (Id: C-16490)",
  "Vetri Vinayaha College of Engineering and Technology (Id: C-25026)",
  "Vickram College of Engineering, Madurai Sivagangai Road, Enathi (Id: C-26777)",
  "VIDHYA MANDHIR INSTITUTE OF TECHNOLOGY, ERODE (Id: C-45290)",
  "Vidyaa Vikas College of Engineering and Technology (Id: C-37047)",
  "Vi Institute of Technology (Id: C-16568)",
  "Vijay Institute of Management, Dindigul (Id: C-26776)",
  "Vins Christian College of Engineering (Id: C-27032)",
  "Vins Christian Women College of Engineering (Id: C-27036)",
  "VIVEKANANDA INSTITUTE OF MANAGEMENT STUDIES (Id: C-48267)",
  "Vivekanandha Business School for Women (Id: C-37034)",
  "Vivekanandha College of Engineering for Women (Id: C-37022)",
  "Vivekanandha College of Technology for Women (Id: C-36943)",
  "Vivekanandha Engineering College for Women (Id: C-36957)",
  "Vivekanandha Institute of Engineering and Technology for Women (Id: C-37018)",
  "Vivekanandha Institute of Information and Management Studies (Id: C-37027)",
  "VKS College of Engineering and Technology (Id: C-37020)",
  "V.P.M.M.Engineering College (Id: C-27078)",
  "VPV COLLEGE OF ENGINEERING, THANEERPANTHAL, THENI (Id: C-45316)",
  "V.R.S. College of Engineering and Technology (Id: C-16516)",
  "VSA Educational and Charitable Trusts Group of Institutions (Id: C-36993)",
  "V.S.B COLLEGE OF ENGINEERING TECHNICAL CAMPUS (Id: C-48266)",
  "V.S.B. Engineering College (Id: C-36944)",
  "V.V.College of Engineering (Id: C-27074)",
  "Adharsh Vidyalaya College of Arts and Science for Women (Id: C-41066)",
  "A.G. Arts and Science College (Id: C-41111)",
  "Air Force Administrative College (Id: C-41053)",
  "AJK College of Arts and Science (Id: C-41080)",
  "Angappa College of Arts and Science (Id: C-41070)",
  "Ayyan Thiruvalluvar College of Arts and Science (Id: C-41062)",
  "Bharathiar University Arts and science College (Id: C-41114)",
  "Bharathiar University Arts and Science College (Id: C-41041)",
  "Bharathiar University College of Arts and Science (Id: C-41117)",
  "Bharathidasan College of Arts and Science (Id: C-41071)",
  "Bharathidasan School of Business (Id: C-41109)",
  "Bharathidasan School of Computer Application (Id: C-41055)",
  "Bishop Ambrose College (Id: C-41136)",
  "Bishop Appasamy College of Arts and Science (Id: C-41075)",
  "Bishop Thorp College (Id: C-41135)",
  "CBM College (Id: C-41095)",
  "Cherraan's Arts, Science College (Id: C-41061)",
  "Cherran College for Women (Id: C-41057)",
  "Chikkaiah Naicker College (Id: C-41113)",
  "Chikkanna Govt Arts College (Id: C-41036)",
  "CMS Academy of Management and Technology (Id: C-41132)",
  "CMS College of Science and Commerce (Id: C-41096)",
  "CMS Institute of Management Studies (Id: C-41065)",
  "Coimbatore Institute of Management and Technology (Id: C-41090)",
  "D.J.Academy for Managerial Excellence (Id: C-41107)",
  "Dr.G.R.Damodaran College of Science (Id: C-41044)",
  "Dr.N.G.P. Arts and Science College (Id: C-41054)",
  "Dr.R.A.N.M. Arts and Science College (Id: C-41139)",
  "Dr.R.V.Arts and Science College (Id: C-41099)",
  "Dr.S.N.S.Rajalakshmi College of Arts and Science (Id: C-41042)",
  "Emerald Heights College (Id: C-41043)",
  "Erode Arts and Science College (Id: C-41128)",
  "Erode Christian College of Arts and Science for Women (Id: C-41067)",
  "Gobi Arts & Science College (Id: C-41138)",
  "Government Arts College, Coimbatore (Id: C-41035)",
  "Government Arts College, Nilgiris (Id: C-41060)",
  "Government Arts College, Tiruppur (Id: C-41110)",
  "G.R.Damodaran Academy of Management (Id: C-41088)",
  "Guruvayurappan Institute of Management (Id: C-41103)",
  "Hindusthan College of Arts and Science (Id: C-41049)",
  "Jansons School of Business (Id: C-41048)",
  "Kaamadhenu Arts and Science College (Id: C-41098)",
  "Kamalam College of Arts and Science (Id: C-41102)",
  "Kamban College of Arts and Science (Id: C-41047)",
  "Karuppannan Mariappan College (Id: C-41084)",
  "Kaypeeyes College of Arts and Science (Id: C-41119)",
  "K.G. College of Arts and Science (Id: C-41125)",
  "KGISL Institute of Information Management (Id: C-41127)",
  "Kongu Arts and Science College (Id: C-41104)",
  "Kongunadu Arts and Science College (Id: C-41106)",
  "Kovai Kalaimagal College of Arts and Science (Id: C-41034)",
  "K.S.G. College of Arts and Science (Id: C-41058)",
  "Lakshmi Narayana Visalakshi College of Arts and Science (Id: C-41108)",
  "LRG Government Arts College for Women (Id: C-41050)",
  "Maharaja Arts and Science College (Id: C-41118)",
  "Maharaja Co-Education Arts and Science College (Id: C-41122)",
  "Maharani Arts and Science Women's College (Id: C-41081)",
  "Michael Job College of Arts and Science for Women (Id: C-41123)",
  "Nandha Arts and Science College (Id: C-41120)",
  "Navarasam Arts and Science College For Women (Id: C-41089)",
  "Nehru Arts and Science College (Id: C-41133)",
  "Nehru College of Management (Id: C-41105)",
  "N G M College (Id: C-41073)",
  "NIFT-TEA College of Knitwear Fashion (Id: C-41137)",
  "NILGIRI COLLEGE OF ARTS AND SCIENCE, THE NILGIRIS (Id: C-46609)",
  "Nirmala College for Women (Id: C-41069)",
  "Park's College (Id: C-41072)",
  "Pioneer College of Arts and Science (Id: C-41112)",
  "P K R Arts College for Women (Id: C-41039)",
  "Providence College for Women (Id: C-41087)",
  "PSG College of Arts and Science (Id: C-41124)",
  "PSGR Krishnammal College for Women (Id: C-41046)",
  "Rathinam College of Arts and Science (Id: C-41134)",
  "Rathinavel Subramaniam College (Id: C-41037)",
  "SAN INTERNATIONAL COLLEGE OF ARTS AND SCIENCE, COIMBATORE (Id: C-46608)",
  "Sankara College of Science and Commerce (Id: C-41064)",
  "Saratha College of Arts and Science (Id: C-41091)",
  "Sasuri College of Arts and Science (Id: C-41063)",
  "Shiri Kumaran College of Arts and Science (Id: C-41121)",
  "S.M.S. College of Arts and Science (Id: C-41078)",
  "S N R Sons College (Id: C-41100)",
  "Sree Amman Arts and Science College (Id: C-41086)",
  "Sree Narayana Guru College (Id: C-41130)",
  "Sree Ramu College of Arts and Science (Id: C-41079)",
  "Sree Saraswathi Thiagaraja College (Id: C-41097)",
  "Sri Gee College of Arts and Science (Id: C-41129)",
  "Sri GVG Visalakshi College for Women (Id: C-41052)",
  "Sri Jeyandra Saraswathy Maha Vidyalaya College of Arts & Science (Id: C-41082)",
  "Sri Krishna Arts and Science College (Id: C-41126)",
  "Sri Nehru Maha Vidyalaya College of Arts and Science (Id: C-41040)",
  "Sri Ramakrishna College of Arts and Science for Women (Id: C-41059)",
  "Sri Ramalinga Sowdambigai College of Science and Commerce (Id: C-41115)",
  "Sri Subash Arts and Science College (Id: C-41045)",
  "Sri Vasavi College (Id: C-41092)",
  "SRMV College of Arts and Science (Id: C-41077)",
  "St. Joseph's College for Women (Id: C-41056)",
  "St. Pauls College of Arts and Science for Women (Id: C-41101)",
  "TERF's Academy College of Arts and Science (Id: C-41051)",
  "Texcity Arts and Science College (Id: C-41085)",
  "Thavathiru Santhalinga Adigalar Arts, Science and Tamil College (Id: C-41076)",
  "Tirupur Kumaran College for Women (Id: C-41131)",
  "Vellakoil Arts and Science College (Id: C-41093)",
  "Vellalar College for Women (Id: C-41068)",
  "Vidyasagar College of Arts and Science (Id: C-41074)",
  "VLB Janaki Ammal College of Arts and Science (Id: C-41083)",
  "V.N.Krishnasamy Naidu College of Arts and Science for Women (Id: C-41094)",
  "Wisdom School of Management (Id: C-41038)",
  "Aadhavan Arts and Science College, Alathur Village, Chettiyappatty Panchayat, Manapparai (Tk), Tiruchirappalli - 621 306. (Id: C-35799)",
  "A.A. Government Arts College, Musiri - 621 201. (Id: C-35789)",
  "ABI & ABI College, Vayalur, Thanjavur - 613 003 (Id: C-35891)",
  "Adaikala Matha College, Arun Nagar, Vam, Thanjavur - 613 403. (Id: C-35777)",
  "A.D.M. College for Women, Nagapattinam - 611 001. (Id: C-35805)",
  "Aiman College of Arts & Science for Women, K. Sathanur , Tiruchirappalli - 620 021. (Id: C-35778)",
  "Annai College of Arts & Science, Kumbakonam-612 503. (Id: C-35839)",
  "Annai Vailankanni College of Arts and Science, V.O.C. Nagar, Thanjavur - 613 007. (Id: C-35829)",
  "Annai Women's College, Aurobindo Nagar, TNPL Road, Punnamchathiram, Karur 639 136. (Id: C-35900)",
  "A.R.C. Viswanathan College, Mayiladuthurai, Nagapattinam - 609 003. (Id: C-35894)",
  "Arputha College of Arts & Science, Arputha Nagar, Vamban - 622 303. (Id: C-35852)",
  "Arungarai Amman College of Arts & Science, Chinnatharapuram, Aravakkurichi, Karur - 639 202. (Id: C-35780)",
  "Auxilium College of Arts and Science for Women,Regunathapuram Village,Alangudi Taluk,Pudukkottai District - 622 302. (Id: C-35807)",
  "A.V.C. College, Mannampandal, Mayiladuthurai - 609 305. (Id: C-35865)",
  "A.V.V.M. Sri Pushpam College, Poondi - 613 503. (Id: C-35899)",
  "Best Arts and Science College, 46, Kaivilancherry Road, Thenpathi, Sirkali Taluk, Nagapattinam District-609 111. (Id: C-35811)",
  "Bharath College of Science & Management, South Garden, Thanjavur - 613 007. (Id: C-35896)",
  "Bharathidasan University College, Orathanadu - 614 625 (Id: C-35816)",
  "Bharathidasan University Constituent Arts & Science College (Co-education), Inamkulathur, Tiruchirappalli (Id: C-35898)",
  "Bharathidasan University Constituent Arts & Science College (Co-education), Kaadambadi (Id: C-35785)",
  "Bharathidasan University Constituent College, Lalgudi - 621 601 (Id: C-35806)",
  "Bharathidasan University, Kurumbalur - 621 107 (Id: C-35876)",
  "Bharathidasan University Model College, Aranthangi - 614 616 (Id: C-35855)",
  "Bharathidasan University Model College, Thiruthuraipoondi - 614 713 (Id: C-35817)",
  "Bharathidasan University Model College, Vedaranyam - 614 810 (Id: C-35779)",
  "Bharath Institute Of Catering Technology & Hotel Management , Thanjavur - 613 001 (Id: C-35882)",
  "Bishop Heber College, Tiruchirappalli - 620 017. (Id: C-35825)",
  "Bon Secours College for Women, Vilar Bye pass Road, Thanjavur - 613 006. (Id: C-35782)",
  "Cambridge College of Arts and Science, Vettamangalam, Karur District-639 117. (Id: C-35820)",
  "Cauvery College for Women, Annamalai Nagar, Tiruchirappalli - 620 018. (Id: C-35783)",
  "Cauvery Institute of Technology, 758, South Iyyampatty, Mullur, Pudukkottai - 622 004 (Id: C-35887)",
  "Chettinad College of Arts & Science, Contonment, Tiruchirappalli - 620 001. (Id: C-35857)",
  "Chidambaram Pillai College for Women, Manachanallur, Tiruchirappalli - 621 005. (Id: C-35838)",
  "Christhu Raj College, Panjapur, Edamalaipatti Pudur, Tiruchirappalli - 620 012. (Id: C-35784)",
  "Deen College of Arts and Science, Nidur-Kaduvangudi, Aruvappadi Village, Mayiladuthurai, Nagapattinam (Dt.) - 609 203 (Id: C-35790)",
  "D.G. Government Arts College for Women, Mayiladuthurai - 609 001. (Id: C-35798)",
  "Dhanalakshmi Srinivasan College of Arts & Science for Women, Perambalur - 621 212. (Id: C-35868)",
  "Dharmambal Ramasamy Arts & Science College, Orathanadu T.k.Thanjavur - 614 625. (Id: C-35866)",
  "Dharmapuram Adhinam Arts College, Dharmapuram, Mayiladuthurai - 609 001. (Id: C-35854)",
  "Dr. Nallikuppusamy Arts College, Manakkarambai, Thanjavur - 613 003. (Id: C-35853)",
  "Edayathangudi G.S. Pillai Arts & Science College, Nagapattinam - 611 001. (Id: C-35847)",
  "Elizabeth College of Arts & Science, Annamangalam (Po), Vepanthattai (Tk.) Perambalur - 620 102. (Id: C-35786)",
  "Enathi Rajappa College of Arts & Science, Enathi Post, Pattukkottai - 614 615. (Id: C-35771)",
  "Ganesar Senthamil College of Arts and Science, Melaisivapuri - 622 403. (Id: C-35775)",
  "Government Arts College, Aiyar Malai, Kulithalai, Karur - 639 120 (Id: C-35851)",
  "Government Arts College, Ariyalur - 621 713. (Id: C-35815)",
  "Government Arts College for Women, Pudukkottai - 622 001. (Id: C-35800)",
  "Government Arts College, Karur - 639 005. (Id: C-35892)",
  "Government Arts College, Kumbakonam - 612 001. (Id: C-35848)",
  "Government Arts College, Tiruchirappalli - 620 022. (Id: C-35773)",
  "Government College for Women, Kumbakonam - 612 001. (Id: C-35795)",
  "Government College of Fine Arts, Kumbakonam - 612 001. (Id: C-35841)",
  "Government College of Music, Thiruvaiyaru - 613 204. (Id: C-35769)",
  "H.H. The Rajah's College, Pudukkottai - 622 001. (Id: C-35871)",
  "Holy Cross College, Tiruchirappalli - 620 002. (Id: C-35787)",
  "Idhaya College of Women, Sakkottai, Kumbakonam 612 001. (Id: C-35802)",
  "Imayam College of Arts & Science, Thuraiyur- 621 206. (Id: C-35834)",
  "Islahiya Arabic College, Anbu Nagar, Airport, Tiruchirappalli - 620 007. (Id: C-35808)",
  "Jairams Arts & Science College, NH7, Karur-Madurai By-Pass Road, Aattamparappu, Kakavadi (P.O), Karur - 639 003. (Id: C-35888)",
  "Jamal Mohamed College, Tiruchirappalli - 620 020. (Id: C-35832)",
  "J.J. College of Arts & Science, Namanasamuthiram, Pudukkottai - 622 404. (Id: C-35842)",
  "Kachiyappa Munivar Tamizhiyal Kalloori, Umaiyalpuram Village, Sevanthilingapuram (P.O), Musiri (Tk), Tiruchirappalli (Dt.) - 621 211 (Id: C-35804)",
  "Kalai Kaviri College of Fine Arts, 18 Benwells Road, Tiruchirappalli - 620 001 (Id: C-35869)",
  "Kalaimahal College of Arts and Science, Sembanarkoil, Tharangambadi Taluk, Naagappatinam - 609 309. (Id: C-35801)",
  "Khadir Mohideen College, Adirampattinam - 614 701. (Id: C-35867)",
  "Kongu College of Arts & Science, Deeran Chinnamalai Nagar, Karur - 639 006. (Id: C-35794)",
  "Kundavai Naachiyaar Government College for Women, Thanjavur - 613 007. (Id: C-35814)",
  "Kurinji College of Arts & Science, Green Ways Road, Tiruchirappalli - 620 002. (Id: C-35774)",
  "Mahatma Arts and Science College, Ariyur Village, Iluppur Taluk, Pudukkottai District-622 101. (Id: C-35886)",
  "Maruthu Pandiyar College, Vallam (P.O.), Thanjavur - 613 403. (Id: C-35881)",
  "MASS College of Arts and Science, Kumbakonam. (Id: C-35884)",
  "Meenakshi Chandrasekaran College of Arts & Science, Pattukkottai - 614 601. (Id: C-35781)",
  "Meenakshi Ramasamy Arts and Science College, Udaiyarpalayam, Ariyalur - 621 804. (Id: C-35823)",
  "M.I.E.T. Arts College, Gundur, Tiruchirappalli - 620 007. (Id: C-35792)",
  "Modern Arts and Science College, 35A, Sannathi Street, Jayankondam, - 621 802. (Id: C-35856)",
  "Mother Gnanamma Women's College of Arts and Science, Varadarajanpet, Jeyankondam Taluk, Ariyalur District (Id: C-35880)",
  "Mother Terasa College of Arts and Science, Mettusalai, Veerapatti Village, Illupur Post, Pudukkottai - 622 102. (Id: C-35879)",
  "M.R. Government Arts College, Mannargudi - 614 001. (Id: C-35849)",
  "Naina Mohamed College of Arts & Science, Rajendrapuram, Pudukkottai - 614 624. (Id: C-35858)",
  "National Arts and Science College, Trichy Road, Jayankondam, Ariyalur Dt. 621 802. (Id: C-35844)",
  "National College, Tiruchirappalli - 620 001. (Id: C-35878)",
  "Navalar Na. Mu. Venkatasamy Nattar Thiruvarul Kalloori, Thanjavur - 613 003 (Id: C-35818)",
  "Nehru Memorial College, Puthanampatti - 621 007. (Id: C-35863)",
  "Nethaji Subash Chandra Bose College, Thiruvarur- 614 001. (Id: C-35875)",
  "Paventhar Bharathidasan College of Arts & Science, Pudukkottai - 622 515. (Id: C-35827)",
  "Periyar E.V.R. College, Tiruchirappalli - 620 023. (Id: C-35809)",
  "Poompuhar College, Melaiyur - 609 107. (Id: C-35883)",
  "Rabiammal Ahamed Maideen College for Women, Thiruvarur - 610 002. (Id: C-35885)",
  "Rajagiri Dawood Batcha College of Arts & Science, Papanasam, Thanjavur - 614 207. (Id: C-35897)",
  "Rajah's College, Thiruvaiyaru - 613 204. (Id: C-35864)",
  "Rajah Serfoji Government College, Thanjavur - 613 005. (Id: C-35846)",
  "Sadasivam Kathirkamavalli College of Arts and Science, Melavasal, Mannargudi, Thiruvarur District. (Id: C-35843)",
  "Sami Arul Arts & Science College, Sami Arul Nagar, Vallam, Thanjavur - 613 007. (Id: C-35840)",
  "Seethalakshmi Ramaswami College, Tiruchirappalli - 620 002. (Id: C-35889)",
  "Sengamala Thayaar Educational Trust Women's College, Mannargudi - 614 001. (Id: C-35824)",
  "Servite Arts and Science College for Women, Thogaimalai Panchayat, Kaladai Village, Karur Dist. - 621 313 (Id: C-35893)",
  "Shrimati Indira Gandhi College, Tiruchirappalli - 620 002. (Id: C-35828)",
  "Sir Issac Newton Arts & Science College, Pappakoil Village, Anthanapettai (Po), Nagapttinam Dt. - 611 001 (Id: C-35833)",
  "S.K. Arts and Science College, Thamaraipulam, Vedaranyam, 614 809. (Id: C-35836)",
  "S.K.S.S. Arts College, Thiruppanandal - 612 504. (Id: C-35813)",
  "Sri Bharathi Arts and Science College (W), Pudukkottai 622 303. (Id: C-35788)",
  "Srimad Andavan Arts & Science College, Thiruvanaikoil, Tiruchirappalli - 620 005. (Id: C-35810)",
  "Srinivasan College of Arts and Science, Perambalur - 621 212. (Id: C-35872)",
  "Sri Pushpam Institute of Vocational Education and Training, 13 V.O.C. Nagar, First Street, Thanjavur - 613 007 (Id: C-35819)",
  "Sri Renganatha Paduka Vidyalaya, Tiruchirappalli - 620 006 (Id: C-35797)",
  "Sri Sankara Arts and Science College, Neelathanallur Road, Asur, Kumbakonam, 612 501 (Id: C-35831)",
  "Sri Sankara School of Management & Computer Science, Tiruchirappalli - 620 009 (Id: C-35874)",
  "Sri Sarada Niketan College of Science for Women, Karur - 639 005. (Id: C-35837)",
  "Sri Saradha College for Women, Perambalur - 621 212. (Id: C-35767)",
  "Sri Suba Bharathi Arts and Science College (Co-Educational), Alangudi, Pudukkottai Dt. - 622 301. (Id: C-35835)",
  "Sri Venkateshwara College of Arts & Science, Peravurani - 614 804. (Id: C-35859)",
  "St. Joseph's College, Tiruchirappalli - 620 002. (Id: C-35860)",
  "Subashkathi Arts and Science College for Women, Kulithalai - 639 120. (Id: C-35850)",
  "Sudharsan College of Arts Science, Perumanadu Village, Iluppur Taluk,Pudukkottai - 622 104. (Id: C-35796)",
  "Sulthana Abdullah Rowther College for Women, Thiruvarur - 614 101. (Id: C-35812)",
  "Swami Dayananda College of Arts & Science, Tiruvarur - 612 610. (Id: C-35776)",
  "Tamilavel Umamaheswaranar Karanthai Arts College, Thanjavur - 613 002. (Id: C-35845)",
  "T.B.M.L. College, Porayar - 609 307. (Id: C-35877)",
  "Thanthai Hans Roever College, Perambalur - 621 212. (Id: C-35768)",
  "Thiru. Vi. Ka. Government Arts College, Thiruvarur - 610 003. (Id: C-35822)",
  "Urumu Dhanalakshmi College, Tiruchirappalli - 620 019. (Id: C-35895)",
  "Uswathun Hasana Oriental Arabic College, Pallapatti - 639 205 (Id: C-35870)",
  "Valluvar College of Science and Management, Kodaiyur, Aravakurichi Taluk, Karur - 639 003 (Id: C-35803)",
  "Vivekananda Arts and Science College for Women, Thenpathi, NSB Nagar, Sirkali Taluk, Nagapattinam - 609 111. (Id: C-35793)",
  "Chettinad College of Nursing (Id: C-7048)",
  "Chettinad Hospital and Research Institute (Id: C-7049)",
  "Institute of Forest Genetics & Tree Breeding (Id: C-44356)",
  "Indira Gandhi Centre for Atomic Research (IGCAR), Kalpakkam (Id: C-39255)",
  "The Institute of Mathematical Sciences (IMSc),chennai (Id: C-39252)",
  "INDIAN STATISTICAL INSTITUTE, CHENNAI (Id: C-47464)",
  "JSS College of Pharmacy (Id: C-35006)",
  "ALPHA ARTS AND SCIENCE COLLEGE (Id: C-43912)",
  "AMIRTHAM INSTITUTE OF MANAGEMENT STUDIES (Id: C-43905)",
  "AM JAIN COLLEGE (Id: C-44012)",
  "ANNA ADARSH COLLEGE FOR WOMEN (Id: C-43911)",
  "ANNAI THERESA ARTS AND SCIENCE COLLEGE (Id: C-44015)",
  "ANNAI VEILANKANNIS COLLEGE OF ARTS AND SCIENCE (Id: C-44007)",
  "ANNAI VIOLET COLLEGE FOR WOMEN (Id: C-43956)",
  "APOLLO ARTS AND SCIENCE COLLEGE (Id: C-43928)",
  "ARINGAR ANNA INSTITUTE OF MANAGEMENT STUDIES AND COMPUTER APPLICATION (Id: C-43993)",
  "ASAN MEMORIAL COLLEGE OF ARTS AND SCIENCE (Id: C-43997)",
  "BHAKTHAVATCHALAM MEMORIAL COLLEGE (Id: C-43953)",
  "BHARATHI WOMENS COLLEGE (Id: C-43937)",
  "CHELLAMMAL WOMENS COLLEGE (Id: C-43980)",
  "CHENNAI NATIONAL ARTS AND SCIENCE COLLEGE (Id: C-43930)",
  "CHEVALIER T THOMAS ELIZABETH COLLEGE FOR WOMEN (Id: C-44011)",
  "CHRIST ARTS AND SCIENCE COLLEGE (Id: C-43957)",
  "C KANDASWAMY COLLEGE FOR MEN (Id: C-43985)",
  "CSI EWARTS WOMENS CHRISTIAN COLLEGE (Id: C-44000)",
  "DB JAIN COLLEGE (Id: C-44001)",
  "DG VAISHNAV COLLEGE (Id: C-43968)",
  "DR AMBEDKAR GOVT ARTS COLLEGE (Id: C-43981)",
  "DRBCCC HINDU COLLEGE (Id: C-43903)",
  "DR MGR JANAKI COLLEGE OF ARTS AND SCIENCE (Id: C-43989)",
  "DR SIR AL MUDALIAR VOCATIONAL ARTS AND SCIENCE COLLEGE (Id: C-43929)",
  "ES SUBRAMANIAM MEMORIAL COLLEGE OF ARTS AND SCIENCE (Id: C-43908)",
  "ETHIRAJ COLLEGE FOR WOMEN (Id: C-43902)",
  "GAC FOR MEN (Id: C-43906)",
  "GOVERNMENT COLLEGE OF ARTS AND CRAFTS (Id: C-44004)",
  "GURU NANAK COLLEGE (Id: C-43998)",
  "GURU SHREE SHANTHI VIJAI JAIN COLLEGE FOR WOMEN (Id: C-43918)",
  "HINDUSTAN COLLEGE OF ARTS AND SCIENCE (Id: C-43900)",
  "INDIRA INSTITUTE OF COMPUTER APPLICATIONS (Id: C-43904)",
  "INDIRA INSTITUTE OF MANAGEMENT AND RESEARCH (Id: C-43970)",
  "INSTITUTE OF ENGINEERING TECHNOLOGY (Id: C-43938)",
  "JAYA COLLEGE OF ARTS AND SCIENCE (Id: C-43973)",
  "JAYAGOVIND HARIGOPAL AGARWAL AGARSEN COLLEGE (Id: C-43950)",
  "JOHN BOSCO ARTS AND SCIENCE COLLEGE (Id: C-43967)",
  "JUSTICE BASHER AHMED SAYEED COLLEGE FOR WOMEN (Id: C-43975)",
  "KANCHI SHRI KRISHNA COLLEGE OF ARTS AND SCIENCE (Id: C-43919)",
  "KCS KASI NADAR COLLEGE OF ARTS AND SCIENCE (Id: C-43983)",
  "KUMARARANI MEENA MUTHIAH COLLEGE OF ARTS AND SCIENCE (Id: C-43940)",
  "L N GOVT COLLEGE (Id: C-43994)",
  "LOYOLA COLLEGE (Id: C-44006)",
  "MADHA ARTS AND SCIENCE COLLEGE (Id: C-43898)",
  "MADRAS CHRISTIAN COLLEGE (Id: C-43965)",
  "MADRAS SCHOOL OF SOCIAL WORK (Id: C-43964)",
  "MAHALAKSHMI COLLEGE OF ARTS AND SCIENCE (Id: C-43947)",
  "MALOLAN COLLEGE OF ARTS AND SCIENCE (Id: C-43990)",
  "MAR GREGORIOS COLLEGE (Id: C-43926)",
  "MD SATHAK COLLEGE OF ARTS AND SCIENCE (Id: C-43922)",
  "MEASI INSTITUTE OF INFORMATION TECHNOLOGY (Id: C-43952)",
  "MEASI INSTITUTE OF MANAGEMENT (Id: C-43955)",
  "MEENAKSHI AMMAL ARTS AND SCIENCE COLLEGE (Id: C-43986)",
  "MEENAKSHI COLLEGE FOR WOMEN (Id: C-43988)",
  "MOP VAISHNAV COLLEGE FOR WOMEN (Id: C-43917)",
  "NATESAN INSTITUTE OF CO-OPERATIVE MANAGEMENT (Id: C-43991)",
  "NATIONAL INSTITUTE OF MANAGEMENT STUDIES (Id: C-43945)",
  "NATIONAL INSTITUTE OF TECHNICAL TEACHERS TRAINING AND RESEARCH, CHENNAI (Id: C-49464)",
  "NAZARETH COLLEGE OF ARTS AND SCIENCE (Id: C-43897)",
  "NEW COLLEGE (Id: C-43948)",
  "NEW PRINCE SHRI BHAVANI ARTS AND SCIENCE COLLEGE (Id: C-43995)",
  "PACHAIYAPPAS COLLEGE CHENNAI (Id: C-43916)",
  "PACHAIYAPPAS COLLEGE FOR MEN (Id: C-44005)",
  "PACHAIYAPPAS COLLEGE FOR WOMEN (Id: C-44009)",
  "PATRICIAN COLLEGE OF ARTS AND SCIENCE (Id: C-43907)",
  "PATTAMMAL ALAGESAN COLLEGE OF ARTS AND SCIENCE (Id: C-43944)",
  "PRESIDENCY COLLEGE (Id: C-43921)",
  "PRINCE SHRI VENKATESHWARA ARTS AND SCIENCE COLLEGE (Id: C-44008)",
  "PROF DHANAPALAN COLLEGE FOR WOMEN (Id: C-43939)",
  "QUAID E MILLETH COLLEGE FOR MEN (Id: C-43982)",
  "QUAID E MILLETH GOVT COLLEGE FOR WOMEN (Id: C-43934)",
  "QUEEN MARYS COLLEGE (Id: C-43927)",
  "RAJESWARI VEDACHALAM GOVT ARTS COLLEGE (Id: C-43901)",
  "RAMAKRISHNA MISSION VIVEKANANDA COLLEGE (Id: C-43923)",
  "RB GOTHI JAIN COLLEGE FOR WOMEN (Id: C-43896)",
  "SANTHOSHI ARTS AND SCIENCE COLLEGE (Id: C-43974)",
  "SDNB VAISHNAV COLLEGE (Id: C-43959)",
  "SHREE CHANDRAPRABU JAIN COLLEGE (Id: C-43971)",
  "SHRI KRISHNASWAMY COLLEGE FOR WOMEN (Id: C-43978)",
  "SINDHI COLLEGE OF ARTS AND SCIENCE (Id: C-43992)",
  "SIR THEAGARAYA COLLEGE (Id: C-43996)",
  "SIVET COLLEGE (Id: C-43960)",
  "SOKA IKEDA COLLEGE OF ARTS AND SCIENCE FOR WOMEN (Id: C-43949)",
  "SREE MUTHUKUMARASWAMY COLLEGE (Id: C-43963)",
  "SRI AHOBILA MUTH SANSKRIT COLLEGE (Id: C-43984)",
  "SRIDEVI ARTS AND SCIENCE COLLEGE (Id: C-43969)",
  "SRI KANYAKA PARAMESWARI ARTS AND SCIENCE COLLEGE FOR WOMEN (Id: C-43977)",
  "SRI MUTHUKUMARAN ARTS AND SCIENCE COLLEGE (Id: C-43976)",
  "SRIRAM COLLEGE OF ARTS AND SCIENCE (Id: C-43954)",
  "SRI SANKARA COLLEGE OF ARTS AND SCIENCE (Id: C-43987)",
  "SRI SUBRAMANIYA SWAMY GOVT ARTS COLLEGE (Id: C-44010)",
  "SRM ARTS AND SCIENCE COLLEGE (Id: C-43936)",
  "SSKV COLLEGE OF ARTS AND SCIENCE FOR WOMEN (Id: C-43962)",
  "SSS JAIN COLLEGE FOR WOMEN (Id: C-43909)",
  "STELLA MARIS COLLEGE FOR WOMEN (Id: C-43931)",
  "ST JOSEPHS COLLEGE (Id: C-43972)",
  "ST LOUIS COLLEGE FOR THE DEAF (Id: C-43942)",
  "ST MARYS SCHOOL OF MANAGEMENT STUDIES (Id: C-43910)",
  "ST THOMAS COLLEGE OF ARTS AND SCIENCE (Id: C-43913)",
  "TAGORE COLLEGE OF ARTS AND SCIENCE (Id: C-43979)",
  "TAMIL NADU INSTITUTE OF LABOUR STUDIES (Id: C-43899)",
  "THANGAVELU COLLEGE OF SCIENCE AND MANAGEMENT (Id: C-43951)",
  "THE DARUL ULOOM JAMALIA ARABIC COLLEGE (Id: C-43914)",
  "THE MADRAS SANSKRIT COLLEGE AND SSV PATASALA (Id: C-44003)",
  "THIRUMURUGAN ARTS AND SCIENCE COLLEGE (Id: C-43920)",
  "THIRUTHANGAL NADAR COLLEGE (Id: C-43935)",
  "TMG COLLEGE OF ARTS AND SCIENCE (Id: C-43958)",
  "TS NARAYANASWAMI COLLEGE OF ARTS AND SCIENCE (Id: C-43933)",
  "University Of Madras Constituent College - Nemmili (Id: C-43999)",
  "University Of Madras Constituent College - Thiruvottiyur (Id: C-43961)",
  "VALLIAMMAL COLLEGE FOR WOMEN (Id: C-44002)",
  "VEL RANGARAJAN SAKUNTHALA COLLEGE OF MANAGEMENT OF SCIENCE (Id: C-43924)",
  "VEL TECH RANGA SANKU ARTS COLLEGE (Id: C-44013)",
  "VIDHYA SAGAR WOMENS COLLEGE (Id: C-43932)",
  "WOMENS CHRISTIAN COLLEGE (Id: C-43946)",
  "A.K.C. COLLEGE OF ARTS & SCIENCE (Id: C-36543)",
  "A.K.D. DHARMARAJA COLLEGE FOR WOMEN (Id: C-36531)",
  "AKILIKA HERBAL INSTITUTE (Id: C-36528)",
  "AMBIGA COLLEGE OF ARTS & SCIENCE (Id: C-36491)",
  "AMMAN COLLEGE OF ARTS & SCIENCE (Id: C-36583)",
  "ANNAI FATIMA COLLEGE OF ARTS & SCIENCE (Id: C-36493)",
  "ANNAI FATIMA INSTITUTE OF CATERING TECHNOLOGY (Id: C-36509)",
  "ANUGRAHA INSTITUTE OF SOCIAL SCIENCES, DINDIGUL (Id: C-45941)",
  "A.P.A. COLLEGE OF ARTS & CULTURE (Id: C-36569)",
  "ARUL ANANDAR COLLEGE (Id: C-36571)",
  "AYYA NADAR JANAKI AMMAL COLLEGE (Id: C-36579)",
  "COLLEGE OF GANDHIAN THOUGHT (Id: C-36535)",
  "C.P.A. COLLEGE (Id: C-36486)",
  "C.S.I. COLLEGE OF ARTS & SCIENCE FOR WOMEN (Id: C-36584)",
  "DEVANGA ARTS COLLEGE (Id: C-36498)",
  "E.M.G. YADAVA WOMEN'S COLLEGE (Id: C-36514)",
  "FATIMA COLLEGE (Id: C-36529)",
  "GOVERNMENT ARTS COLLEGE (Id: C-36524)",
  "G.T.N. ARTS COLLEGE (Id: C-36527)",
  "H.K.R.H.COLLEGE (Id: C-36545)",
  "INSTITUTE OF CO-OPERAGIVE MANAGEMENT (Id: C-36518)",
  "INSTITUTE OF GANDHIAN STSUDIES & RESEARCH (Id: C-36492)",
  "KODAIKANAL CHRISTIAN COLLEGE (Id: C-36505)",
  "K.P. NATIONAL COLLEGE OF ARTS & SCIENCE (Id: C-36566)",
  "LADY DOAK COLLEGE (Id: C-36578)",
  "MADURA COLLEGE (Id: C-36540)",
  "MADURAI GANDHI NMR SUBBARAMAN COLLEGE FOR WOMEN (Id: C-36562)",
  "MADURAI INSTITUTE OF SOCIAL SCIENCE COLLEGE (Id: C-36582)",
  "MADURAI KAMARAJ UNIVERSITY COLLEGE, AUNDIPATTI (Id: C-36507)",
  "MADURAI KAMARAJ UNIVERSITY COLLEGE, SATTUR (Id: C-36525)",
  "MADURAI KAMARAJ UNIVERSITY CONSTITUENT COLLEGE, DINDIGUL (Id: C-45942)",
  "MADURAI KAMARAJ UNIVERSTIY COLLEGE, KOTTUR (Id: C-36539)",
  "MANGAYARKARASI ARTS & SCIENCE COLLEGE FOR WOMEN (Id: C-36572)",
  "MANNAR TIRUMALAI NAICKER COLLEGE (Id: C-36537)",
  "MARY MATHA COLLEGE, MADURAI (Id: C-45945)",
  "MEENAKSHI MISSION HOSPITAL & RESEARCH CENTRE (Id: C-36580)",
  "M.K. UNIVERSITY COLLEGE, ALAGARKOIL ROAD (Id: C-36497)",
  "M.K. UNIVERSITY EVENING COLLEGE, GOVT. HR. SECY. SCHOOL CAMPUS (Id: C-36495)",
  "M.K. UNIVERSITY EVENING COLLEGE, PALANI (Id: C-36490)",
  "M.K. UNIVERSITY EVENING COLLEGE, PERIYAKULAM (Id: C-36534)",
  "M.K. UNIVERSITY EVENING COLLEGE, TELC (Id: C-36581)",
  "M.S.S.WAKF BOARD COLLEGE (Id: C-36573)",
  "NAZIA COLLEGE OF ARTS & SCIENCE (Id: C-36564)",
  "N.M.S. SERMATHAI VASAN COLLEGE FOR WOMEN (Id: C-36558)",
  "N.M.S.S.V.N.COLLEGE (Id: C-36551)",
  "N.P.R. ARTS & SCIENCE COLLEGE (Id: C-36549)",
  "PANNAIKADU VEERAMMAL PARAMASIVAM COLLEGE (Id: C-36546)",
  "PARVATHY ARTS & SCIECNE COLLEGE (Id: C-36559)",
  "PEACE INSTITUTE OF SOCIAL WORK (Id: C-36544)",
  "P.K.N. COLLEGE OF ARTS & SCIENCE (Id: C-36568)",
  "P.M.T. COLLEGE (Id: C-36533)",
  "P.S. MUTHU COLLEGE OF ARTS & SCIENCE (Id: C-36550)",
  "RAJAPALAYAM RAJU'S COLLEGE (Id: C-36542)",
  "RAMA PRABHA COLLEGE OF ARTS & SCIENCE (Id: C-36574)",
  "REV. JACOB MEMORIAL CHRISTIAN COLLEGE (Id: C-36504)",
  "SACRED HEART COLLEGE OF ARTS AND SCIENCE, DINDIGUL (Id: C-45943)",
  "SARASWATHI NARAYANAN COLLEGE (Id: C-36488)",
  "SATHANGAI ACADEMY (Id: C-36496)",
  "S.B.K. COLLEGE (Id: C-36553)",
  "SENTHAMARAI COLLEGE OF ARTS & SCIENCE (Id: C-36555)",
  "SENTHAMIL COLLEGE (Id: C-36512)",
  "SFR COLLEGE FOR WOMEN (Id: C-36548)",
  "S.L.S.M.A.V.M.AYIRA VYSIAR COLLEGE (Id: C-36500)",
  "SOURASHTRA COLLEGE (Id: C-36508)",
  "SOURASHTRA COLLEGE FOR WOMEN (Id: C-36556)",
  "SREE BALAKRISHNA COLLEGE OF ARTS & SCIENCE (Id: C-36511)",
  "SRI HAYAGREEVA ARTS & SCIENCE COLLEGE (Id: C-36510)",
  "SRI KALISWARI COLLEGE (Id: C-36526)",
  "SRI KALISWARI INSTITUTE OF MANAGEMENT AND TECHNOLOGY, VIRUDHUNAGAR (Id: C-45947)",
  "SRI MEENAKSHI GOVERNMENT COLLEGE FOR WOMEN (Id: C-36575)",
  "SRI NAGALAKSHMI AMMAL COLLEGE OF SCIENCES (Id: C-36587)",
  "SRI SAI BHARATH COLLEGE OF ARTS & SCIENCE (Id: C-36565)",
  "SRI SATHGURU SANGEETHA VIDYALAYAM (Id: C-36519)",
  "S.R.NAIDU MEMORIAL COLLEGE (Id: C-36494)",
  "ST. GEORGE JEYARAJ CHELLADURAI COLLEGE FOR WOMEN (Id: C-36501)",
  "SUBBALAKSHMI LAKSHMIPATHI COLLEGE OF SCIENCES (Id: C-36530)",
  "SUBRAMANYA COLLEGE OF ARTS & SCIENCE (Id: C-36521)",
  "TAMILNADU THEOLOGICAL SEMINARY (Id: C-36516)",
  "THE AMERICAN COLLEGE (Id: C-36547)",
  "THENI COLLEGE OF ARTS SCIENCE (Id: C-36536)",
  "THENI KAMMAVAR SANGAM COLLEGE OF ARTS & SCIENCE (Id: C-36576)",
  "THIAGARAJAR COLLEGE (Id: C-36513)",
  "THIAGARAJAR SCHOOL OF MANAGEMENT (Id: C-36557)",
  "THIRUVALLUVAR COLLEGE OF ARTS AND SCIENCE FOR WOMEN, MADURAI (Id: C-45946)",
  "V.H.N.S.N. COLLEGE (Id: C-36502)",
  "VIVEKANANDA COLLEGE (Id: C-36506)",
  "V.PP. MUTHIAH PILLAI MEENAKSHI AMMAL COLLEGE (W) (Id: C-36520)",
  "V.V.V. COLLEGE FOR WOMEN (Id: C-36487)",
  "WASH INSTITUTE (Id: C-36563)",
  "YADAVA COLLEGE (Id: C-36515)",
  "NICE INSTITUTE OF TECHNOLOGY MARTHANDAM (Id: C-31230)",
  "Aditanar College of Arts & Science, Virapandianpattinam, Tiruchendur - 628 216 Thoothukudi District. (Id: C-41202)",
  "Ambai Arts College, Ambasamudram - 627 401, Tirunelveli District. (Id: C-41170)",
  "Annai Hajira Women's College, Melapalayam, Tirunelveli - 627 005. (Id: C-41142)",
  "Annai Velankanni College, Tholayavattam 629 157. Kanyakumari District (Id: C-41148)",
  "A.P.C.Mahalakshmi College, Ettayapuram Road, Tuticorin - 628 002. (Id: C-41140)",
  "Arignar Anna College, Aralvaimoli 629 301 Kanyakumari District (Id: C-41150)",
  "Arulmigu Kumara Gurupara Swamigal Arts College, Padmanabhamangalam P.O, Srivaikuntam, Tuticorin Dist - 628 619. (Id: C-41205)",
  "Arulmigu Pannirupidi Ayyan College of Arts & Science, Vagaikulam, Nanguneri (TK) Tirunelveli Dist - 627 108. (Id: C-41152)",
  "Bishop Caldwell College, Maravanmadam, Tuticorin - 628 101 (Id: C-41161)",
  "C.S.I. Jeyaraj Annapackiam College, Nallur - 627 853, Tirunelveli Dist . (Id: C-41143)",
  "Govindammal Aditanar College, Tiruchendur - 628 215, Tuticorin Dist (Id: C-41176)",
  "Govt. Arts College, Surandai - 627 859 (Id: C-41190)",
  "G.Venkataswamy Naidu College, Kovilpatti - 628 502, Thoothukudi Dist. (Id: C-41187)",
  "Holy Cross College, Nagercoil - 629 004. (Id: C-41177)",
  "Holy Cross Home Science College, 52, New Colony, Tuticorin - 628 003. (Id: C-41174)",
  "J.P. College of Arts and Science, Ayikudy - 627 852, Tenkasi (Id: C-41153)",
  "Kamaraj College, Tiruchendur Road, Tuticorin - 628 003. (Id: C-41209)",
  "K.R.College of Arts & Science, K.R. Nagar, Kovilpatti - 628 503. (Id: C-41203)",
  "Lekshmipuram College of Arts & Science, Neyyoor - 629 802. (Id: C-41164)",
  "Mahatma Gandhi College of Arts & Science, V.R.Naidu Nagar. (Id: C-41159)",
  "Malankara Catholic College, Mariagiri, Kaliakkavillai, Kanyakumari Dist. (Id: C-41165)",
  "Manonmaniam Sundaranar University College, Govindaperi. (Id: C-41194)",
  "Manonmaniam Sundaranar University College, Nagampatti, (Id: C-41196)",
  "Manonmaniam Sundaranar University College, Panakudi (Id: C-41188)",
  "Manonmaniam Sundaranar University College, Puliankudi (Id: C-41181)",
  "Manonmaniam Sundaranar University College, Sankarankovil (Id: C-41182)",
  "Manonmaniam Sundaranar University College, Thisayanvillai (Id: C-41192)",
  "MANONMANIAM SUNDARANAR UNIVERSITY CONSTITUENT COLLEGE, KADAYANALLUR (Id: C-48311)",
  "MANONMANIAM SUNDARANAR UNIVERSITY CONSTITUENT COLLEGE, KANYAKUMARI (Id: C-48312)",
  "Manonmaniam Sundaranar University Constituent College, Nagalapuram, (Id: C-41162)",
  "Manonmaniam Sundaranar University Constituent College, Sattankulam- 628 704, Thoothukudi Dist. (Id: C-41179)",
  "Muslim Arts College, Thiruvithancode - 629 174, Kanyakumari Dist. (Id: C-41210)",
  "NANJIL CATHOLIC COLLEGE OF ARTS AND SCIENCE, KALIYAKKAVILAI (Id: C-48313)",
  "Nazareth Margoschis College, Pillaiyanmanai, Nazareth - 628 617, Thoothukudi Dist (Id: C-41147)",
  "Nesamony Memorial Christian College, Marthandam - 629 165, Kanyakumari Dist. (Id: C-41154)",
  "Noorul Islam College of Arts & Science, Kumaracoil, Thuckalay 629 175, Nagercoil. (Id: C-41197)",
  "Perarignar Anna Science College, Dharugapuram, Sivagiri (TK) Tirunelveli - 627 755. (Id: C-41156)",
  "Pioneer Kumaraswamy College, Vettoornimadam, Nagercoil - 629 003. (Id: C-41167)",
  "P.M.T. College, Melaneelithanallur, Sankarankoil- 627 755. (Id: C-41155)",
  "Pope's College, Sawyerpuram - 628 251 (Id: C-41195)",
  "Rani Anna Government College for Women, Tirunelveli - 627 008 (Id: C-41166)",
  "Rose Mary College of Arts & Science, Nagercoil Road, Muneerpallam Village, Tirunelveli (Id: C-41144)",
  "Sadakathullah Appa College, Rahmath Nagar, Palayamkottai, 627 011 (Id: C-41191)",
  "Sankara Bhagavathi College of Arts & Science College, Kommandikottai - 628 653 (Id: C-41207)",
  "Sarah Tucker College, Perumalpuram, Palayamkottai - 627 011 (Id: C-41180)",
  "Sardar Raja Arts & Science College, Vadakkankulam - 627 116 (Id: C-41172)",
  "Scott Christian College, Nagercoil - 629 003 (Id: C-41189)",
  "Sivanthi Aditanar College, Pillayarpuram, Nagercoil - 629 501 (Id: C-41185)",
  "Sree Ayyappa College for Women, Ayyappanagar, Chunkankadai - 629 807, Nagercoil - 629 807 (Id: C-41178)",
  "Sri Devi Kumari Women's College, Kuzhithurai, Kanyakumari Dist (Id: C-41163)",
  "Sri Paramakalyani College, Alwarkurichi - 627 412. (Id: C-41160)",
  "Sri Parasakthi College for Women, Courtallam, Tirunelveli Dist. - 627 802 (Id: C-41199)",
  "Sri Ram Nallamani Yadava College of Arts & Science, Kodikurichi, Tenkasi - 627 804, Tirunelveli Dist (Id: C-41201)",
  "Sri Sarada College for Women, V.M. Chatram, Tirunelveli - 627 011 (Id: C-41149)",
  "S.S.Duraisamy Nadar Mariammal College, Sattur Road, Kovilpatti - 628 501 (Id: C-41145)",
  "S.T.Hindu College, Nagercoil - 629 002 (Id: C-41193)",
  "St.Jerome's College, Allan Street, Asaripallam Road (via) Ananthanadarkudy, Kanyakumari Dist - 629 201 (Id: C-41175)",
  "St.John's College of Arts & Science, Ammandiviali, Kanyakumari Dist - 629 204 (Id: C-41183)",
  "St.John's College, Palayamkottai - 627 002 (Id: C-41200)",
  "St.Jude's College, Thoothoor - 629 176, Kanyakumari Dist (Id: C-41141)",
  "St.Mary's College, North Beach Road, Tuticorin - 628 001 (Id: C-41151)",
  "St.Xavier's College, Palayamkottai - 627 002 (Id: C-41173)",
  "The M.D.T. Hindu College, Pettai, Tirunelveli - 627 008 (Id: C-41206)",
  "Thiruvalluvar College, Papanasam, V.K.Puram - 627 425 (Id: C-41158)",
  "Tirunelveli Dakshina Mara Nadar Sangam College, T.Kallikulam - 627 113, Tirunelveli Dist (Id: C-41208)",
  "Udaya College of Arts and Science, Vellamodi, Ammandivilai Post, K.K. Dist - 629 204 (Id: C-41204)",
  "Vivekananda College, Agastheeswaram - 629 701 (Id: C-41198)",
  "V.O.C. College, Tuticorin - 628 008 (Id: C-41157)",
  "V.T.M. College of Arts and Science, Arumanai - 629 151, Kanyakumari Dist (Id: C-41186)",
  "Wavoo Wajeeha Women's College of Arts & Science, Kayalpatnam, Thoothukudi Dist (Id: C-41146)",
  "Women's Christian College, Nagercoil - 629 001 (Id: C-41184)",
  "Meenakshi Ammal Dental College, Maduravoyal, Chennai (Id: C-36316)",
  "Meenakshi College of Nursing, Mangadu, Chennai (Id: C-36319)",
  "Meenakshi College of Physiotherapy, Chennai (Id: C-36317)",
  "Meenakshi Medical College and Research Institute, Enathurm Kanchipuram (Id: C-36318)",
  "Dr. M.G.R. Engineering and College (Id: C-36462)",
  "Thai Moogambigai Dental College and Hospital (Id: C-36463)",
  "Arulmigu Palaniandavar Arts College for Women, Palani (Id: C-17074)",
  "Govt., Arts College for Women, Nilakottai (Id: C-17042)",
  "Jeyaraj Annapackiyam College for Women, Periyakulam (Id: C-17047)",
  "Mother Teresa Women's University College,Kodaikanal (Id: C-17056)",
  "M.V.M.Govt.,Arts College for Women, Dindigul (Id: C-17078)",
  "Nadar Saraswathi College of Arts and Science, Theni (Id: C-17052)",
  "Sakthi College of Arts and Science for Women, Oddanchatram (Id: C-17072)",
  "Sri Adichunchanagiri women's college, Cumbum (Id: C-17037)",
  "St. Antony's College for Arts and Science for Women,Thamaraipadi (Id: C-17046)",
  "THIRAVIAM COLLEGE OF ARTS & SCIENCE FOR WOMEN, PERIYAKULAM (Id: C-47864)",
  "Women's University College of Education,Kodaikanal (Id: C-26531)",
  "Central Sericulture Germplasm resourcesv Centre ,Central Silk Board Ministry of Textilies ,Govt of India Thally Road Hosur Krishnagiri Dist Tamilnadu (Id: C-17435)",
  "NATIONAL INSTITUTE OF FASHION TECHNOLOGY, CHENNAI (Id: C-47470)",
  "ADHIYAMAN ARTS AND SCIENCE COLLEGE FOR WOMEN, SRINIVASA NAGAR (Id: C-47500)",
  "AET Arts & Science College (Id: C-9504)",
  "Anbu Arts & Science College (Id: C-9491)",
  "Annai Arts & Science College (Id: C-9511)",
  "Annai Terasa Arts & Science College (Id: C-9546)",
  "Arignar Anna College (Arts & Science) (Id: C-9544)",
  "Arignar Anna Government Arts College (Id: C-9542)",
  "Arignar Anna Government Arts College1 (Id: C-9543)",
  "A.V.S College of Arts & Science (Id: C-9550)",
  "Bharathiyar Arts & Science College (W) (Id: C-9516)",
  "Biogeneric Institute of Biotechnology (Id: C-9493)",
  "Biomedical Engineering Research Foundation (Id: C-9489)",
  "Chenneys Institute of Hotel Management (Id: C-9558)",
  "Don Bosco College of Arts and Science (Id: C-9536)",
  "ERK College of Arts & Science (Id: C-9519)",
  "Gem Gates Arts & Science College (Id: C-9565)",
  "Gonzga College of Arts & Science for women (Id: C-9523)",
  "Government Arts College (Id: C-9517)",
  "Government Arts College (Id: C-9515)",
  "Government Arts College for Men (Id: C-9526)",
  "Government Arts College for Women (Id: C-9510)",
  "Government Arts College for Women (Id: C-9554)",
  "Government Arts & Science College (W) (Id: C-9560)",
  "Harur Muthu Arts & Science College for Women (Id: C-9502)",
  "Jairam Arts & Science College (Id: C-9535)",
  "Jai Shree Venkateswara College of Arts & Science (Id: C-9551)",
  "J.K.K Nataraja College of Arts & Science (Id: C-9494)",
  "Kailash Womens College (Id: C-9553)",
  "Kamadhenu College of Arts & Science (Id: C-9483)",
  "Kandaswami Kandars College (Id: C-9492)",
  "King College of Arts & Science for Women (Id: C-9524)",
  "KRISHNA ARTS AND SCIENCE COLLEGE, KATTINAYANAPALLI (Id: C-47501)",
  "K.S.R Arts & Science College (Autonomous) (Id: C-9528)",
  "K.S.R. College of Arts & Science for Women (Id: C-9531)",
  "Kuwaiti American center of Education,kuwaiti (Id: C-9563)",
  "Laxminarayana Arts & Science College for Womwen (Id: C-9537)",
  "Mahendra Arts & Science college (Id: C-9562)",
  "M.G.R College (Id: C-9539)",
  "Minerva College of Arts & Science (Id: C-9495)",
  "Morappur Kongu Arts & Science College (Id: C-9555)",
  "Muthayammal College of Arts & Science (Id: C-9490)",
  "NKR Government Arts College for Women (Id: C-9567)",
  "Paavendar College of Arts & Science (Id: C-9508)",
  "Pachamuthu College of Arts & Science for Women (Id: C-9534)",
  "Padmavani Arts & Science College for (W) (Id: C-9530)",
  "Pannai International Institute of Hotel Management and catering Technology (Id: C-9512)",
  "Pavai Arts & Science College for Women (Id: C-9506)",
  "PEE GEE College of Arts & Science (Id: C-9569)",
  "PERIYAR UNIVERSITY COLLEGE OF ARTS AND SCIENCE, IDAPPADI (Id: C-47502)",
  "Periyar University College of Arts & Science,harur (Id: C-9499)",
  "Periyar University College of Arts & Science,mettur (Id: C-9566)",
  "Periyar University College of Arts & Science,pappirettipatty (Id: C-9507)",
  "Periyar University College of Arts & Science,pennagaram (Id: C-9501)",
  "PERIYAR UNIVERSITY PG EXT CENTRE GOVERNMENT ARTS COLLEGE CAMPUS (Id: C-47505)",
  "P.G.P College of Arts & Science (Id: C-9547)",
  "PMP College of Arts & Seience (Id: C-9525)",
  "Premier Institute of Apparel Management (Id: C-9497)",
  "REEP Educational Institutions (Id: C-9521)",
  "ROYAL COLLEGE OF ARTS AND SCIENCE, MASILAPALAYAM (Id: C-47503)",
  "Salem Christian College of Arts & Science (Id: C-9556)",
  "Salem Kongunadu Arts & Science (Id: C-9520)",
  "Salem Sowdeswari College (Id: C-9548)",
  "Salem Sowdeswari Institute of Management studies (Id: C-9513)",
  "Selvam Arts & Science college (Id: C-9522)",
  "Sengunthar Arts & Science College (Id: C-9505)",
  "SHEVAROYS COLLEGE OF ARTS AND SCIENCE, YERCAUD (Id: C-47504)",
  "Shevaroys College of Hotel Managemnt & Catering Technology (Id: C-9484)",
  "Siri PSG Arts & Science College for Women (Id: C-9509)",
  "Sivagamiammal College of Arts & Science (Id: C-9500)",
  "Sri Balamurugan College of Arts & science (Id: C-9549)",
  "Sri Ganesh College of Arts & Science (Id: C-9559)",
  "Sri Ganesh college of catering and hotel management (Id: C-9486)",
  "Sri Kandhan College of Arts & Science (Id: C-9527)",
  "Sri Sakthikailash College for Women (Id: C-9532)",
  "Sri Sarada College for Women(Autonomous) (Id: C-9552)",
  "Sri Sarada Nicketan College of Arts & Science for Women (Id: C-9538)",
  "Sri Venkateswara College of Arts & Science (Id: C-9541)",
  "Sri Vidhya Mandir Arts & Science College (Id: C-9545)",
  "Sri Vidhya Mandir College of Arts & Science (Id: C-9568)",
  "Sri Vijay Vidyalaya College of Arts and Science (Id: C-9564)",
  "SSM academy (Id: C-9561)",
  "SSM College of Arts & Science (Id: C-9540)",
  "St.Josephs College of Arts & Science for (W) (Id: C-9529)",
  "Subramaniam Arts & Science College (Id: C-9503)",
  "Thiruvalluvar Government Arts College (Id: C-9557)",
  "Trinity College for Women (Id: C-9496)",
  "Vidhyaa Arts & Science College (Id: C-9514)",
  "Viswha Bharathi Arts & Science College (Id: C-9533)",
  "Vivekanandha College for Women (Id: C-9518)",
  "Vivekanandha College of Arts & Science (W) (Id: C-9488)",
  "Vysya College (Id: C-9498)",
  "Frontline Lifeline Hospital & Dr. K.M. Cherian Foundation (Id: C-6538)",
  "PONNAIYAH RAMAJAYAM INSTITUTE OF SCIENCE AND TECHNOLOGY, CHENNAI -600006 (Id: C-31056)",
  "PONNAIYAH RAMAJAYAM INSTITUTE OF SCIENCE AND TECHNOLOGY, KUMBAKONAM-612 501 (Id: C-31055)",
  "PONNAIYAH RAMAJAYAM INSTITUTE OF SCIENCE AND TECHNOLOGY, TIRUCHIRAPPALLI - 620 009 (Id: C-31058)",
  "SoRSPE, Ramakrishna Mission Vivekananda University (Id: C-35003)",
  "Saveetha College of Nursing (Id: C-16283)",
  "Saveetha College of Physiotheraphy (Id: C-16286)",
  "Saveetha Dental College (Id: C-16285)",
  "Saveetha Medical College (Id: C-16281)",
  "Saveetha School of Engineering (Id: C-16287)",
  "Saveetha School of Law (Id: C-16282)",
  "Saveetha School of Management (Id: C-16284)",
  "SRINIVASA RAMANUJAN CENTRE (Id: C-44817)",
  "Christian Medical College, Vellore (Id: C-33025)",
  "National Institute of Epidemiology, Chennai (Id: C-33026)",
  "SHRI SATHYA SAI MEDICAL COLLEGE AND RESEARCH INSTITUTE (Id: C-47765)",
  "Sri Ramachandra College of Allied Health Sciences (Id: C-35712)",
  "Sri Ramachandra College of Biomedical Sciences, Technology & Research (Id: C-35714)",
  "Sri Ramachandra College of Management (Id: C-35710)",
  "Sri Ramachandra College of Nursing (Id: C-35708)",
  "Sri Ramachandra College of Pharmacy (Id: C-35709)",
  "Sri Ramachandra College of Physiotherapy (Id: C-35713)",
  "Sri Ramachandra Dental College & Hospital (Id: C-35711)",
  "Sri Ramachandra Medical College and Research Institute (Id: C-35707)",
  "ADHIPARASAKTHI AGRICULTURAL COLLEGE, VELLORE (Id: C-45373)",
  "Agricultural College and Research Institute, Coimbatore (Id: C-44926)",
  "Agricultural College and Research Institute, Madurai (Id: C-44925)",
  "Agricultural College and Research Institute, Thoothukkudi (Id: C-44918)",
  "Agricultural Engineering College and Research Institute, Coimbatore (Id: C-44924)",
  "Agricultural Engineering College and Research Institute, Tiruchirappalli (Id: C-44929)",
  "Anbil Dharmalingam Agricultural College and Research Institute (Id: C-44927)",
  "COLLEGE OF AGRICULTURAL TECHNOLOGY, THENI (Id: C-45374)",
  "Forest College and Research Institute (Id: C-44920)",
  "Home Science College and Research Institute (Id: C-44921)",
  "Horticultural College and Research Institute, Coimbatore (Id: C-44923)",
  "Horticultural College and Research Institute for Women (Id: C-44928)",
  "Horticultural College and Research Institute, Theni (Id: C-44922)",
  "INDIAN INSTITUTE OF CROP PROCESSING TECHNOLOGY, THANJAVUR (Id: C-45375)",
  "School of Postgraduate Studies, Coimbatore (Id: C-44919)",
  "THANTHAI ROEVER INSTITUTE OF AGRICULTURE AND RURAL DEVELOPMENT, PERAMBALUR (Id: C-45372)",
  "VANAVARAYAR INSTITUTE OF AGRICULTURE, COIMBATORE (Id: C-45371)",
  "Dr Ambedkar Govt Law College (Id: C-39278)",
  "Government Law College, Chengalpattu (Id: C-39281)",
  "Government Law College, Coimbatore (Id: C-39282)",
  "Government Law College, Madurai (Id: C-39286)",
  "Government Law College, Tirunelveli (Id: C-39283)",
  "Government Law College, Trichy (Id: C-39284)",
  "Government Law College, Vellore (Id: C-39280)",
  "Post Graduate Department and research (Id: C-39285)",
  "Private Law College, Salem (Id: C-39279)",
  "AADHI BHAGAWAN COLLEGE OF PHARMACY, RANTHAM, THIRUVANNAMALAI (Id: C-45798)",
  "ADHIPARASAKTHI COLLEGE OF NURSING, KANCHEEPURAM (Id: C-45601)",
  "ADHIPARASAKTHI COLLEGE OF PHARMACY, KANCHEEPURAM (Id: C-45600)",
  "ADHIPARASAKTHI COLLEGE OF PHYSIOTHERAPY AND PARAMEDICAL SCIENCES, KANCHEEPURAM (Id: C-45602)",
  "ADHIPARASAKTHI DENTAL COLLEGE AND HOSPITAL, KANCHEEPURAM (Id: C-45597)",
  "A.J. COLLEGE OF NURSING, CHENNAI (Id: C-45446)",
  "A.J. COLLEGE OF PHYSIOTHERAPY, CHENNAI (Id: C-45447)",
  "ALADI ARUNA COLLEGE OF NURSING, TIRUNELVELI (Id: C-45675)",
  "AL AMEEN COLLEGE OF NURSING, THIRUVANNAMALAI (Id: C-45774)",
  "AMJ COLLEGE OF NURSING, THIRUVANNAMALAI (Id: C-45727)",
  "ANBU COLLEGE OF NURSING, KUMARAPALAYAM (Id: C-45819)",
  "ANNAI DORA COLLEGE OF NURSING, THENI (Id: C-45720)",
  "ANNAI J.K.K. SAMPOORANI AMMAL COLLEGE OF NURSING, NAMAKKAL (Id: C-45650)",
  "ANNAI J.K.K. SAMPOORANI AMMAL COLLEGE OF PHARMACY, ETHIRUMEDU (Id: C-47862)",
  "ANNAI MEENAKSHI COLLEGE OF NURSING, COIMBATORE (Id: C-45525)",
  "ANNAI TERESA SCHOOL OF NURSING AND PARAMEDICAL SCIENCES, ARIYALUR (Id: C-45800)",
  "ANNAI VEILANKANNIS COLLEGE OF NURSING, CHENNAI (Id: C-45463)",
  "ANNAI VEILANKANNI S PHARMACY COLLEGE, CHENNAI (Id: C-45428)",
  "ANNAMMAL COLLEGE OF NURSING, KANYAKUMARI (Id: C-45629)",
  "ANNAPOORANA MEDICAL COLLEGE AND HOSPITAL, SALEM (Id: C-45704)",
  "ANNASAMY RAJAMMAL COLLEGE OF NURSING, TIRUNELVELI (Id: C-45674)",
  "APOLLO COLLEGE OF NURSING, CHENNAI (Id: C-45432)",
  "APOLLO HOSPITALS, CHENNAI (Id: C-45482)",
  "APOLLO HOSPITALS ENTERPRISES LTD, CHENNAI (Id: C-45471)",
  "ARAVIND EYE HOSPITALAND PG INSTITUTE OF OPHTHAMOLOGY, MADURAI (Id: C-45647)",
  "ARAVIND EYE HOSPITAL, COIMBATORE (Id: C-45568)",
  "ARAVIND EYE HOSPITAL, THENI (Id: C-45719)",
  "ARAVIND EYE HOSPITAL, TIRUNELVELI (Id: C-45679)",
  "ARCOT SRI MAHALAKSHMI WOMEN S COLLEGE OF NURSING, VELLORE (Id: C-45666)",
  "ARTHUR ASIRVATHAM HOSPITAL (563) (Id: C-49062)",
  "ARULMIGU KALASALINGAM COLLEGE OF PHARMACY, VIRUDHUNAGAR (Id: C-45757)",
  "ARUNAI INSTITUTE OF NURSING EDUCATIONAND RESEARCH, THIRUVANNAMALAI (Id: C-45729)",
  "ARUN COLLEGE OF NURSING, VELLORE (Id: C-45665)",
  "ARUN COLLEGE OF PARAMEDICAL SCIENCES, VELLORE (Id: C-45667)",
  "ARVINTH COLLEGE OF NURSING, NAMAKKAL (Id: C-45653)",
  "ASAN MEMORIAL DENTAL COLLEGE AND HOSPITAL, KANCHEEPURAM (Id: C-47563)",
  "A.T.S.V.S. SIDDHA MARUTHUVA KALLOORY AND HOSPITAL, MUNCHIRAI, KANNIYAKUMARI (Id: C-45622)",
  "AYURVEDHA COLLEGE, COIMBATORE (Id: C-45514)",
  "BEST DENTAL SCIENCE COLLEGE, MADURAI (Id: C-45644)",
  "BHAARATH COLLEGE OF NURSING, DINDIGUL (Id: C-45808)",
  "BHARAT SCANS PVT., LTD., CHENNAI (Id: C-45484)",
  "BILROTH COLLEGE OF NURSING, CHENNAI (Id: C-45453)",
  "BISHOP S COLLEGE OF NURSING DHARAPURAM, ERODE (Id: C-45587)",
  "BKR COLLEGE OF NURSING, TIRUVALLUR (Id: C-45771)",
  "CANCER INSTITUTE (W.I.A.), CHENNAI (Id: C-45498)",
  "CANCER INSTITUTE (W.L.A.), ADYAR, CHENNAI (Id: C-45496)",
  "CARE INSTITUTE OF BEHAIRORAL SCIENCES (A UNIT OF CARE, TRICHY), CHENNAI (Id: C-45476)",
  "CET COLLEGE OF NURSING, KANNIYAKUMARI (Id: C-45811)",
  "CHENGALPATTU MEDICAL COLLEGE, KANCHEEPURAM (Id: C-45796)",
  "CHENNAI MEDICAL COLLEGE HOSPITAL AND RESERCH CENTRE, TRICHY (Id: C-45745)",
  "CHERRAAN S COLLEGE OF NURSING, COIMBATORE (Id: C-45519)",
  "CHERRAAN S COLLEGE OF PHARMACY, COIMBATORE (Id: C-45531)",
  "CHERRAAN S COLLEGE OF PHYSIOTHERAPY, COIMBATORE (Id: C-45527)",
  "CHETTINAD DENTAL COLLEGE AND RESEARCH INSTITUTE, KANCHEEPURAM (Id: C-45605)",
  "CHILD JESUS COLLEGE OF NURSING, TRICHIRAPALLI (Id: C-45741)",
  "CHITHIRAI COLLEGE OF NURSING, MADURAI (Id: C-45645)",
  "CHRISTIAN COLLEGE OF NURSING, NEYYOOR, KANNIYAKUMARI (Id: C-45620)",
  "CHRISTIAN COLLEGE OF PHYSIOTHERAPY, KANNIAKUMARI (Id: C-45619)",
  "CHRISTIAN MEDICAL COLLEGE, VELLORE (Id: C-45654)",
  "C.L.BAID METHA COLLEGE OF PHARMACY, CHENNAI (Id: C-45410)",
  "COIMBATORE MEDICAL COLLEGE, COIMBATORE (Id: C-45513)",
  "COLLEGE OF NURSING, CHENGALPATTU MEDICAL COLLEGE, KANCHEEPURAM (Id: C-45795)",
  "COLLEGE OF NURSING, CHRISTIAN FELLOWSHIP COMMUNITY HEALTH CENTRE, DINDUGUL (Id: C-45584)",
  "COLLEGE OF NURSING, CHRISTIAN MEDICAL COLLEGE AND HOSPITAL, VELLORE (Id: C-45655)",
  "COLLEGE OF NURSING, DHARMARATHNAKARA Dr.N.MAHALINGAM INSTITUTE. OF PARAMEDICAL SCIENCES AND RESEARCH, ERODE (Id: C-45590)",
  "COLLEGE OF NURSING, MADRAS MEDICAL COLLEGE, CHENNAI (Id: C-45415)",
  "COLLEGE OF NURSING, MADURAI MEDICAL COLLEGE, MADURAI (Id: C-45642)",
  "COLLEGE OF NURSING, SRI RAMAKRISHNA INSTITUTE OF PARAMEDICAL SCIENCES, COIMBATORE (Id: C-45516)",
  "COLLEGE OF NURSING, VEL R.S. MEDICAL COLLEGE, CHENNAI (Id: C-45441)",
  "COLLEGE OF OCCUPATIONAL THERAPHY, J.K.K.MUNIRAJAH MEDICAL RESEARCH FOUNDATION, NAMAKKAL (Id: C-45821)",
  "COLLEGE OF PHARMACY, JAYA COLLEGE OF PARAMEDICAL SCIENCES, CHENNAI (Id: C-45451)",
  "COLLEGE OF PHARMACY, MADRAS MEDICAL COLLEGE, CHENNAI (Id: C-45416)",
  "COLLEGE OF PHARMACY, MADURAI MEDICAL COLLEGE, MADURAI (Id: C-45639)",
  "COLLEGE OF PHARMACY, SRI RAMAKRISHNA INSTITUTE OF PARAMEDICAL SCIENCES, COIMBATORE (Id: C-45517)",
  "COLLEGE OF PHYSIOTHERAPHY, J.K.K. MUNIRAJAH MEDICAL RESEARCH FOUNDATION, NAMAKKAL (Id: C-45822)",
  "COLLEGE OF PHYSIOTHERAPY, MADURAI (Id: C-45920)",
  "COLLEGE OF PHYSIOTHERAPY, SRI RAMAKRISHNA INSTITUTE OF PARAMEDICAL SCIENCES, COIMBATORE (Id: C-45518)",
  "C.S.I. COLLEGE OF DENTAL SCIENCES AND RESEARCH, MADURAI (Id: C-45643)",
  "CSI COLLEGE OF NURSING, KANNIYAKUMARI (Id: C-47575)",
  "CSI ELIZA CALDWELL COLLEGE OF NURSING, TIRUNELVELI (Id: C-45676)",
  "C.S.I. JAYARAJ ANNAPACKIAM COLLEGE OF NURSING, MADURAI (Id: C-45641)",
  "CSI KALYANI COLLEGE OF NURSING, CHENNAI (Id: C-47568)",
  "CSI ST.LUKE COLLEGE OF NURSING, TOOTHUKUDI (Id: C-45776)",
  "DEEPAM HOSPITAL LTD., CHENNAI (Id: C-45478)",
  "DEVENDRAR COLLEGE OF PHYSIOTHERAPY, TIRUNELVELI (Id: C-45807)",
  "DHANALAKSHMI SRINIVASAN COLLEGE OF NURSING, PERAMBALUR (Id: C-45715)",
  "DHANALAKSHMI SRINIVASAN MEDICAL COLLEGE AND HOSPITAL, PERAMBALUR (Id: C-45716)",
  "DHANVANTRI COLLEGE OF NURSING, ERODE (Id: C-45589)",
  "DHANVANTRI CRITICAL CARE CENTER, ERODE HEART HOSPITAL INSTITUTE OF CLINICAL TOXICOLOGY, ERODE (Id: C-45593)",
  "DHARMA AYURVEDA MEDICAL COLLEGE AND HOSPITAL, KANCHEEPURAM (Id: C-45755)",
  "DOCTOR S COLLEGE OF NURSING, PUDUKKOTTAI (Id: C-45706)",
  "DR.A.RAMACHANDRAN S DIABETES HOSPITALS, CHENNAI (Id: C-45497)",
  "Dr. BALAJI HEALTH AND EDUCATION TRUST, VELLORE (Id: C-45832)",
  "Dr.G.SAKUNTHALA COLLEGE OF NURSING, TIRUCHIRAPALLI (Id: C-45686)",
  "Dr.HAHNEMANN HOMOEOPATHY MEDICAL COLLEGE, NAMAKKAL (Id: C-45804)",
  "DR.KAMAKSHI MEMORIAL HOSPITAL, CHENNAI (Id: C-45495)",
  "DR KUMARASWAMI HEALTH CENTRE COLLEGE OF NURSING, KANYAKUMARI (Id: C-45910)",
  "DR.MEHTA S HOSPITALS PVT., LTD., CHENNAI (Id: C-45485)",
  "DR.MOHAN S DIABETES SPECIALITIES CENTRE AND DR.MOHAN S DIABETES EDUCATION ACADEMY, CHENNAI (Id: C-45501)",
  "Dr.MOHAN S DIABETES SPECIALITIES CENTRE, CHENNAI (Id: C-45489)",
  "EDAYATHANGUDI G.S.PILLAY COLLEGE OF PHARMACY, NAGAPATTINAM (Id: C-45649)",
  "ELLEN COLLEGE OF NURSING, COIMBATORE (Id: C-45545)",
  "ERODE COLLEGE OF PHARMACY, ERODE (Id: C-45586)",
  "E S COLLEGE OF NURSING, VILLUPURAM (Id: C-45733)",
  "ESI-PGIMSR, CHENNAI (Id: C-45507)",
  "FATHIMA COLLEGE OF PHARMACY, KADAYANALLUR, TIRUNELVELI (Id: C-45670)",
  "GANDHIGRAM INSTITUTE OF RURAL HEALTH AND FAMILY WELFARE TRUST, DINDIGUL (Id: C-45581)",
  "GANGA COLLEGE OF NURSING, COIMBATORE (Id: C-45554)",
  "GANGA MEDICAL CENTRE AND HOSPITAL PVT. LTD., COIMBATORE (Id: C-45562)",
  "GEM HOSPITAL AND RESEARCH CENTRE PVT. LTD., COIMBATORE (Id: C-45564)",
  "GEM INSTITUTE OF NURSING EDUCATION AND RESEARCH, COIMBATORE (Id: C-45553)",
  "G.KUPPUSWAMY NAIDU MEMORIAL HOSPITAL, COIMBATORE (Id: C-45555)",
  "GLOBAL COLLEGE OF NURSING, KANYAKUMARI (Id: C-45628)",
  "GLOBAL HOSPITALS AND HEALTH CITY, CHENNAI (Id: C-45473)",
  "GOVERNMENT ARIGNAR ANNA MEMORIAL CANCER HOSPITAL, KANCHEEPURAM (Id: C-45614)",
  "GOVERNMENT AYURVEDA MEDICAL COLLEGE AND HOSPITAL, KANNIYAKUMARI (Id: C-45813)",
  "GOVERNMENT COLLEGE OF PHYSIOTHERAPY, TIRUCHIRAPALLI (Id: C-45682)",
  "GOVERNMENT DHARMAPURI MEDICAL COLLEGE, DHARMAPURI (Id: C-45577)",
  "GOVERNMENT HOMOEOPATHIC MEDICAL COLLEGE, MADURAI (Id: C-45637)",
  "GOVERNMENT INSTITUTE OF REHABILITATION AND MEDICINE, CHENNAI (Id: C-45414)",
  "GOVERNMENT MOHAN KUMARAMANGALAM MEDICAL COLLEGE, SALEM (Id: C-45690)",
  "GOVERNMENT SIDDHA MEDICAL COLLEGE, CHENNAI (Id: C-45411)",
  "GOVERNMENT SIDDHA MEDICAL COLLEGE, PALAYAMKOTTAI,TIRUNELVELI (Id: C-45668)",
  "GOVERNMENT SIVAGANGAI MEDICAL COLLEGE, SIVAGANGAI (Id: C-47559)",
  "GOVERNMENT THENI MEDICAL COLLEGE, THENI (Id: C-47558)",
  "GOVERNMENT TIRUVARUR MEDICAL COLLEGE AND HOSPITAL, TIRUVARUR (Id: C-45775)",
  "GOVERNMENT UNANI MEDICAL COLLEGE, CHENNAI (Id: C-45408)",
  "GOVERNMENT VELLORE MEDICAL COLLEGE, VELLORE (Id: C-47557)",
  "GOVERNMENT VILLUPURAM MEDICAL COLLEGE AND HOSPITAL, VILLUPURAM (Id: C-45731)",
  "GOVERNMENT YOGA AND NATUROPATHY COLLEGE, CHENNAI (Id: C-45442)",
  "GRACE COLLEGE OF NURSING, KANYAKUMARI (Id: C-47573)",
  "G.R. HOSPITAL, COIMBATORE (Id: C-45556)",
  "HINDU MISSION COLLEGE OF NURSING, CHENNAI (Id: C-47567)",
  "INDIA HEART FOUNDATION UNIT OF VENKATESWARA HOSPITALS, CHENNAI (Id: C-45468)",
  "INDIRA COLLEGE OF NURSING, THIRUVALLUR (Id: C-45725)",
  "INDIRA COLLEGE OF NURSING, TIRUCHIRAPALLI (Id: C-45687)",
  "INSTITUTE OF OPHTHALMOLOGY, JOSEPH EYE HOSPITAL, TIRUCHIRAPALLI (Id: C-45683)",
  "INTERNATIONAL CENTRE FOR CARDIO THERACICAND VASCULAR DISEASES, CHENNAI (Id: C-45467)",
  "IRT-PERUNDURAI MEDICAL COLLEGE, ERODE (Id: C-45594)",
  "ITHAYA JYTHOI COLLEGE OF NURSING, TIRUNELVELI (Id: C-45806)",
  "JAINEE COLLEGE OF NURSING, DINDIGUL (Id: C-45582)",
  "JAYA COLLEGE OF PHYSIOTHERAPY, CHENNAI (Id: C-45443)",
  "JAYAM PARAMEDICAL SCIENCES, THANJAVUR (Id: C-45765)",
  "JEEVA COLLEGE OF NURSING, KRISHNAGIRI (Id: C-45634)",
  "JENNYS COLLEGE OF NURSING, TIRUCHIRAPALLI (Id: C-45688)",
  "J.K. COLLEGE OF NURSING AND PARA MEDICAL SCIENCES, COIMBATORE (Id: C-45542)",
  "J.K.K. NATARAJAH COLLEGE OF PHARMACY, SALEM (Id: C-45689)",
  "J.K.K NATARAJAH DENTAL COLLEGE, NAMAKKAL (Id: C-45823)",
  "J.M. CHARITABLE TRUSTI, KANYAKUMARI (Id: C-45812)",
  "J.S.S. INSTITUTE OF NATUROPATHY AND YOGIC SCIENCES, OOTACAMUND, COIMBATORE (Id: C-45533)",
  "J V COLLEGE OF NURSING, CHENNAI (Id: C-45456)",
  "KAMALAM VISWANATHAN COLLEGE OF PHYSIOTHERAPY, TIRUCHIRAPALLI (Id: C-45685)",
  "KAMALATCHI PANDURANGAN COLLEGE OF PHARMACY, THIRUVANNAMALAI (Id: C-45726)",
  "KANCHI KAMAKOTI CHILDS TRUST HOSPITAL, CHENNAI (Id: C-45483)",
  "KANYAKUMARI GOVT MEDICAL COLLEGE, KANYAKUMARI (Id: C-45623)",
  "K.A.P. VISWANATHAM GOVERNMENT MEDICAL COLLEGE, TIRUCHIRAPALLI (Id: C-45684)",
  "KARPAGAM COLLEGE OF PHARMACY, COIMBATORE (Id: C-45543)",
  "KARPAGAM FACULTY OF MEDICAL SCIENCES & RESEARCH, COIMBATORE (Id: C-47560)",
  "KARPAGAM NURSING COLLEGE, COIMBATORE (Id: C-45547)",
  "KARPAGA VINAYAGA COLLAGE OF NURSING, KANCHEEPURAM (Id: C-45612)",
  "KARPAGA VINAYAGA COLLEGE OF NURSING, PUDUKKOTTAI (Id: C-45705)",
  "KARPAGA VINAYAGA INSTITUTE OF MEDICAL SCIENCES AND RESEARCH CENTRE, KANCHEEPURAM (Id: C-45816)",
  "KARPAGA VINYAKA INSTITUTE OF DENTAL SCIENCES, KANCHEEPURAM (Id: C-45607)",
  "KAVERY MEDICAL CENTRE AND HOSPITALS, TRICHY (Id: C-45743)",
  "KEERAI THAMILSELVAN COLLEG OF NURSING, PUDUKOTTAI (Id: C-45708)",
  "K.G. COLLEGE OF NURSING, COIMBATORE (Id: C-45530)",
  "K.G. COLLEGE OF PHYSIOTHERAPY, COIMBATORE (Id: C-45534)",
  "K.G. HOSPITAL AND POST GRADUATE MEDICAL INSTITUTE, COIMBATORE (Id: C-45557)",
  "KILPAUK MEDICAL COLLEGE, CHENNAI (Id: C-45405)",
  "KING INSTITUTE OF PREVENTIVE MEDICINE AND RESEARCH, CHENNAI (Id: C-45749)",
  "K.K. COLLEGE OF PHARMACY, CHENNAI (Id: C-45422)",
  "K.M.C.H. COLLEGE OF NURSING, COIMBATORE (Id: C-45520)",
  "K.M.C.H. COLLEGE OF OCCUPATIONAL THERAPY, COIMBATORE (Id: C-45529)",
  "K.M.C.H. COLLEGE OF PARAMEDICAL SCIENCES, COIMBATORE (Id: C-45524)",
  "K.M.C.H. COLLEGE OF PHARMACY, COIMBATORE (Id: C-45528)",
  "K.M. COLLEGE OF PHARMACY, MADURAI (Id: C-45636)",
  "KMC SPECIALITY HOSPITALS (I) LTD., TRICHY (Id: C-45744)",
  "KONGUNADU COLLEGE OF NURSING, COIMBATORE (Id: C-45551)",
  "KOVAI MEDICAL CENTER AND HOSPITAL LIMITED, COIMBATORE (Id: C-45567)",
  "KRISHNA HOSPITAL AND RESEARCH FOUNDATION, CUDDALORE (Id: C-45571)",
  "K.S.R.INSTIUTE OF DENTAL SCIENCE AND RESEARCH, NAMAKKAL (Id: C-45767)",
  "KUMAR EDUCATIONAL INSTITUTE, CUDDALORE (Id: C-45827)",
  "M.A. CHIDAMBARAM COLLEGE OF NURSING, CHENNAI (Id: C-45420)",
  "MADHA COLLEGE OF NURSING, CHENNAI (Id: C-45439)",
  "MADHA COLLEGE OF PHYSIOTHERAPY, CHENNAI (Id: C-45436)",
  "MADHA DENTAL COLLEGE AND HOSPITAL, CHENNAI (Id: C-45454)",
  "MADHA MEDICAL COLLEGEAND HOSPITAL, KANCHEEPURAM (Id: C-45797)",
  "MADRAS ENT RESEARCH FOUNDATION (P) LTD., CHENNAI (Id: C-45479)",
  "MADRAS MEDICAL COLLEGE, CHENNAI (Id: C-45402)",
  "MADURAI APOLLO COLLEGE OF NURSING, MADURAI (Id: C-45646)",
  "MADURAI MEDICAL COLLEGE, MADURAI (Id: C-45404)",
  "MAHARANI NURSING COLLEGE, DHARAPURAM (Id: C-47513)",
  "MAM COLLEGE OF NURSING, THIRUCHIRAPPALLI (Id: C-45721)",
  "MANNAI NARAYANASAMY COLLEGE OF NURSING, THANJAVUR (Id: C-45758)",
  "MARTIN HOMOEOPATHY MEDICAL COLLEGE AND HOSPITAL, COIMBATORE (Id: C-45539)",
  "MATHA COLLEGE OF NURSING, SIVAGANGA (Id: C-45751)",
  "MEDISCAN SYSTEMS, CHENNAI (Id: C-45481)",
  "MEENAKSHI MISSION HOSPITAL AND RESEARCH CENTRE, MADURAI (Id: C-47555)",
  "MELMARUVATHUR ADHIPARASAKTHI INSTITUTE OF MEDICAL SCIENCES AND RESEARCH, KANCHEEPURAM (Id: C-45814)",
  "MERF INSTITUTE OF SPEECH AND HEARING, CHENNAI (Id: C-45469)",
  "MIOT COLLEGE OF NURSING, CHENNAI (Id: C-45450)",
  "MIOT HOSPITALS, CHENNAI (Id: C-45464)",
  "M.K. EDUCATIONAL INSTITUTE, ARIYALUR (Id: C-45407)",
  "MMM ACADEMY OF MEDICAL SCIENCES, CHENNAI (Id: C-45452)",
  "MMM COLLEGE OF HEALTH SCIENCES, CHENNAI (Id: C-45465)",
  "MMM COLLEGE OF NURSING, THIRUVALLUR (Id: C-45772)",
  "M.N. COLLEGE OF OPTOMETRY, CHENNAI (Id: C-45472)",
  "MOHAMED SATHAK A.J. COLLEGE OF PHARMACY, CHENNAI (Id: C-45438)",
  "MOUNT ZION COLLEGE OF NURSING, PUDUKKOTTAI (Id: C-45711)",
  "M.V. HOSPITAL FOR DIABETES (P) LTD., AND PROF. M. VISWANATHAN DIABETES RESEARCH CENTRE, CHENNAI (Id: C-45504)",
  "NANDHA COLLEGE OF NURSING, ERODE (Id: C-45591)",
  "NANDHA COLLEGE OF PHARMACY, ERODE (Id: C-45585)",
  "NANDHA COLLEGE OF PHYSIOTHERAPY, ERODE (Id: C-45588)",
  "NATIONAL INSTITUTE OF SIDDHA,TAMBARAM SANITORIUM, CHENNAI (Id: C-45448)",
  "NEHRU COLLEGE OF NURSING, TRICHIRAPALLI (Id: C-45742)",
  "NEHRU NURSING COLLEGE, VALLIOOR, TIRUNELVELI (Id: C-45673)",
  "NIGHTINGALE INSTITUTE OF NURSING EDUCATION, COIMBATORE (Id: C-45550)",
  "OMAYAL ACHI COLLEGE OF NURSING, CHENNAI (Id: C-45419)",
  "OM SAKTHI COLLEGE OF NURSING, DHARMAPURI (Id: C-45580)",
  "O.P.R. MEMORIAL COLLEGE OF PARA MEDICAL SCIENCES, CUDDALORE (Id: C-45570)",
  "OUR LADY OF HEALTH COLLEGE OF NURSING, THANJAVUR (Id: C-45762)",
  "PADMASHRI Dr. SIVANTHI ADITANAR COLLEGE OF NURSING, THOOTHUKUDI (Id: C-45769)",
  "PADMASREE COLLEGE OF NURSING, KANCHEEPURAM (Id: C-45613)",
  "PADMAVATHI COLLEGE OF PHARMACY, DHARMAPURI (Id: C-45575)",
  "PADMAVATHI COLLEGE OF PHYSIOTHERAPY, DHARMAPURI (Id: C-45574)",
  "PAULS COLLEGE OF NURSING, VILLUPURAM (Id: C-45735)",
  "PEDIATRIC EMERGENCY UNIT, INST. OF CHILD HEALTHAND HOSPITAL FOR CHILDREN (MMC), CHENNAI (Id: C-45488)",
  "PERIYAR COLLEGE OF PHARMACEUTICAL SCIENCES FOR GIRLS, TIRUCHIRAPALLI (Id: C-45681)",
  "P.G.P.COLLEGE OF NURSING AND RESEARCH, NAMAKKAL (Id: C-45651)",
  "P.G.P. COLLEGE OF PHARMACEUTICAL SCIENCE AND RESEARCH INSTITUTE, NAMAKKAL (Id: C-45652)",
  "P.P.G. COLLEGE OF NURSING, COIMBATORE (Id: C-45536)",
  "P.P.G. COLLEGE OF PHYSIOTHERAPY, COIMBATORE (Id: C-45535)",
  "PRIYADARSHINI DENTAL COLLEGE AND HOSPITAL, TIRUVALLUR (Id: C-45773)",
  "P S COLLEGE OF NURSING, KANYAKUMARI (Id: C-45627)",
  "P.S.G. COLLEGE OF NURSING, COIMBATORE (Id: C-45526)",
  "P.S.G. COLLEGE OF PARAMEDICAL SCIENCES, COIMBATORE (Id: C-45537)",
  "P.S.G. COLLEGE OF PHARMACY, COIMBATORE (Id: C-45540)",
  "P.S.G. INSTITUTE OF MEDICAL SCIENCES AND RESEARCH, COIMBATORE (Id: C-45515)",
  "RABINRANATH TAGORE COLLEGE OF NURSING FOR WOMEN (Diploma in Nursing), SALEM (Id: C-45698)",
  "RAGAS DENTAL COLLEGE, CHENNAI (Id: C-45413)",
  "RAJALAKSHMI COLLEGE OF NURSING, CHENNAI (Id: C-45458)",
  "RAJAS DENTAL COLLEGE AND HOSPITAL, TIRUNELVELI (Id: C-45669)",
  "RASS ACADEMY COLLEGE OF NURSING, SIVAGANGA (Id: C-45752)",
  "REVATHI MEDICAL CENTER, TIRUPUR (Id: C-45770)",
  "RIGHT COLLEGE OF NURSING, VANAGARAM, CHENNAI (Id: C-45455)",
  "RIGHT HOSPITALS, CHENNAI (Id: C-45508)",
  "ROYAL COLLEGE OF NURSING, COIMBATORE (Id: C-45559)",
  "R.V.S COLLEGE OF NURSING, KANNAMPALAYAM, COIMBATORE (Id: C-45523)",
  "R.V.S. COLLEGE OF NURSING, SULAR, COIMBATORE (Id: C-45548)",
  "R.V.S. COLLEGE OF PHARMACEUTICAL SCIENCES, COIMBATORE (Id: C-45521)",
  "R.V.S. COLLEGE OF PHYSIOTHERAPY, COIMBATORE (Id: C-45522)",
  "R V S DENTAL COLLEGE AND HOSPITAL, COIMBATORE (Id: C-45549)",
  "R.V.S. HOMOEOPATHIC MEDICAL COLLEGE, COIMBATORE (Id: C-45541)",
  "R.V.S. SIDDHA MEDICAL COLLEGEAND HOSPITAL, COIMBATORE (Id: C-45546)",
  "SACRED HEART COLLEGE OF NURSING, DINDIGUL (Id: C-47572)",
  "SACRED HEART NURSING COLLEGE, MADURAI (Id: C-45640)",
  "SACRED HEART NURSING COLLEGE, THANJAVUR (Id: C-45763)",
  "SAKTHI COLLEGE OF NURSING, DINDIGUL (Id: C-45809)",
  "SAKTHI COLLEGE OF NURSING, KARUR (Id: C-45630)",
  "SAKTHI NURSING SCHOOL, CHENNAI (Id: C-45505)",
  "SANKARALINGAM BHUVANESWARI COLLEGE OF PHARMACY, VIRUDHUNAGAR (Id: C-45753)",
  "SANKARA NETHRALAYA MEDICAL RESEARCH FOUNDATION, CHENNAI (Id: C-45412)",
  "SARA COLLEGE OF NURSING, ERODE (Id: C-45595)",
  "SARADA KRISHNA HOMOEOPATHY MEDICAL COLLEGE, KANNYAKUMARI (Id: C-45616)",
  "S.A. RAJA COLLEGE OF PHARMACY, VADAKANKULAM (Id: C-45671)",
  "SARDAR RAJAS COLLEGE OF NURSING, TIRUNELVELI (Id: C-45678)",
  "S.CHATTANATHAKARAYALAR COLLEGE OF PHARMACY, TENKASI (Id: C-45672)",
  "SCHIEFFELIN INSTITUTE OF HEALTH - RESEARCH LEPROSY CENTRE, KARIGIRI (Id: C-45633)",
  "SERVITE COLLEGE OF NURSING, NAGAMANAGALAM, TRICHY (Id: C-45747)",
  "SHAKTHI COLLEGE OF PARAMEDICAL SCIENCE, THANJAVUR (Id: C-45818)",
  "SHANMUGA INSTITUTE OF PARA MEDICAL SCIENCES, SALEM (Id: C-45695)",
  "SHARMILA COLLEGE OF NURSING, CHENNAI (Id: C-45431)",
  "SHENBAGHA COLLEGE OF NURSING, CHENNAI (Id: C-45459)",
  "SHERIL MARTH PARAMEDICAL INSTITUTION, THANJAVUR (Id: C-45759)",
  "SHIVPARVATHI MANDRADIAR INSTITUTE OF HEALTH SCIENCES, ERODE (Id: C-45592)",
  "SHREE SIVAA HOSPITAL PVT. LTD., COIMBATORE (Id: C-45560)",
  "SHRI BHARANI COLLEGE OF NURSING, SALEM (Id: C-45700)",
  "SIVARAJ HOMOEOPATHIC MEDICAL COLLEGEAND RESEARCH INSTITUTE, SALEM (Id: C-45696)",
  "SIVARAJ NATUROPATHY AND YOGA MEDICAL COLLEGE, SALEM (Id: C-45693)",
  "SIVARAJ SIDDHA MEDICAL COLLEGE, SALEM (Id: C-45699)",
  "SREE ABIRAMI COLLEGE OF NURSING, COIMBATORE (Id: C-45552)",
  "SREE ABIRAMI HOSPITAL (P) LTD., COIMBATORE (Id: C-45558)",
  "SREE MOOKAMBIKA INSTITUTE OF DENTAL SCIENCES, KANNIYAKUMARI (Id: C-45824)",
  "SREE MOOKAMBIKA INSTITUTE OF MEDICAL SCIENCES, KANNIYAKUMARI (Id: C-45625)",
  "SREE RAMAKRISHNA MEDICAL COLLEGE OF NATUROPATHY AND YOGIC SCIENCES, KANYAKUMARI (Id: C-45621)",
  "SREE SASTHA COLLEGE OF NURSING, CHENNAI (Id: C-47565)",
  "SRESAKTHIMAYEIL INSTITUTE OF NURSING AND RESEARCH, NAMAKKAL (Id: C-45803)",
  "SRI AUROBINDO COLLEGE OF NURSING, KARUR (Id: C-45631)",
  "SRI BALAJI COLLEGE OF NURSING, TIRUNELVELI (Id: C-45677)",
  "SRI DEVI COLLEGE OF NURSING, THIRUVALLUR (Id: C-45805)",
  "SRI GOKULAM COLLEGE OF NURSING, SALEM (Id: C-45697)",
  "SRI GOKULAM HOSPITAL, SALEM (Id: C-45701)",
  "SRI.K.RAMACHANDRAN NAIDU COLLEGE OF NURSING, TIRUNELVELI (Id: C-45723)",
  "SRILAKSHMI HAIGIRIVASH EDUCATIONAL TRUST, VILLUPURAM (Id: C-45732)",
  "SRI MOOKAMBIKA COLLEGE OF NURSING, KANNIYAKUMARI (Id: C-45617)",
  "SRI MUTHUKUMARAN MEDICAL COLLEGE HOSPITAL AND RESEARCH INSTITUTE, CHENNAI (Id: C-45461)",
  "SRI NARAYANI COLLEGE OF NURSING, VELLORE (Id: C-45664)",
  "SRINIDHI COLLEGE OF HEALTH SERVICES AND RESEARCH, MADURAI (Id: C-45648)",
  "SRINIVASAN COLLEGE OF NURSING, PERAMBALUR (Id: C-45717)",
  "SRI PADMAVATHI COLLEGE OF NURSING, DHARMAPURI (Id: C-45573)",
  "SRI PASPO COLLEGE OF NURSING, DHARMAPURI (Id: C-45578)",
  "SRI RAMAKRISHNA COLLEGE OF NURSING, KANNIYAKUMARI (Id: C-45825)",
  "SRI RAMAKRISHNA DENTAL COLLEGE AND HOSPITAL, COIMBATORE (Id: C-45538)",
  "SRI RANGAPOOPATHI COLLEGE OF NURSING, VILLUPURAM (Id: C-45734)",
  "SRI SAIRAM AYURVEDA MEDICAL COLLEGE AND RESEARCH CENTRE, CHENNAI (Id: C-45445)",
  "SRI SAIRAM HOMOEOPATHY MEDICAL COLLEGE, CHENNAI (Id: C-45444)",
  "SRI SAIRAM SIDDHA MEDICAL COLLEGE AND RESEARCH CENTRE, KANCHEEPURAM (Id: C-45611)",
  "SRI SAKTHI AMMA INSTITUTE OF ALLIED HEALTH SCIENCES, VELLORE (Id: C-45756)",
  "SRI SANTHOSI COLLEGE OF NURSING, KANCHEEPURAM (Id: C-45609)",
  "SRI VENKATESWARA DENTAL COLLEGE AND HOSPITAL, KANCHEEPURAM (Id: C-45606)",
  "SRI VIJAY VIDHYALAYA COLLEGE OF NURSING, DHARMAPURI (Id: C-45579)",
  "SRI VIRUDHAMBIGAI PARAMEDICAL COLLEGE, CUDDALORE (Id: C-45794)",
  "SSM COLLEGE OF PHARMACY, ERODE (Id: C-45596)",
  "STANLEY MEDICAL COLLEGE, CHENNAI (Id: C-45403)",
  "ST.ANN S COLLEGE OF NURSING, THOOTHUKKUDI (Id: C-45728)",
  "ST. BONNIE WHITE COLLEGE OF NURSING, SALEM (Id: C-45703)",
  "St. ISABELS COLLEGE OF NURSING, CHENNAI (Id: C-47566)",
  "ST.JOHN S COLLEGE OF NURSING, VELLORE (Id: C-45730)",
  "ST.JOHN S PARAMEDICAL COLLEGE, PUDUKKOTTAI (Id: C-45828)",
  "ST. JOSEPH S PARAMEDICAL COLLEGE, KRISHNAGIRI (Id: C-45635)",
  "ST.MARYS COLLEGE OF PARAMEDICAL SCIENCES, CUDDALORE (Id: C-45572)",
  "ST.XAVIER COLLEGE OF NURSING, THANJAVUR (Id: C-45766)",
  "ST.XAVIER S CATHOLIC COLLEGE OF NURSING, KANNIYAKUMARI (Id: C-45624)",
  "SUGAM HOSPITALS (P) LTD., CHENNAI (Id: C-45470)",
  "SUNDARAM MEDICAL FOUNDATION, DR.RANGARAJAN MEMORIAL HOSPITAL, CHENNAI (Id: C-45493)",
  "SURABI COLLEGE OF NURSING, COIMBATORE (Id: C-45569)",
  "SURABI SCHOOL OF NURSING, DINDIGUL (Id: C-45583)",
  "SURABI SCHOOL OF NURSING, KARUR (Id: C-45632)",
  "SURAN COLLEGE OF NURSING, VIRUDHUNAGAR (Id: C-45738)",
  "SURYA SCHOOL OF PHARMACY, VILLUPPURAM (Id: C-45793)",
  "SVS MEDICAL COLLEGE OF YOGAAND NATUROPATHYAND RESEARCH INSTITUTE, VILLUPURAM (Id: C-45801)",
  "SWAMI VIVEKANANDA COLLEGE OF NURSING, A.JETTIHALLI, DHARMAPURI (Id: C-45576)",
  "SWAMY VIVEKANANDHA COLLEGE OF PHARMACY, SALEM (Id: C-45691)",
  "TAGORE DENTAL COLLEGE AND HOSPITAL, CHENNAI (Id: C-45457)",
  "TAGORE MEDICAL COLLEGE AND HOSPITAL, CHENNAI (Id: C-45462)",
  "TAMIL NADU GOVERNMENT DENTAL COLLEGE AND HOSPITAL, CHENNAI (Id: C-45409)",
  "TARA INSTITUTE OF PARA MEDICAL SCIENCES, VILLUPURAM (Id: C-45736)",
  "TEAM SPECIALITY HOSPITAL, PUDUKKOTTAI (Id: C-45707)",
  "TEXCITY COLLEGE OF NURSING, COIMBATORE (Id: C-45544)",
  "THANJAVUR MEDICAL COLLEGE, THANJAVUR (Id: C-45406)",
  "THANTHAI ROEVER COLLEGE OF NURSING, PERAMBALAUR (Id: C-45713)",
  "THANTHAI ROEVER COLLEGE OF PHARMACY, PERAMBALUR (Id: C-45714)",
  "THANTHAI ROEVER COLLEGE OF PHYSIOTHERAPY, TRICHIRAPALLI (Id: C-45739)",
  "THASIAH COLLEGE OF NURSING, KANNIYAKUMARI (Id: C-45626)",
  "THE EYE FOUNDATION, COIMBATORE (Id: C-45563)",
  "THE INSTITUTE OF NEUROLOGICAL SCIENCES, THE VOLUNTARY HEALTH SERVICES, CHENNAI (Id: C-45491)",
  "THE SALVATION ARMY CATHERINE BOOTH COLLEGE OF NURSING, NAGERCOIL (Id: C-47574)",
  "THE SANKARA NETHRALAYA ACADEMY (UNIT OF MEDICAL RESEARCH FOUNDATION), CHENNAI (Id: C-45474)",
  "THIRAVIAM COLLEGE OF NURSING, MOUNT JERUSALEM, THENI (Id: C-47514)",
  "THOOTHUKUDI GOVT MEDICAL COLLEGE, THOOTHUKUDI (Id: C-45917)",
  "TIRUNELVELI MEDICAL COLLEGE, TIRUNELVELI (Id: C-47556)",
  "UCA COLLEGE OF PARAMEDICAL SCIENCES, CHETPUT (Id: C-47516)",
  "ULTRA COLLEGE OF PHARMACY, MADURAI (Id: C-45914)",
  "VEE CARE COLLEGE OF NURSING, CHENNAI (Id: C-45905)",
  "VELLALAR COLLEGE OF NURSING, ERODE (Id: C-46068)",
  "VELUMAILU SIDDHA MEDICAL COLLEGE, KANCHEEPURAM (Id: C-47561)",
  "VENKATESWARA HOMOEOPATHY MEDICAL CENTRE, CHENNAI (Id: C-45907)",
  "VENKATESWARA NURSING COLLEGE, CHENNAI (Id: C-45906)",
  "VIGNESH NURSING COLLEGE, TIRUVANNAMALAI (Id: C-45916)",
  "VIVEKANANDA DENAL COLLEGE FOR WOMEN, NAMAKKAL (Id: C-45915)",
  "VIVEKANANDA (RABINRANATH TAGORE) NURSING COLLEGE FOR WOMEN, SALEM (Id: C-47569)",
  "VIVEKANANDHA COLLEGE OF NURSING, NAMAKKAL (Id: C-47515)",
  "V.P.M.M. COLLEGE OF NURSING, VIRUDHUNAGAR (Id: C-47570)",
  "V V VANNIAPERUMAL NURSING COLEGE FOR WOMEN, VIRUDHUNAGAR (Id: C-45919)",
  "WHITE MEMORIAL COLLEGE OF NURSING, KANNIYAKUMARI (Id: C-45911)",
  "WHITE MEMORIAL COLLEGE OF PHYSIOTHERAPY, KANNIYAKUMARI (Id: C-45912)",
  "WHITE MEMORIAL HOMOEOPATHY MEDICAL COLLEGE, KANNIYAKUMARI (Id: C-45913)",
  "Fisheries College and Research Institute, Thoothukudi (Id: C-42738)",
  "Christian College of Physical Education (Id: C-7943)",
  "Dr. Sivanthi Aditanar College of Physical Education (Id: C-7947)",
  "Koviloor Andavar College of Physical Education (Id: C-7941)",
  "Maruthi College of Physical Education (Id: C-7944)",
  "Meenachi College of Physical Education (Id: C-7942)",
  "Selvam College of Physical Education (Id: C-7946)",
  "SKT College of Physical Education (Id: C-7939)",
  "Sri Renugambal college of Physical Education (Id: C-7949)",
  "Sri Sarada College of Physical Education for Women (Id: C-7940)",
  "St. John's College of Physical Education (Id: C-7948)",
  "YMCA College of Physical Education (Id: C-7945)",
  "Aasee College of Education (Id: C-14466)",
  "Adharsh Vidhyalaya College of Education (Id: C-14788)",
  "Adhiparasakthi College of Education (Id: C-14885)",
  "Adhiyamaan College of Education (Id: C-14952)",
  "A.G. College of Education (Id: C-14965)",
  "AGRA College of Education (Id: C-14994)",
  "Akshaya College of Education (Id: C-14745)",
  "A.K.T. Memorial College of Education (Id: C-14787)",
  "Al-Ameen College of Education (Id: C-14915)",
  "All Angels College of Education (Id: C-14451)",
  "All Saints College of Education (Id: C-14909)",
  "Alwin College of Education (Id: C-14677)",
  "Amala College of Education (Id: C-14706)",
  "Amerda Vikas College of Education (Id: C-14618)",
  "A.M.E.S. College of Education (Id: C-14430)",
  "Amirtha College of Education (Id: C-14649)",
  "Amirtham College of Education (Id: C-14899)",
  "Amman College of Education (Id: C-14407)",
  "Amritalaya College of Education (Id: C-14541)",
  "Andavar College of Education (Id: C-14895)",
  "Angel College of Education (Id: C-15033)",
  "Angels College of Education (Id: C-14515)",
  "Annai College of Education (Id: C-14820)",
  "Annai College of Education (Id: C-14803)",
  "Annai College of Education for Women (Id: C-14984)",
  "Annai Fathima College of Education (Id: C-14591)",
  "Annai India College of Education (Id: C-14814)",
  "Annai JKK Sampoorani Ammal College of Education (Id: C-14402)",
  "Annai Madha College of Education (Id: C-14743)",
  "Annai Mathammal Sheela College of Education (Id: C-14741)",
  "Annai Meenakshi College of Education (Id: C-14683)",
  "Annai Saraswathi College of Education (Id: C-14756)",
  "Annai Teresa College of Education (Id: C-14540)",
  "Annai Theresas College of Education for Women (Id: C-15025)",
  "Annai Veilankannis College of Education (Id: C-14434)",
  "Annammal college of Education for women, (Aided) (Id: C-14811)",
  "Anna Vinayagar College of Education (Id: C-14536)",
  "Ansaldo College of Education (Id: C-14958)",
  "Apollo College of Education (Id: C-14789)",
  "Arasan Ganesan College of Preceptors (Id: C-14578)",
  "Arasu College of Education for Women (Id: C-14702)",
  "Aravindhar College of Education (Id: C-14938)",
  "Arcot Lutheran Church College of Education (Id: C-14491)",
  "Arcot Sri Mahalakshmi Women's College of Education (Id: C-14851)",
  "Arputha Jothi College of Teacher Education (Id: C-14753)",
  "A.R.R. College of Education (Id: C-14626)",
  "A.R.R. College of Education for Women (Id: C-14776)",
  "Arulmigu Kalasalingam College of Education (Id: C-14388)",
  "Arulmigu Meenakshi Amman College of Education (Id: C-14923)",
  "Arumugam Nallamani College of Education (Id: C-14502)",
  "Arumugam Pillai Seethai Ammal College of Education (Id: C-14452)",
  "Arunachala College of Education (Id: C-14475)",
  "Arunai College of Education (Id: C-15036)",
  "Arun College of Education (Id: C-14561)",
  "A.S. College of Education (Id: C-14922)",
  "Assefa College of Education (Id: C-14694)",
  "Auxilium College of Education for Women (Id: C-14601)",
  "AUXILIUM COLLEGE OF EDUCATION , VELLORE (Id: C-45858)",
  "Avinasi Gounder Mariammal College of Education (Id: C-15009)",
  "A.V.S. College of Education (Id: C-14431)",
  "Ayira Vaisya College of Education (Id: C-14728)",
  "Bapuji Memorial College of Education (Id: C-14406)",
  "Best College of Education (Id: C-14386)",
  "Bethany Navajeevan College of Education (Id: C-14993)",
  "Bethesda College of Education (Id: C-15021)",
  "Bethlahem College of Education (Id: C-15010)",
  "Bharat College of Education (Id: C-14634)",
  "Bharath College of Education (Id: C-14582)",
  "Bharath College of Education (Id: C-14581)",
  "Bharathi College of Education (Id: C-14522)",
  "Bharathi College of Education (Id: C-14503)",
  "Bharathi Vidyalaya College of Education (Id: C-14608)",
  "Bharathi Vidyalaya College of Education (Women) (Id: C-14823)",
  "Bharathiyar College of Education (Id: C-14921)",
  "Bharathiyar College of Education (Id: C-14920)",
  "Bhavani College of Education (Id: C-14720)",
  "Billgates College of Education (Id: C-14398)",
  "Bishop Agniswamy College of Education (Id: C-14659)",
  "Bishop Appasamy College of Education (Id: C-14513)",
  "Bishop Packiam Arokiaswamy College of Education (Id: C-14681)",
  "B.K.R. College of Education (Id: C-14460)",
  "Blessy College of Education (Id: C-14901)",
  "Bon Secours College of Education (Id: C-14767)",
  "B.T.K. College of Education (Id: C-14795)",
  "Century Foundation College of Education (Id: C-14836)",
  "Centwin College of Education (Id: C-14858)",
  "Chandra Chellappan College of Education (Id: C-14879)",
  "Chandy College of Education (Id: C-14441)",
  "Chellammal College of Education (Id: C-14668)",
  "Chezhian College of Education (Id: C-14633)",
  "Cholan College of Education (Id: C-14848)",
  "Christ College of Education for Women (Id: C-14555)",
  "Christ College of Education for Women (Id: C-14602)",
  "Christian college of Education (Id: C-14492)",
  "Christian College of Education (Id: C-14453)",
  "C.K.S. College of Education (Id: C-14893)",
  "C.M.S. College of Education, (Id: C-14884)",
  "CMS College of Education (Id: C-14824)",
  "Cosmopolitan College of Education (Id: C-15035)",
  "Crescent College of Education (Id: C-14411)",
  "Crescent College of Education for Women (Id: C-14654)",
  "C.S. College of Education (Id: C-14619)",
  "CSI Bishop Newbigin College of Education (Id: C-14786)",
  "C.S.I. College of Education (Id: C-14423)",
  "C.S.I. College of Education (Id: C-14454)",
  "C.S Jain College of Education (Id: C-14976)",
  "C.S.M. College of Education (Id: C-14415)",
  "Danie College of Education (Id: C-14486)",
  "Devarajan College of Education (Id: C-14733)",
  "Devi Venkatachalam College of Education (Id: C-14511)",
  "Dhanalakshmi Srinivasan College of Education (Id: C-14772)",
  "Dhanalakshmi Srinivasan College of Education for Women (Id: C-14490)",
  "Dhanam College of Education (Id: C-14470)",
  "Dharma Vidyaalaya College of Education (Id: C-14687)",
  "Dhivya College of Education (Id: C-14546)",
  "Divine College of Education (Id: C-15039)",
  "D.K.T. College of Education (Id: C-14632)",
  "DMI College of Education (Id: C-14574)",
  "Dr.David Raja & Dr.Chandralekha College of Education (Id: C-14482)",
  "Dr. G.R.Damodaran College of Education (Id: C-14957)",
  "Dr.G.U.Pope college of Education (Id: C-14778)",
  "Dr. Meenakshi College of Teacher Education (Id: C-14615)",
  "Dr. Nagarathinams College of Education (Id: C-14395)",
  "Dr. Nallini College of Teacher Education (Id: C-14631)",
  "Dr. N.G.P. College of Education (Id: C-14725)",
  "Dr.Rajabather-Tagore Womens Teacher Training College (Id: C-14770)",
  "Dr.Rajalakshmi College of Education (Id: C-14447)",
  "Dr. R.K. Shanmugam College of Education (Id: C-14682)",
  "Dr. Sivanthi Aditanar college of Education (Id: C-14387)",
  "Dr. S.N.S. College of Education (Id: C-14560)",
  "Dr. S.R.J. College of Education (Id: C-14518)",
  "Dr. Vellasamy Nadar College of Education (Id: C-15029)",
  "Durai Murugan College of Education (Id: C-14622)",
  "Durai Vidyalakshmi College of Education (Id: C-14658)",
  "D.V.C. College of Education (Id: C-14465)",
  "Eden Gardens College of Education (Id: C-14650)",
  "Elizabeth College of Education (Id: C-14804)",
  "ERK College of Education (Id: C-14892)",
  "E.S. College of Education (Id: C-14978)",
  "E.S.Subramaniam Memorial College of Education (Id: C-14487)",
  "Esther College of Education (Id: C-14992)",
  "Excel College of Education (Id: C-14979)",
  "Ganapathy College of Education (Id: C-14838)",
  "Gandhi College of Education (Id: C-14962)",
  "Ganesh College of Education (Id: C-14806)",
  "Gangaa College of Education (Id: C-14748)",
  "G.E.T. B.Ed College of Education (Id: C-14886)",
  "Girivasan College of Education (Id: C-14445)",
  "Gnanamani College of Education (Id: C-14636)",
  "Gojan College of Teacher Education (Id: C-14791)",
  "Good Samaritan College of Education (Id: C-15014)",
  "Good Shepherd college of Education (Id: C-14889)",
  "Good Shepherd College of Education (Id: C-14911)",
  "Government College of Education (Id: C-14637)",
  "Government College of Education for Women (Id: C-14945)",
  "G.P. Secondary Teacher Education Training College (Id: C-14590)",
  "Grace College of Education (Id: C-14735)",
  "Grace College of Education (Id: C-14793)",
  "G.R.D. College of Education (Id: C-14898)",
  "G.R.Govindarajulu College of Education (Id: C-14609)",
  "G.V.C. College of Education (Id: C-14586)",
  "HAJI S.M.S.SHAIK JALALUDEEN B.ED. COLLEGE , THANJAVUR (Id: C-45853)",
  "Hindusthan College of Education (Id: C-14742)",
  "Holy Angels College of Education for Women (Id: C-14985)",
  "Holy Cross College of Education (Id: C-14579)",
  "Holy Trinity College of Education (Id: C-14480)",
  "HTP College of Education (Id: C-14891)",
  "Idhayaam College of Education (Id: C-14542)",
  "Imayam College of Education (Id: C-14521)",
  "Immanuel Arasar B.Ed. College of Education (Id: C-14808)",
  "Indhira College of Education (Id: C-14817)",
  "Indian College of Education (Id: C-14967)",
  "Indira Gandhi College of Education (Id: C-14462)",
  "Indira Gandhi College of Special Education (Id: C-14616)",
  "Indra Ganesan College of Education (Id: C-14871)",
  "Infant Jesus College of Education (Id: C-15019)",
  "Institute of Advanced Study of Education, (Autonomous) (Id: C-14944)",
  "Institute of Education (Id: C-14674)",
  "International College of Education (Women) (Id: C-14939)",
  "JAINEE COLLEGE OF EDUCATION , DINDIGUL (Id: C-45843)",
  "Jairam College of Education (Id: C-14647)",
  "Jairupa College of Education (Id: C-14418)",
  "Jai Sai B.Ed. College of Education (Id: C-14760)",
  "Jaisakthi College of Education (Id: C-14545)",
  "Jai Sri Venkateswara College of Education (Id: C-14524)",
  "Jamal Mohamed College of Teacher Education (Id: C-14417)",
  "James college of Education (Id: C-14520)",
  "JAS College of Education (Id: C-14810)",
  "Jaya College of Education (Id: C-14792)",
  "Jayalakshmi Narayanaswami College of Education (Id: C-14607)",
  "Jayam College of Education (Id: C-14575)",
  "Jayanthi College of Education (Id: C-15023)",
  "Jayasanthi B.Ed. College (Id: C-14399)",
  "Jeevan College of Education (Id: C-14538)",
  "Jenneys College of Education (Id: C-14463)",
  "J.J. College of Education (Id: C-14894)",
  "J.K College of Education (Id: C-14664)",
  "J.K. College of Education (Id: C-14428)",
  "J.M.S. College of Education (Id: C-14699)",
  "J.P. COLLEGE OF EDUCATION , TIRUNELVELI (Id: C-45854)",
  "JRS College of Education (Id: C-14862)",
  "J.S.J.V.College of Education (Id: C-14563)",
  "JSR College of Education (Id: C-14479)",
  "Kalaibharathi B.Ed College (Id: C-14696)",
  "Kalaimagal College of Education (Id: C-14483)",
  "KALAIMAGAL COLLEGE OF EDUCATION, DHARMAPURI (Id: C-45841)",
  "Kalaimahal College of Education (Id: C-14729)",
  "Kalaivani College of Education (Id: C-14597)",
  "Kalaivani College of Education (Id: C-14617)",
  "Kaliammal College of Education (Id: C-14813)",
  "Kalvithanthai AKR Sourashtra Teachers College (Id: C-14917)",
  "Kamala College of Education (Id: C-14929)",
  "Kamarajar College of Education (Id: C-14716)",
  "Kamarajar College of Education (Id: C-14818)",
  "Kanchi College of Education (Id: C-14780)",
  "Kandhaswamy College of Education (Id: C-14467)",
  "KAPI College of Education (Id: C-14501)",
  "Kapi Womens College of Education (Id: C-14551)",
  "Karpagam College of Education (Id: C-14645)",
  "Kasthooribha Gandhi College of Education (Id: C-14671)",
  "Kasthurba Gandhi Kanya Gurukulam (Id: C-14951)",
  "Kasturiba Gandhi Jal (Spain) College of Education for Women (Id: C-14508)",
  "Kasturi College of Education (Id: C-14908)",
  "Kathir College of Education (Id: C-14493)",
  "K.E.C. College of Education (Id: C-14481)",
  "Keerrai Thamil Selvan College of Education for Women (Id: C-14499)",
  "Keins College of Education for Women (Id: C-14639)",
  "Kennedy College of Education (Id: C-14512)",
  "Kevi Womens College of Education (Id: C-14726)",
  "K.Indira College of Education (Id: C-14801)",
  "King College of Education (Id: C-14930)",
  "K.K.S. Mani College of Education (Id: C-14595)",
  "K.L.N. B.Ed College (Id: C-15024)",
  "K.M.B.Ed., College of Education (Id: C-15005)",
  "K.M. College of Education (Id: C-14455)",
  "K.M.G. College of Education (Id: C-14906)",
  "K.M.G. College of Education (Id: C-14912)",
  "K. Nanjappa Gownder College of Education (Id: C-14436)",
  "K.N.SUBBARAJ MEMORIAL COLLEGE OF EDUCATION , THOOTHUKKUDI (Id: C-45857)",
  "Kongunadu College of Education (Id: C-14675)",
  "Kongunadu College of Education (Id: C-14690)",
  "Koottalumoodu Arulmigu Bhadreshwari Devasthanam College of Education (Id: C-15001)",
  "K.R. College of Education (Id: C-14881)",
  "Krishna College of Education (Id: C-14859)",
  "Krishna College of Education for Women (Id: C-14757)",
  "Krishnasree College of Education for Women (Id: C-14628)",
  "Krishnaveni Ammal College of Education (Id: C-14819)",
  "KRP College of Education (Id: C-14464)",
  "K.S. College of Education (Id: C-14662)",
  "K.S.K. College of Education (Id: C-14529)",
  "K.S. Maniam College of Education (Id: C-15017)",
  "K.S.M. College of Education for Women (Id: C-14390)",
  "KSR College of Education (Id: C-14510)",
  "Kumutha College of Education (Id: C-14497)",
  "Lady Willingdon Institute of Advanced Study In Education, (Autonomous) (Id: C-14847)",
  "Lakshmi Ammal College of Education (Id: C-14548)",
  "Lakshmi Ammal College of Education (Id: C-14572)",
  "Lakshmi Ammal College of Education for Women (Id: C-14907)",
  "Lakshmi College of Education, (Aided) (Id: C-14946)",
  "Lisieux College of Education (Id: C-15008)",
  "Loyola College of Education (Id: C-14943)",
  "Madha College of Education (Id: C-14722)",
  "Maharaja College of Education (Id: C-14880)",
  "Maharani College of Education (Id: C-14568)",
  "Mahathma College of Education (Id: C-14584)",
  "Mahatma College of Education (Id: C-14435)",
  "Mahatma Gandhi College of Education (Id: C-14472)",
  "Mahendhira College of Education (Id: C-14768)",
  "Mahendra College of Education (Id: C-14605)",
  "M.A.M College of Education (Id: C-14935)",
  "Mangalam College of Education (Id: C-14982)",
  "Mangayarkarasi College of Education (Id: C-14841)",
  "Mar Chrysostom College of Education (Id: C-14758)",
  "Mariamman College of Education (Id: C-14711)",
  "Marudupandiyar College of Education (Id: C-14969)",
  "Maruthi College of Education (Id: C-14738)",
  "Mass College of Education (Id: C-14919)",
  "Matha College of Teacher Education (Id: C-14902)",
  "M.Durai College of Education (Id: C-14717)",
  "MEASI College of Education (Id: C-14990)",
  "Meenakshi B.Ed., College (Id: C-14684)",
  "Meera College of Education (Id: C-14708)",
  "Menakshi Ramasamy College of Education (Id: C-14474)",
  "Merit College of Education (Id: C-14857)",
  "Meston College of Education, (Autonomous) (Id: C-14796)",
  "M.E.T. College of Education (Id: C-14383)",
  "Michael Job Memorial College of Education for Women (Id: C-14798)",
  "Minakshee Ramasami College of Education (Id: C-14833)",
  "M.K.Raman College of Education (Id: C-14488)",
  "M. Kumarasamy College of Education (Id: C-14966)",
  "Modern College of Education (Id: C-14971)",
  "Mohamed Sathak Teacher Training College (Id: C-14624)",
  "MOHAMMED SATHAK DASTHAGIR TEACHER TRAINING COLLEGE , RAMANATHAPURAM (Id: C-45847)",
  "Mother Teresa College of Education (Id: C-33093)",
  "Mother Teresa College of Education -1 (Id: C-14856)",
  "Mother Teresa College of Education for (w) (Id: C-14593)",
  "M. Shanthi College of Education (Id: C-14718)",
  "Muna College of Education (Id: C-14527)",
  "Muslim College of Education (Id: C-14781)",
  "MVM Chellamuthu Alagu Rathinam College of Education (Id: C-14505)",
  "Nadar Mahajana Sangam Kamaraj College of Education (Id: C-14973)",
  "Nadar Saraswathi College of Education (Id: C-14498)",
  "Nagai College of Education (Id: C-14714)",
  "Naina Mohamed College of Education (Id: C-14685)",
  "Nairs College of Education (Id: C-15018)",
  "Nandha College of Education (Id: C-14744)",
  "National College of Education (Id: C-15006)",
  "National Institute for Empowerment of Persons with Multiple Disabilities (NIEPMD) (Id: C-14544)",
  "National Institute for the Visually Handicapped Regional Centre, (Spl. Edu) (Id: C-14730)",
  "NAVODHAYA COLLEGE OF EDUCATION , KRISHNAGIRI (Id: C-45846)",
  "Nazareth College of Education for Women (Id: C-14610)",
  "NDM College of Education (Id: C-14661)",
  "New Ideal College of Education (Id: C-14416)",
  "New Millennium College of Education (Id: C-15016)",
  "Newton College of Education (Id: C-14854)",
  "N.K.T.National College of Education for Women, (Autonomous) (Id: C-14872)",
  "NMS SVN College of Education (Id: C-14897)",
  "NPR College of Education (Id: C-14842)",
  "N.V.K.S.D. College of Education, (Aided) (Id: C-14438)",
  "Omm Muruga College of Education (Id: C-14695)",
  "Om Shanti College of Education (Id: C-14689)",
  "O.P.R Memorial College of Education (Id: C-14873)",
  "Our Lady College of Education (Id: C-14670)",
  "Oxford College of Education (Id: C-14653)",
  "Paavai College of Education (Id: C-14713)",
  "Pachamuthu College of Education (Id: C-14571)",
  "P.A. College of Education (Id: C-14955)",
  "Padmashree College of Education (Id: C-14983)",
  "Padmavani College of Education (Id: C-15015)",
  "Padmavathi College of Education (Id: C-14765)",
  "Pallavan College of Education (Id: C-14774)",
  "Paramveer College of Education (Id: C-14458)",
  "Parasakthi College of Education (Id: C-14556)",
  "Paspo College of Education (Id: C-14389)",
  "Paulsons Teacher Training College (Id: C-14559)",
  "PDR College of Education (Id: C-14783)",
  "P.D.R. Vellachiammal College of Education (Id: C-14840)",
  "Peace College of Education (Id: C-14641)",
  "Penial Rural College of Education (Id: C-14392)",
  "PET College of Teacher Education (Id: C-14709)",
  "PGP College of Education (Id: C-14587)",
  "P.K.D. College of Education (Id: C-14592)",
  "Ponjesly college of Education (Id: C-15013)",
  "Ponkaliamman College of Education (Id: C-14825)",
  "Ponmari College of Education (Id: C-15012)",
  "Ponnusamy Nadar College of Education (Id: C-14698)",
  "POONDI PUDHUMAI MADHA COLLEGE OF EDUCATION, TIRUCHIRAPPALLI (Id: C-45856)",
  "Pope John Paul II College of Education (Id: C-14535)",
  "P.P.G. College of Education (Id: C-14878)",
  "Prof. S.A.College of Education (Id: C-14763)",
  "PSG College of Education (Id: C-14440)",
  "PSG Ponnammal College of Education (Id: C-14384)",
  "PSM College of Education (Id: C-14740)",
  "PSN College of Education (Id: C-14759)",
  "PSNL College of Education (Id: C-14925)",
  "P.S.R. College of Education (Id: C-14835)",
  "PSV College of Education (Id: C-15030)",
  "P.S.Y. College of Education (Id: C-14802)",
  "Punitha Ohm College of Education (Id: C-14424)",
  "Punitha Valanar College of Education (Id: C-14525)",
  "Puratchi Thalaivar Dr.M.G.R. College of Education (Id: C-14443)",
  "Raadhaa College of Education (Id: C-15034)",
  "Rabindharanath Tagore College of Education for Women (Id: C-14691)",
  "Rainbow College of Education (Id: C-14977)",
  "Raja Desingh College of Education (Id: C-14918)",
  "Rajalakshmi College of Education (Id: C-14782)",
  "Rajalakshmi College of Education (Id: C-14989)",
  "Rajapalayam Deivanaiammal College of Education (Id: C-14933)",
  "Rajas College of Education (Id: C-14533)",
  "Raj College of Education (Id: C-14678)",
  "Rajiv Gandhi College of Education (Id: C-14439)",
  "Rajiv Gandhi College of Education (Id: C-14442)",
  "Ramakrishan Chandra College of Education (Id: C-14680)",
  "Rangaswamy College of Education (Id: C-14853)",
  "Rasama College of Education (Id: C-14686)",
  "Rasi College of Education (Id: C-14397)",
  "R.D.B. College of Education (Id: C-14409)",
  "Rev.John Thomas college of Education for women (Id: C-14564)",
  "R.K.R. College of Education (Id: C-14980)",
  "R.K. Samy College of Education (Id: C-14866)",
  "RMP CSI PSK Rajaratnam Memorial College of Education (Id: C-14931)",
  "Roseline College of Education (Id: C-14882)",
  "Royal College of Education (Id: C-14970)",
  "Royal College of Education (Id: C-14996)",
  "Royal College of Education (Id: C-14948)",
  "R.P.A. College of Education (Id: C-14949)",
  "Ruben College of Education (Id: C-14964)",
  "Ruby College of Preceptors (Id: C-14565)",
  "Ruckmani college of Education (Id: C-14746)",
  "R.V.S.College of Education (Id: C-14815)",
  "RVS College of Education (Id: C-14868)",
  "Sai Ram College of Education (Id: C-14396)",
  "Saithanibi College of Education (Id: C-14611)",
  "Sakthi College of Education for Women (Id: C-14751)",
  "Sakthi Institute of Teacher Education and Research (Id: C-14393)",
  "Sandaravadhanam College of Education (Id: C-14408)",
  "Sarada College of Education (Id: C-14476)",
  "Sarada Ramakrishna College of Education (Id: C-14828)",
  "Sarah College of Education for Women (Id: C-14644)",
  "S.A.S. College of Education (Id: C-14705)",
  "Sasthaa College of Education (Id: C-14543)",
  "Sasurie College of Education (Id: C-14963)",
  "Sathyasai B.Ed. College (Id: C-14600)",
  "SAYA Gosh College of Education (Id: C-14446)",
  "S.B.G. College of Education (Id: C-14855)",
  "S.B.G. Sanskrit Mission B.Ed., College (Id: C-14959)",
  "SCAD college of Education (Id: C-14589)",
  "Sengunthar College of Education (Id: C-14812)",
  "Senthil College of Education (Id: C-14603)",
  "Servite College of Education for Women (Id: C-15028)",
  "Seventh Day Adventist Reform Movement (SRM) College of Education (Id: C-14514)",
  "Shakthi Kailash College of Education for Women (Id: C-14461)",
  "SHANTHI NIKETAN COLLEGE OF EDUCATION, THENI (Id: C-45839)",
  "Shiva College of Education (Id: C-14975)",
  "Shivparvathi Mandradiar College of Education (Id: C-14849)",
  "Shree Ragavendra College of Education (Id: C-14539)",
  "Shree Valli College of Education (Id: C-14794)",
  "Shri Bharathi College of Education (Id: C-14604)",
  "Shri Saraswathi College of Education (Id: C-14557)",
  "SHRI SURYA COLLEGE OF EDUCATION , DINDIGUL (Id: C-45844)",
  "Shri Vidhya Mandhir College of Education (Id: C-14519)",
  "Shri V.P.R. College of Education (Id: C-15040)",
  "Siddhartha College of Teacher Education (Id: C-14553)",
  "Siga College of Education (Id: C-14401)",
  "Sir Issac Newton College of Education (Id: C-14773)",
  "Sivagamiammal College of Education (Id: C-14790)",
  "Sivanthi College of Education (Id: C-14947)",
  "Sivanthi College of Education (Id: C-14910)",
  "S.M.R. College of Education (Id: C-15027)",
  "Smt. A.K.D. Sakkaniamma College of Education for Women (Id: C-14739)",
  "Smt. Savithri College of Education (Id: C-14613)",
  "S.N. College of Education (Id: C-15011)",
  "Sourashtra College of Education (Id: C-14427)",
  "S.Preethi B.Ed College of Education (Id: C-14648)",
  "Sree Arumugham Teacher Training College (Id: C-14517)",
  "Sree Krishna College of Education (Id: C-14875)",
  "Sree Ramakrishna college of Education (Id: C-15022)",
  "Sree Sastha College of Education (Id: C-14385)",
  "Sree Velavan College of Education (Id: C-14861)",
  "Sree Vinayaka Vidyalaya College of Education (Id: C-14727)",
  "Sri Adhisankarar College of Education (Id: C-14864)",
  "Sri Amirtha College of Education (Id: C-14534)",
  "Sri Amman College of Education (Id: C-14412)",
  "Sri Angalamman College of Education (Id: C-14837)",
  "Sri Annamalaiyar College of Education (Id: C-14731)",
  "Sri Aurobindo Mira College of Education (Id: C-14710)",
  "Sri Balaji College of Education (Id: C-14627)",
  "Sri Balaji College of Education (Id: C-14673)",
  "Sri Balaji College of Education (Id: C-14863)",
  "Sri Balaji College of Education for Women (Id: C-14596)",
  "Sri Bharathi College of Education (Id: C-15004)",
  "Sri Devi College of Education (Id: C-14425)",
  "Sri Ganesh College of Education (Id: C-14890)",
  "Sri Gokulakrishna College of Education (Id: C-14732)",
  "Sri JayaJothi College of Education (Id: C-14832)",
  "Sri Kalaimagal College of Education (Id: C-14707)",
  "Sri Karpaga Vinayagar College of Education (Id: C-14646)",
  "Sri K Ramachandra Naidu College of Education (Id: C-14797)",
  "Sri Krishna College of Education (Id: C-14450)",
  "Sri Krishna College of Education (Id: C-14457)",
  "Sri Kumaran B.Ed College (Id: C-14669)",
  "Sri Lakshmi College of Education (Id: C-15038)",
  "Sri Lakshmi College of Education (Id: C-14719)",
  "Sri Manickam College of Education (Id: C-14829)",
  "Sri Muppudathi Amman College of Education (Id: C-14547)",
  "Sri Muthukumaran College of Education (Id: C-14485)",
  "Sri Parasakthi College of Education for Women (Id: C-14844)",
  "Sri Raaja Raajan College of Education (Id: C-14588)",
  "Sri Raaja Raajan College of Education for Women (Id: C-14704)",
  "Sri Ragavendra College of Education, Erode (Id: C-14809)",
  "Sri Raghavendra College of Education, Dindigul (Id: C-14712)",
  "Sri Rajarajeswari College of Education, Tiruchirappalli (Id: C-14410)",
  "Sri Ramachandira College of Education (Id: C-14995)",
  "Sri Ramajayam College of Education (Id: C-14766)",
  "Sri Ramakrishna College of Education, Perambalur (Id: C-14807)",
  "Sri Ramakrishna College of Education, Viluppuram (Id: C-14826)",
  "Sri Ram Nallamani Yadava College of Education (Id: C-14612)",
  "Sri Rangachinnammal College of Education (Id: C-14968)",
  "Sri Rangapoopathi College of Education (Id: C-14652)",
  "Sri Renga College of Education (Id: C-14715)",
  "Sri Rengeswarer College of Education (Id: C-14469)",
  "Sri Renugambal College of Education (Id: C-14701)",
  "Sri R. Ponnusamy Naidu College of Education (Id: C-14869)",
  "Sri Sarada College of Education, (Autonomous) (Id: C-14800)",
  "Sri Sarada college of Education for women (Id: C-14421)",
  "Sri Sarada Institute for Teacher Training (Id: C-14941)",
  "Sri Saraswathi College of Education, Ariyalur (Id: C-14429)",
  "Sri Saraswathi College of Education, Tiruchirappalli (Id: C-14956)",
  "Sri Sowbackiya College of Education (Id: C-14762)",
  "Sri Sundareswari College of Education (Id: C-15002)",
  "Sri Swamy College of Education for Women (Id: C-14558)",
  "Sri Thangam Periyasamy College of Education (Id: C-14614)",
  "Sri Vari College of Education (Id: C-14437)",
  "Sri Vasavi College of Education (Id: C-14916)",
  "Sri Vatsa College of Education (Id: C-14400)",
  "Sri Vekkaliamman College of Education (Id: C-14567)",
  "Sri Vengateswara College of Education, Cuddalore (Id: C-14998)",
  "Sri Venglamani Amman College of Education (Id: C-14580)",
  "Sri Venkatachalapathy College of Education (Id: C-14573)",
  "Sri Venkateswara College of Education, Thanjavur (Id: C-14736)",
  "Sri Venkateswara College of Education, Tiruvannamalai (Id: C-14972)",
  "Sri Venkateswara Vidyalaya College of Education (Id: C-14991)",
  "Sri Vetri College of Education (Id: C-15031)",
  "Sri Vidaya Mandir College of Education, Dharmapuri (Id: C-14576)",
  "Sri Vidya College of Education (Id: C-14816)",
  "Sri Vidya Mandir College of Education, Namakkal (Id: C-14552)",
  "Sri Vidya Vihar College of Education (Id: C-14784)",
  "Sri Vijay Vidyalaya College of Education (Id: C-14655)",
  "Sri Vinayaga College of Education (Id: C-14827)",
  "Sri Viruthambigai College of Education (Id: C-14530)",
  "S.R.M. College of Education (Id: C-14566)",
  "SRMV College of Education, (Autonomous) (Id: C-14852)",
  "SRP College of Education (Id: C-14779)",
  "Stanley College of Education (Id: C-14656)",
  "St.Annes College of Education for Women (Id: C-14473)",
  "St. Anthonys College of Education (Id: C-14721)",
  "Star College of Education (Id: C-14865)",
  "Star Lion College of Education (Id: C-14914)",
  "St. Basil College of Education for Women (Id: C-14554)",
  "St. Charles College of Education (Id: C-14942)",
  "St.Christophers College of Education, Autonomous (Id: C-14394)",
  "Stella Marys college of Education (Id: C-14845)",
  "Stella Matutina College of Education, (Autonomous) (Id: C-14896)",
  "STET College of Education for Women (Id: C-14900)",
  "St.Gonsalo College of Education (Id: C-14570)",
  "St. Grace Lilian College of Education (Id: C-15020)",
  "S.T.Hindu College of Education (Id: C-14723)",
  "St. Ignatius college of Education, (Autonomous) (Id: C-14405)",
  "St. Joans College of Education (Id: C-14550)",
  "St. John De Britto College of Education (Id: C-14549)",
  "St.Johns college of Education, Tirunelveli (Id: C-14606)",
  "St.Joseph college of Education, Kanniyakumari (Id: C-14651)",
  "St.Joseph College of Education, Tirunelveli (Id: C-14663)",
  "St.Josephs College of Education, The Nilgiris (Id: C-14860)",
  "St. Josephs Womens College of Education (Id: C-14769)",
  "St. Justins College of Education, (Aided) (Id: C-14456)",
  "St.Marks College of Education (Id: C-14585)",
  "St.Marys College of Education and Research Institute (Id: C-14775)",
  "St.Marys College of Education, Erode (Id: C-14913)",
  "St.Marys college of Education, Thoothukkudi (Id: C-14805)",
  "St.Marys College of Education, Vellore (Id: C-14904)",
  "St. Pauls College of Education (Id: C-14623)",
  "St. Pauls College of Education (Id: C-14737)",
  "St. Peters College of Education (Id: C-14528)",
  "St. Stephens College of Education for Women (Id: C-14830)",
  "St.Thomas College of Education (Id: C-14954)",
  "St. Xavier College of Education, Thanjavur (Id: C-14532)",
  "St.Xaviers college of Education, (Autonomous) (Id: C-14928)",
  "St. Xaviers College of Education, Pudukkottai (Id: C-14420)",
  "Subham College of Education (Id: C-14988)",
  "Sudharsan College of Education (Id: C-15000)",
  "Sun College of Education (Id: C-14403)",
  "Suraj College of Education (Id: C-14433)",
  "Suresh Bernard Teacher Training College (Id: C-14484)",
  "Susila College of Education (Id: C-14444)",
  "S.Veerasamy chettiar college of Education (Id: C-14703)",
  "S.V.I College of Education (Id: C-14692)",
  "S.V.S College of Education (Id: C-14495)",
  "Swaminathan Saraswathi College of Education for Women (Id: C-14688)",
  "Swami Vivekananda College of Education, Perambalur (Id: C-14700)",
  "Tagore College of Education (Id: C-14752)",
  "Tamil Nadu College of Education (Id: C-14999)",
  "T.D.T.A.D.S. Daniel Rajammal College of Education (Id: C-14422)",
  "Terasa College of Education (Id: C-14621)",
  "Thalapathy College of Education (Id: C-14496)",
  "Thanthai Hans Roever College of Education (Id: C-14526)",
  "Thavathiru Kundrakudi Adigalar College of Education for Women (Id: C-14583)",
  "The Best College of Education (Id: C-14506)",
  "The Kavery College of Education (Id: C-14504)",
  "The Kavery College of Education for Women (Id: C-14953)",
  "Thellar College of Education (Id: C-14905)",
  "Theni Kammavar Sangam College of Education (Id: C-14562)",
  "Thiagarajar College of Education (Id: C-14523)",
  "Thiagarajar College of Preceptors, (Aided) (Id: C-14516)",
  "Thiraviam College of Education (Id: C-14981)",
  "Thirumalai Srinivasa College of Education (Id: C-14426)",
  "Thirumal College of Education (Id: C-14577)",
  "Thiruvalluvar College of Education for Women (Id: C-14927)",
  "Thiyagi Dharmakkan Amirtham College of Education (Id: C-14877)",
  "T.K. Raja College of Education (Id: C-14625)",
  "T.S.M. College of Education (Id: C-14755)",
  "T.V.M. College of Education (Id: C-14667)",
  "TVS Teacher Training Academy (Id: C-14887)",
  "Umamaheswaranar College of Education (Id: C-14777)",
  "Universal College of Education (Id: C-15007)",
  "UPR College of Education (Id: C-14850)",
  "U.S.P.College of Education (Id: C-14630)",
  "Vaani College of Education (Id: C-14448)",
  "Vadaranyam College of Education (Id: C-14500)",
  "Vandayar College of Education (Id: C-14846)",
  "Varuvan Vadivelan College of Education (Id: C-14876)",
  "Vathsala Johnson College of Teacher Education (Id: C-14843)",
  "Vekkaliyamman College of Education (Id: C-14494)",
  "Velammal College of Education (Id: C-14997)",
  "Vel College of Education (Id: C-14676)",
  "Vellalar College of Education for Women (Id: C-15032)",
  "Vellore College of Education (Id: C-14693)",
  "Veludayar College of Education (Id: C-14640)",
  "Venkatesvara College of Education (Id: C-14724)",
  "Vestley College of Education (Id: C-14391)",
  "V.E.T. College of Education (Id: C-14419)",
  "VET College of Education (Id: C-15026)",
  "Vettri Vel College of Education (Id: C-14509)",
  "Vickram Teacher Training College (Id: C-14867)",
  "Victory College of Education (Id: C-14414)",
  "Vidayaa Vikas College of Education (Id: C-14660)",
  "Vidhya Sagar Women's College of Education (Id: C-14459)",
  "Vidhya Vikas Plus The Institute of Education (Id: C-14657)",
  "Vidyalaya College of Education (Id: C-14754)",
  "Vignesh College of Education (Id: C-14747)",
  "Vijay College of Education (Id: C-14665)",
  "Vinayaga Education College (Id: C-14638)",
  "Vinayaka College of Education (Id: C-14478)",
  "Virudhunagar M.S.P. Nadar College of Education (Id: C-14924)",
  "Vishnu Lakshmi B.Ed. College (Id: C-14821)",
  "Vishwa Bharathi College of Education (Id: C-14932)",
  "Vishwaksena College of Education (Id: C-14531)",
  "Viswa Bharathi College of Education (Id: C-14822)",
  "Vivekananda College of Education (Id: C-14874)",
  "Vivekananda College of Education (Id: C-14785)",
  "Vivekananda College of Education (Id: C-14950)",
  "Vivekananda College of Education (Id: C-14761)",
  "Vivekananda Vidyalaya College of Education (Id: C-14489)",
  "Vivekanandha College of Education for Women (Id: C-14697)",
  "V.J.P. College of Education (Id: C-14642)",
  "V.O.C. college of Education, (Aided) (Id: C-14764)",
  "V.P. Muthiah Pillai Meenakshi Ammal College of Education for Women (Id: C-14771)",
  "VPN College for Teacher Education (Id: C-14477)",
  "V.S. Isaac College of Education (Id: C-14629)",
  "Vysya College of Education (Id: C-14937)",
  "White Memorial college of Education (Id: C-14940)",
  "Wisdom College of Education (Id: C-14666)",
  "Yadava College of Education (Id: C-14679)",
  "College of Food and Dairy Technology, Koduvalli (Id: C-42740)",
  "College of Poultry Production and Management, Hosur (Id: C-48239)",
  "Madras Veterinary College, Chennai - 7 (Id: C-42741)",
  "Post Graduate Research Institute in Animal Sciences, Kattupakkam (Id: C-45930)",
  "Veterinary College and Research Institute, Namakkal (Id: C-42739)",
  "Veterinary College and Research Institute, Orathanad (Id: C-47826)",
  "Veterinary College and Research Institute, Tirunelveli (Id: C-47827)",
  "Adiparasakthi college of arts&Science,(Autonomous),G.B.Nagar,Kalavai-632506 (Id: C-36438)",
  "Al-Amen Arts & Science College, Somasipadi-606611 (Id: C-36413)",
  "ArakkonamArts&Science College,M.R.F.Nagar,Ichiputhur,Arakkonam-632 521 (Id: C-36444)",
  "Arcot Sri Mahalaalakshmi Women's institute ofmanagement &Computer Applications,Arcot-Arni Road,Villapakkam-632521 (Id: C-36455)",
  "ArcotSriMahalakshmiWomen\"s College,Arni M,Villapakkam-632 521ain Road (Id: C-36365)",
  "Aries arts And Science College for women,Karunkuzhi, Vadalur-607 303 (Id: C-36432)",
  "Arignar Anna Govt.Arts College,Cheyyar-602 407 (Id: C-36381)",
  "Arignar Anna Govt.Arts Collegefor Women,Walajapet-632513. (Id: C-36399)",
  "Arignar Anna Govt. Arts College, Villupuram-605 602 (Id: C-36395)",
  "Aruna Vidya Arts & science college,Kannakurukkai Village,Chegam Taluk (Id: C-36393)",
  "Arunesha College of Arts &Science for women,Venugopalapuram,Kilnathur,Post- 606 611 (Id: C-36404)",
  "Auxilium College (Autonomous)Gandhi Nagar,Katpadi-632 006 (Id: C-36394)",
  "Avalurpet Arts & Science College,Avalurpet Village,Gingee Taluk (Id: C-36366)",
  "Bharathi Women's Arts &Science College ,Thatghur,Kaalakurugchi-606 202 (Id: C-36382)",
  "BioStatistics Resource and Training Centre.Department of Biostatistics,Christian Medical College (Id: C-36400)",
  "B.Padmanabhan Jayanthimala College of Arts &Science ,Kozhai Nizangan,Srimushnam-608 703 (Id: C-36356)",
  "BWDA Arts & Science College,Kolliyangunam,Mailam,Tindivam-604 304 (Id: C-36385)",
  "C.Abdhul Hakkem College,Hakeem Nagar,Melvisharam-632 509 (Id: C-36377)",
  "Centre for Stem Cell Research ,Department of Biotechnology,Christian Medical College (Id: C-36387)",
  "C.Kandaswami Naidu College for Women,Cuddalore-607001 (Id: C-36452)",
  "CSM College of Arts &Science ,Erumanoor Road,Virudachalam-6-6 001 (Id: C-36416)",
  "Darul Uloom Latheefia College. (Id: C-36448)",
  "Dhivya Arts &Science College,Gingee road, Chetpat-606611 (Id: C-36421)",
  "D.K.M. College for Women,(autonomous )Sainathapuram-632 001 (Id: C-36376)",
  "Dr.M.G.R.Chokalingam Arts college Arcot Road,ACS Nagar(Irumbedu)-632 317 (Id: C-36423)",
  "DR R K SHANMUGAM COLLEGE OF ARTS & SCIENCE, VILLUPURAM (Id: C-47579)",
  "Dr.S.Ramadoss Arts & Science College ,Periyavadavadi-Virudachalam-606 104 (Id: C-36408)",
  "Government Arts College, Chidambaram-608 102 (Id: C-36358)",
  "Government Thirumagal Mill's College,Gudiyattam-632602 (Id: C-36447)",
  "Govt. Arts College Thiruvannamalai-606 603 (Id: C-36434)",
  "Holy Cross College of Arts &Science for Women,Molakarampatti-632 521 (Id: C-36390)",
  "Idaya College of Arts &Science for Women,Pudupalayam,Chengam-606 705 (Id: C-36384)",
  "Imayam Arts &Science college,Green Land, kanavaipudur village,NEW Town Post,Vaniyambadi Road,hengam-606 701 (Id: C-36437)",
  "Immaculate college for Women,Viriyur,devapandelam,Post,SankarapuramTaluk-606 402 (Id: C-36412)",
  "Indian Arts &Science college,Kariyandal -Kondam-606 802 (Id: C-36378)",
  "Indira Gandhi -Jayanthi women's College,Krishaveni Nagar,Kilgudalur,Melpaddi(Post),Tindivanam-604 307 (Id: C-36409)",
  "Indo-American College,Cheyyar-604407 (Id: C-36406)",
  "Islamiah college(autonomous),New town,Vaniyambadi-635 752 (Id: C-36370)",
  "IslamiahWomen'SCollege,!0,Bye-Pass Road,NewTown,Vaniyambadi-635752 (Id: C-36430)",
  "Jamia Darussalam Arabic College,Oomerabad (Id: C-36454)",
  "Jawaharlal Nehru College for Women,Pali Village,Ulunderpet Taluk (Id: C-36435)",
  "Jawahar Science College,Block -14,Neyveli-607 803 (Id: C-36360)",
  "Joseph Arts &Science College,Thirunavallur-607204 (Id: C-36354)",
  "Jothi's Vallimalai Road, Katpadi-632 007 (Id: C-36368)",
  "Kamban college of Arts and Science for women,Mathur.-606603 (Id: C-36367)",
  "Kaveripakkam college of Arts and Science CollegeKaveripakkam-632 508 (Id: C-36353)",
  "KIng Nandivarman college of Arts & Science,Thellar- 604406 (Id: C-36375)",
  "K.M.G.college of ARTS&SCIENCE ,R.S.ROAD,Ammananguppam,Gudiyatham-635 803 (Id: C-36372)",
  "Krishanasamy college of Science,Arts &Management for women,Nellikuppam High oad,S.Kumarapuram- (Id: C-36371)",
  "K.S.Raja Arts &Science College for Women,Cherapperattai-604 210 (Id: C-36441)",
  "Loyola College,Olaipadi village,Vettavalam-606 755 (Id: C-36352)",
  "Madarassa- E- Bakhiathus Salihath Arabic College,Vellore-632004 (Id: C-36397)",
  "Marappan Lakshiamma arts and Science College,(co-Ed)Kurumber-635652,Tirupattur taluk. (Id: C-36396)",
  "marudhar Kesari Jain College for Women,Marudhar Nagar,Chinnakallupalli,Vaniyambadi-635751 (Id: C-36362)",
  "Mazharul Uloom College,Ambur -635 802 (Id: C-36407)",
  "Mercury college of Arts &Science,Thandalam, KumbinipetPost,Arrakona-631 003m (Id: C-36424)",
  "M.M.E.S. Women's Arts &Science College,Hakeem Nagar,Melvisharam-632 509 (Id: C-36426)",
  "M.R.K.College of Arts & Science,pazhzchanallurANDPost,Kattumannarkudi-608 301 (Id: C-36414)",
  "Muthurangam Govt.Arts College (autonomous),Vellore-632002 (Id: C-36425)",
  "Periyar Arts College,Cuddalore-607 001 (Id: C-36401)",
  "RAAK Arts &Science College(c0-Ed),11 Perambi Road,Perambai,Villainaur post,VanurTaluk-605 110 (Id: C-36443)",
  "Rajeshwari College of Arts &science for women ,Bommapalayam (village&post),Vanur Taluk-605 104ge (Id: C-36405)",
  "Research Centre for Molecular Biology,Department of Biotechnology,Christian Medical College (Id: C-36379)",
  "R.T.G. Arts &Science college ,Behind C.C.Road,Ettivadi,Polur-606 907G> (Id: C-36440)",
  "run Krishna college of Arts &Science,Valaiyampattu Road,Chengam -6-6 701 (Id: C-36428)",
  "RUSHA Department ,Christian Medical College. (Id: C-36357)",
  "Sacred Heart College(autonomous)Thirupattur-635 601 (Id: C-36411)",
  "Sanghamam College of Arts And Science, Annamangalam ,Gingee taluk-604 210 (Id: C-36373)",
  "Saraswathi college of Arts & science,Konerikuppam,Mailam,Tindivanam-604 304 (Id: C-36410)",
  "SATHYA COLLEGE OF ARTS AND SCIENCE, KILLVISHRAM (Id: C-47518)",
  "Sathyam College of Arts &Science College, Sundakkapalayam Village,Kariyamangalam Post Chengam Taluk a Taluk (Id: C-36417)",
  "Shanmuga Industries arts &SCience college,(Co-Ed),Manalurpet road,604 401 (Id: C-36361)",
  "Shree Arumugham Arts & Science College,Raja Nagar,Vaithiyanaythapuram,Tholudur-606 303 (Id: C-36450)",
  "Shree Raghavendra Arts &Science College ,Keezhamoongiladi,Chidhambaram-608 102 (Id: C-36436)",
  "siddhar Sivagnanni Arts &Science college for Men,BommapalayamVillage&Post,Vanur Taluk-605 104 (Id: C-36445)",
  "SIGA College of Management and Computer Science,Kappiyampuliyur,Villupuram-605 601 (Id: C-36415)",
  "S K VELAYUTHAM WOMENs ARTS AND SCIENCE COLLEGE, KURINJIPADI (Id: C-47830)",
  "Sreemath Sivagnana Balaya Swamigal Tamil Arts &Science College ,Mailam-604 304 (Id: C-36419)",
  "Sri Akilandeshwari Women's College,ThindivanamHigh Way,Vandavasi-604408 (Id: C-36427)",
  "Sri Aravindar Arts &science College ,Pondy-Mailam Road,Sedarapet-605 111 (Id: C-36369)",
  "S.R.I.Arts & Science College, Birudur Village,Vandavasi Taluk-604408 (Id: C-36446)",
  "Sri Bharathivelu arts &Science Kalpattu,Sholinghur-631 102 (Id: C-36392)",
  "Sri Bharathi Women arts&Science,Arni-VelloreMain,Road,Kunnathur,Arni-632314 (Id: C-36359)",
  "Sri Lakshmi College of Arts & Science ,BangalamVillage,Thottiyam Post,Kallakurchi Taluk (Id: C-36403)",
  "Sri Sarada Mahavidyalayam Arts & Science College for women ,New Edikal ,Uludurpettai (Id: C-36418)",
  "Sri Vinayaga Colllege of Arts 7Science College,Virudhachalam Main ,Road,Ulundur pet- 606 107 (Id: C-36374)",
  "S.S.S college of Arts &ScienceandManagement,(co-ed)Bye-passRoad,Arcot-635 2503 (Id: C-36398)",
  "St.Joseph College of Arts & Science College,Autonomous),Cuddalore- 607001 (Id: C-36386)",
  "Sun Arts &Science College,Keeranoor,(V),Rajapalayam- 606 755 (Id: C-36431)",
  "Swami Vivekananda Arts &Science College,Lakshmipuram,Orathur X Road,Gingee Main Road-605 601 (Id: C-36453)",
  "Thevanai Ammal College for Women,(Autonomous),Chennai-Trichy Trunk Road,605 401 (Id: C-36433)",
  "Thiru. A.Govindasamy Govt.Arts College,Tindivanam-604 001 (Id: C-36389)",
  "Thiru Kolanchiyappar Govt.Arts College,Virudachalam-606001 (Id: C-36429)",
  "Thiruvalluvar Arts &Science College,Kurinjipadp-607 302 (Id: C-36449)",
  "Thiruvalluvar University college of Arts &Science ,E.V.N.Govt.Boys Higher SEcondary School,Krishanagiri Road,Gazhanayeganpatti,Tirupattur Taluk,Tirupattur-635 901aGd, (Id: C-36420)",
  "Thiruvalluvar University College of Arts &SCience,Panchayat Union Middle School,Kacharapalayam Road, Kallakuruchi-606 202 (Id: C-36351)",
  "Thiruvalluvar University College of Arts & Science ,Thennangur Village,Vandavasi Taluk-604 408 (Id: C-36364)",
  "Thiruvalluvar University College of Arts &Science,Thiruvannainallur,Tirukoilur-607 203 (Id: C-36380)",
  "Thiruvalluvar University PG Extension Centre ,Arignar Anna Govt.Arts College Campus (Id: C-36355)",
  "Tirukkoilur College of Arts &Science (co-ed) No.282,Asanur Road,Sandapet,Thirukkoilur-605 757 (Id: C-36442)",
  "Tirupattur Arts and Science College,SalaiNagar,VaniyambadiRoad,Tirupattur-635 506 (Id: C-36388)",
  "Vallalar Arts & Science College,Neyveli Main Road,Vadalur-607 303 (Id: C-36422)",
  "Valliammai College of Arts & Science ,Villupuram Main Road,Vadakarai Thazhanoor,tirukoilur-605 752 (Id: C-36391)",
  "Vanavil Arts &Science College,Thayappa Gounder Street,Natrampaal-635 852 (Id: C-36402)",
  "Voorhees College,Vellore-632001 (Id: C-36383)",
  "Wisdom College of Arts &Science (co-ed)Annakkoor,Cheyyar Taluk (Id: C-36439)",
  "VIT University (Chennai Campus) (Id: C-49441)",
  "Aarupadai Veedu Institute of Technology (Id: C-10224)",
  "Vinayaka Mission's Annapoorana College of Nursing (Id: C-10218)",
  "Vinayaka Mission's College of Pharmacy (Id: C-10216)",
  "Vinayaka Mission's College of Physiotherapy (Id: C-10220)",
  "Vinayaka Mission's Homeopathic Medical College (Id: C-10225)",
  "Vinayaka Mission's Kirupananda Variyar Arts and Science College (Id: C-10222)",
  "Vinayaka Mission's Kirupananda Variyar Engineering College (Id: C-10214)",
  "Vinayaka Mission's Kirupananda Variyar Medical College and Hospital (Id: C-10219)",
  "Vinayaka Mission's Sankarachariyar Dental College (Id: C-10221)"
]