[
  "Agricultural College, Aswaraopet (Id: C-26380)",
  "Agricultural College, Jagtial (Id: C-26376)",
  "Collage of Agriculture, Rajendranagar (Id: C-26372)",
  "College of Home Science, Hyderabad (Id: C-26370)",
  "Anantalakshmi Govt. Ayurvedic College, Warangal (Id: C-30470)",
  "Angel College of Nursing, Khammam (Id: C-30490)",
  "Apex College of Nursing, Hyderabad (Id: C-30390)",
  "Apollo College of Nursing, Hyderabad (Id: C-30418)",
  "Apollo College of Physiotherapy, Hyderabad (Id: C-30372)",
  "Army College of Dental Sciences, Secunderabad (Id: C-30603)",
  "Aware College of B.Sc MLT, Hyderabad (Id: C-30430)",
  "Aware College of Nursing, Hyderabad (Id: C-30539)",
  "Balaji Inst. of Nursing, Warangal (Id: C-30565)",
  "Bhaskar Medical College, Yenkapally (Id: C-30562)",
  "Care College of Nursing, Hyderabad (Id: C-30618)",
  "Care Institute of Medical Sciences College of Physiotherapy, Hyderabad (Id: C-30569)",
  "Care Nampally College of Nursing, Hyderabad (Id: C-30424)",
  "Chalmeda Ananda Rao Institute of Medical Sciences, College of Nursing,Bommakal (Id: C-30681)",
  "Chalmeda Ananda Rao Institute of Medical Sciences, Karimnagar (Id: C-30472)",
  "Chandana B.Sc Medical Lab Technology, Nalgonda (Id: C-30640)",
  "Chandana College of Nursing, Suryapet (Id: C-30396)",
  "DCMS College of Physiotherapy, Hyderabad (Id: C-30407)",
  "Deccan College of Medical Sciences, Hyderabad (Id: C-30644)",
  "Deepthi College of Nursiing, Nalgonda (Id: C-30672)",
  "Devi College of Medical Lab Technology, Hyderabad (Id: C-30332)",
  "Devs College of Nursing, Keesara (Id: C-30379)",
  "Devs Homoeopathy Medical College & Hospital, Keesara (Id: C-30688)",
  "Devs Yoga & Naturopathy College, Keesara (Id: C-30598)",
  "Dr. B.R. Ambedkar Paramedical Sciences, Nalgonda (Id: C-30568)",
  "Dr. B.R.K.R. Govt. Ayurvedic College, Hyderabad (Id: C-30461)",
  "Dr. VRK Women's Medical College, Aziznagar (Id: C-30628)",
  "Duragabai Deshmukh Hospital & Research Centre, College of Physiotheraphy, Hyderabad (Id: C-30634)",
  "Durgabhai Deshmukh College of B.Sc Nursing, Hyderabad (Id: C-30700)",
  "Eashwaribai Memorial College of Nursing, Secunderabad (Id: C-30532)",
  "Gandhi Medical College (B.Sc MLT), Secunderabad (Id: C-30516)",
  "Gandhi Medical College, Secunderabad (Id: C-30606)",
  "Gandhi Naturopathy Medical College, Hyderabad (Id: C-30326)",
  "Global Kasturiba College of Nursing, Hyderabad (Id: C-30511)",
  "Government College of Nursing, Hyderabad (Id: C-30519)",
  "Government Dental College, Hyderabad (Id: C-30448)",
  "Govt. Nizamia Tibbi College, Hyderabad (Id: C-30590)",
  "Gowtami College of Nursing, Hyderabad (Id: C-30441)",
  "Green Lead College of Nursing, Secunderabad (Id: C-30547)",
  "Holy Mary College of Nursing, Hyderabad (Id: C-30399)",
  "Image Madhapur College of Nursing, Yapral (Id: C-30643)",
  "Indian College of Nursing, Mahabubnagar (Id: C-30501)",
  "Indo American College of Nursing, Hyderabad (Id: C-30506)",
  "Innova College of Nursing, Hyderabad (Id: C-30412)",
  "Institute of Preventive Medicine Public Health Lab & Food (H) Administration, Hyderabad (Id: C-30347)",
  "Jaya College of B.Sc Nursing, Hanumakonda (Id: C-30536)",
  "Jaya College of Nursing, Hyderabad (Id: C-30495)",
  "Jaya College of Nursing, Warangal (Id: C-30685)",
  "Jaya Inst. of Medical Lab Technology B.Sc MLT, Warangal (Id: C-30416)",
  "JMJ College of Nursing, Hyderabad (Id: C-30330)",
  "J.S.P.S. Govt. Homoeo Medical College, Hyderabad (Id: C-30579)",
  "Kakatiya College of Physiotherapy, Warabgal (Id: C-30594)",
  "Kakatiya Medical College, Warangal (Id: C-30626)",
  "Kaktiya Medical College (B.Sc MLT), Warangal (Id: C-30605)",
  "Kalanjali College of Nursing, Hyderabad (Id: C-30508)",
  "Kamineni College of Nursing, Hyderabad (Id: C-30492)",
  "Kamineni Institute of Paramedical Sciences (B.Sc MLT), Hyderabad (Id: C-30481)",
  "Kamineni Inst. of Dental Sciences, Narketpally (Id: C-30517)",
  "Kamineni Inst. of Medical Sciences, College of Nursing, Narketpally (Id: C-30689)",
  "Kamineni Inst. of Medical Sciences, Narketpally (Id: C-30438)",
  "Kamineni Inst. of Paramedical Sciences, Nalgonda (Id: C-30377)",
  "KIMS College of B.Sc Nursing, Hyderabad (Id: C-30321)",
  "Kinnera College of Nursing, Khammam (Id: C-30393)",
  "Krishna Institute of Medical Sciences College of Physiotherapy, Secunderabad (Id: C-30392)",
  "Krishna Institute of Medical Sciences (KIMS) College of B.Sc MLT, Hyderabad (Id: C-30406)",
  "Laxmi College of Nursing, Hyderabad (Id: C-30466)",
  "Mamata College of Medical Laboratory Technology, Khammam (Id: C-30421)",
  "Mamata College of Nursing, Khammam (Id: C-30342)",
  "Mamata Dental College, Khammam (Id: C-30540)",
  "Mamata Medical College, Khammam (Id: C-30582)",
  "Maruthi College of Nursing, Bhadrachalam (Id: C-30683)",
  "Maruthi Paramedical Academy College of Nursing, Bhadrachalam (Id: C-30459)",
  "Medha Inst. of Nursing & Diagnostic Sceicnes, Hanmakonda (Id: C-30622)",
  "Mediciti College of Nursing, Medchal (Id: C-30543)",
  "Mediciti Inst. of Medical Sciences, Ghanapur (Id: C-30422)",
  "Medwin College of Nursing, Hyderabad (Id: C-30384)",
  "Meghana Inst. of Dental Sciences, Nizamabad (Id: C-30690)",
  "MNR Ayurvedic Medical College, Sangareddy (Id: C-30439)",
  "MNR College of Nursing, Sangareddy (Id: C-30391)",
  "MNR Dental College, Sangareddy (Id: C-30331)",
  "MNR Medical College, Sanagareddy (Id: C-30619)",
  "Modern Institute of Physical Medicine & Rehabilitation, Hyderabad (Id: C-30488)",
  "Mother Krishnabhai College of Nursing, Hyderabad (Id: C-30486)",
  "Mother Theresa College of B.Sc Nursing, Hyderabad (Id: C-30469)",
  "Nalla Reddy College of Nursing, Hyderabad (Id: C-30346)",
  "National Institute of Nutrition, Hyderabad (Id: C-30668)",
  "Navodaya College of Nursing, Mahabubnagar (Id: C-30368)",
  "Navodaya College of Physiotherapy, Mahabubnagar (Id: C-30666)",
  "Osmania Medical College (B.Sc MLT), Hyderabad (Id: C-30445)",
  "Osmania Medical College, Hyderabad (Id: C-30588)",
  "Owaisi College of Nursing, Hyderabad (Id: C-30541)",
  "Panineeya Mahavidyala Institute of Dental Sciences and Research Center, Hyderabad (Id: C-30413)",
  "PDS Institute of Physiotherapy, Hyderabad (Id: C-30351)",
  "PIER GIORGIO FRASSATI College of Nursing, Suryapet (Id: C-30599)",
  "PIMTECH College of B.Sc MLT, Khammam (Id: C-30641)",
  "Pioneer College of Nursing, Hyderabad (Id: C-30420)",
  "Pragathi College of Physiotherapy, Nizamabad (Id: C-30498)",
  "Prathima College of Nursing, Karimnagar (Id: C-30474)",
  "Prathima Institute of Medical Sciences (B.Sc MLT), Karimnagar (Id: C-30341)",
  "Prathima Institute of Medical Sciences, Karimnagar (Id: C-30564)",
  "Princess Durru Shehvar College of MLT, Hyderabad (Id: C-30557)",
  "Princess Duru Shehvar College of Nursing, Hyderabad (Id: C-30434)",
  "Pulipati College of Nursing, Konizerla (Id: C-30455)",
  "Pulipati Prasad college of Nursing, Khammam (Id: C-30343)",
  "Rainbow College of Nursing, Hyderabad (Id: C-30696)",
  "Rajiv Institute of Medical Sciences, (Id: C-30515)",
  "Rohini College of Nursing, Hanumakinda (Id: C-30389)",
  "Sai Institute of College of Physiotherapy (Id: C-30682)",
  "Sai Institute of Health Sciences, Karimnagar (Id: C-30425)",
  "Sanjeevani College of Physiotherapy, Hyderabad (Id: C-30556)",
  "Santosh College of Nursing, Karimnagar (Id: C-30691)",
  "Shaankary College of Nursing, Nizamabad (Id: C-30338)",
  "Shaarvani Inst. of Medical Sciences, Warangal (Id: C-30545)",
  "Shadan College of Medical Lab Technology, Hyderabad (Id: C-30431)",
  "Shadan Institute of Medical Sciences, Hyderabad (Id: C-30337)",
  "Shadan Inst. of Medical Sciences College of Nursing, Hyderabad (Id: C-30549)",
  "Shadhan Institute of Medical Sciences Teaching Hospital and Research Center, College of Physiotheraphy,Hyderabad (Id: C-30320)",
  "Shanthi College of Nursing, Hyderabad (Id: C-30454)",
  "Sigma College of Nursing, Hyderabad (Id: C-30402)",
  "Sita Ramaiah College of Nursing, Hyderabad (Id: C-30514)",
  "Sivananda College of Nursing, Karimnagar (Id: C-30487)",
  "Sneha College of Nursing, Nalgonda (Id: C-30479)",
  "Sree Ratna College of Physiotherapy, Hyderabad (Id: C-30593)",
  "Sri Bhavana College of Nursing, Nalgonda (Id: C-30429)",
  "Sri Ramachandra College of Nursing, Nizamabad (Id: C-30553)",
  "Sri Sai College of Dental Surgery, Vikarabad (Id: C-30370)",
  "Sri Sai College of Nursing, Nalgonda (Id: C-30657)",
  "Sri Sai College of Physiotheraphy, Nalgonda (Id: C-30365)",
  "Sri Satyalaxmi College of Nursing, Hyderabad (Id: C-30356)",
  "Sri Surya College of Medical Lab Technology, Hyderabad (Id: C-30662)",
  "Sri Surya College of Nursing, Hyderabad (Id: C-30354)",
  "Sri Venkata Sai College of Medical Lab technology, Mahabubnagar (Id: C-30458)",
  "Sri Venkata Sai College of Nursing, Mahabubnagar (Id: C-30467)",
  "SRK Memorial College of Nursing, Mancherial (Id: C-30573)",
  "SRM Institute of Medical Sciences & Technology, Karimnagar (Id: C-30621)",
  "St. Ann's College of Nursing, Hanumakonda (Id: C-30585)",
  "St. John College of Nursing, Warangal (Id: C-30419)",
  "Susruta Institute of Physical Medicine and Rehabilitation, Hyderabad (Id: C-30345)",
  "SVS Dental College, Mahabubnagar (Id: C-30527)",
  "SVS Medical College, Mahabubnagar (Id: C-30671)",
  "Swarnanjali College of Nursing, Khammam (Id: C-30636)",
  "Thirumala College of Medical Lab Technology, Nizamabad (Id: C-30695)",
  "Thirumala College of Nursing, Armoor (Id: C-30678)",
  "Thirumala College of Physiotherapy, Nizamabad (Id: C-30491)",
  "T.K.R College of Nursing, Hyderabad (Id: C-30638)",
  "Vaagdevi Ayurvedic College, Warangal (Id: C-30595)",
  "Vaagdevi College of Physiotheraphy, Warangal (Id: C-30482)",
  "Vaageswari Ayurvedic Medical College, Karimnagar (Id: C-30697)",
  "Vijaya Health Care Academic Society College of Nursing, Kushaiguda (Id: C-30383)",
  "Vijay Marie College of Nursing, Hyderabad (Id: C-30367)",
  "Yashoda College of Nursing, Hyderabad (Id: C-30339)",
  "College of Horticultural/ Mojerla (Id: C-22057)",
  "College of Horticultural/ Rajendranagar (Id: C-22056)",
  "GITAM off Campus Centre, Rudraram (Id: C-27592)",
  "Faculty of Law (Id: C-43893)",
  "Faculty of Science & Technology (Id: C-43894)",
  "ICFAI Business School, Hyderabad (Faculty of Management) (Id: C-43895)",
  "INDIAN STATISTICAL INSTITUTE, HYDERABAD (Id: C-47463)",
  "Aarushi Group of Institutions (Id: C-19876)",
  "Abdul Kalam Institute of Technological Science (Id: C-19892)",
  "ACE Engineering college (Id: C-19720)",
  "Adam's Engineering college (Id: C-19652)",
  "Adusumalli Vijaya College of Engineering & Research Centre (Id: C-27590)",
  "Adusumalli Vijaya Institute of Technology & Research Centre (Id: C-19592)",
  "Aizza College of Engineering & Technology (Id: C-19936)",
  "ALEXANDER COLLEGE, MUGDUMPOOR (Id: C-44951)",
  "Al-Habeeb College of Engineering & Technology (Id: C-19840)",
  "Amina Institute of Technology (Id: C-19664)",
  "A.M.R Institute of Technology (Id: C-19943)",
  "Anasuya Devi Institute of Technology & Science (Id: C-36481)",
  "Anjamma Agi Reddy Engineering College for Women (Id: C-19601)",
  "Annamacharya Institute of Technology & Sciences (Id: C-19623)",
  "Anu Bose Institute of Technology (Id: C-19776)",
  "Anurag College of Engineering (Id: C-19509)",
  "Anurag Engineering College (Id: C-19538)",
  "Anurag Group of Institutions (Id: C-19747)",
  "Anurag Pharmcy College (Id: C-19925)",
  "Anwarul Uloom College of Engineering & Technology (Id: C-19794)",
  "Anwarul -Uloom College of Pharmacy (Id: C-19703)",
  "Apex Engineering College (Id: C-19508)",
  "APOORVA INSTITUTE OF MANAGEMENT & SCIENCES, BHUPATHIPOOR (Id: C-44952)",
  "Aravindaksha Educational Society's Group of Institutions (Id: C-19864)",
  "Arjun College of Technology & Science (Id: C-19572)",
  "Arkay College of Engineering & Technology (Id: C-27591)",
  "Aryabhata Institute of Technology & Science (Id: C-19660)",
  "Ashok Institute of Engineering & Technology (Id: C-19858)",
  "Asifia College of Engineering & Technology (Id: C-19838)",
  "Aurora's Engineering College (Id: C-19619)",
  "Aurora's Scientific and Technological Institute (Id: C-19556)",
  "Aurora's Scientific & Research Academy (Id: C-19573)",
  "Aurora's Technological & Research Institute (Id: C-19852)",
  "Avanthi Institute of Engineering & Technology (Id: C-19730)",
  "Avanthi Institute of Pharmaceutical Sciences (Id: C-19789)",
  "Avanthi's PG & Research Academy (Id: C-27171)",
  "Avanthi's Scientific Technological & Research Academy (Id: C-19649)",
  "AVN Institute of Engineering & Technology (Id: C-19614)",
  "Ayyan College of Engineering & Technology (Id: C-19811)",
  "Azad College of Engineering and Technology (Id: C-19521)",
  "Azad College of Engineering for women (Id: C-19721)",
  "Azad College of Pharmacy (Id: C-19578)",
  "Balaji Institute of Engineering & Science (Id: C-19581)",
  "Balaji Institute of Management Sciences (Id: C-19584)",
  "Balaji Institute of Technology & Science (Id: C-19874)",
  "Bandari srinivas College of Engineering & Technology (Id: C-19912)",
  "Bandari Srinivas Institute of Technology (Id: C-19539)",
  "Basavaraju Krishna Bai Educational Society (Id: C-19770)",
  "Bharat Institute of Engineering & Technology (Id: C-19637)",
  "Bharat Institute of Technology & Science for Women (Id: C-19725)",
  "Bharthat Institute of Technology (Id: C-19924)",
  "Bhaskar Engineering College (Id: C-19823)",
  "Bhaskar Pharmacy College (Id: C-19656)",
  "Bhoji Reddy Engineering College for Women (Id: C-19576)",
  "Bojjam Narasimhulu Pharmacy College for Women (Id: C-19723)",
  "Bomma Institute of Informatics (Id: C-19797)",
  "Bomma Institute of Pharmacy (Id: C-19724)",
  "Bomma Institute of Technology Science (Id: C-19733)",
  "Brilliant Group of Institutions (Id: C-19849)",
  "Brilliant Institute of Engineering & Technology (Id: C-19758)",
  "BVRIT Hyderabad (Id: C-48145)",
  "CHILKUR BALAJI COLLEGE OF COMPUTER SCIENCES, RVS NAGAR (Id: C-44948)",
  "Chilkur Balaji Institute of Technology (Id: C-19702)",
  "Chillukur Balaji College of Pharmacy (Id: C-19549)",
  "Christu Jyothi Institute of Technology & Sciences (Id: C-19716)",
  "City women College of Engineering & Technology (Id: C-19551)",
  "CM College of Pharmacy (Id: C-19921)",
  "CM Engineering College (Id: C-19752)",
  "CMR College of Engineering & Technology (Id: C-19735)",
  "CMR College of pharmacy (Id: C-19611)",
  "CMR Engineering College (Id: C-19760)",
  "CMR Institute of Technology (Id: C-19837)",
  "CMR Technological Education Society Group of Institutions (Id: C-19705)",
  "CM School of Business Management (Id: C-27187)",
  "CRV Institute of Technology & Science (Id: C-19777)",
  "CVM College of Pharmacy (Id: C-19910)",
  "CVR College of Engineering (Id: C-19607)",
  "Daripally Anantharamulu College of Engineering & Technology (Id: C-19595)",
  "Deevana College of Pharmacy (Id: C-19617)",
  "Dhanvanthri College of Pharmaceutical Scienes (Id: C-19886)",
  "Dhanvanthri Institute of Pharmaceutical Sciences (Id: C-36343)",
  "DRK College of Engineering & Technology (Id: C-19683)",
  "DRK Institute of Science & Technology (Id: C-19930)",
  "Dr. Paul Raj Engineering College (Id: C-19786)",
  "Dr. VRK College of Engineering & Technology (Id: C-19654)",
  "Dr. VRK Women's College of Engineering & Technology (Id: C-19950)",
  "DVR College of Engineering & Technology (Id: C-19807)",
  "Ellenki College of Engineering For Women (Id: C-19518)",
  "Ellenki College of Engineering & Technology (Id: C-19782)",
  "EVR College of Engineering & Technology (Id: C-19875)",
  "Ganapathi College of Engineering (Id: C-19688)",
  "Ganapathi Engineering College (Id: C-19825)",
  "Gandhi Academy of Technology Education (Id: C-19728)",
  "Ganga Pharmacy College (Id: C-19548)",
  "Gayatri Institute of Pharmaceutical Sciences & Research Centre (Id: C-27587)",
  "Gayatri Institute of Technology & Sciences (Id: C-19809)",
  "Geetanjali College of Engineering & Technology (Id: C-19593)",
  "Geetanjali Institute of Science & Technology (Id: C-19877)",
  "Geethanjali College of Pharmacy (Id: C-27588)",
  "Global College of Pharmacy (Id: C-19762)",
  "Global Group of Institutions (Id: C-19708)",
  "Global Institute of Engineering & Technology (Id: C-19722)",
  "G.Narayanamma Institute of Technology & Science for Women (Id: C-19707)",
  "Gnyana Saraswati College of Engineering & Technology (Id: C-19603)",
  "Goka Raju Ranga Raju Institute of Engineering & Technology (Id: C-19534)",
  "Gopal Reddy College of Engineering & Technology (Id: C-19517)",
  "Greater Hyderabad Institue of Pharmacy (Id: C-19680)",
  "Green Fort Engineering College (Id: C-19695)",
  "Gurram Balanarasaiah Institute of Pharamcy (Id: C-19843)",
  "Guru Nanak Engineering College (Id: C-19515)",
  "Gurunanak Institute of Pharmacy (Id: C-19673)",
  "Guru Nanak Institute of Technology (Id: C-19531)",
  "Gyana Jyothi College of Pharmacy (Id: C-27589)",
  "Harsitha Group of Institutions (Id: C-19815)",
  "Hasvita Institute of Engineering & Technology (Id: C-19742)",
  "Hasvita Institute of Management & technology (Id: C-19598)",
  "Hasvita Institute of Science & Technology (Id: C-19669)",
  "Hi-Point College of Engineering & Technology (Id: C-19586)",
  "Hi-Tech College of Engineering & Technology (Id: C-19604)",
  "HOLY MARY INSTITUTE OF MANAGEMENT STUDIES (FORMERLY VELANGINI INSTITUTE OF MANAGEMENT), BOGARAM (Id: C-44964)",
  "Holy Mary Institute of Technology (Id: C-19894)",
  "Holy Mary Institute of Technology & Science (Id: C-19909)",
  "Holy Mary Institute of Technology & Science College of Pharmacy (Id: C-36347)",
  "HOLY MARY INSTITUTE OF TECHNOLOGY & SCIENCE (MCA), BOGARAM (Id: C-44965)",
  "Horizon Collge of Pharamcy (Id: C-19799)",
  "Hyderabad Institute of Technology & Management (Id: C-19850)",
  "ICON INSTITUTE OF MANAGEMENT STUDIES, BIBINAGAR (Id: C-44958)",
  "Immanuel Business School (Id: C-48149)",
  "Indur Institute of Engineering & Technology (Id: C-19929)",
  "Institute of Aeronautical Engineering (Id: C-19706)",
  "Jagruti Institute of Engineering & Technology (Id: C-19711)",
  "Jawaharlal Nehru Institute of Technology (Id: C-19821)",
  "Jayamukhi Institute of Pharmaceutical Sciences (Id: C-19769)",
  "Jayamukhi Institute of Technological Sciences (Id: C-19596)",
  "Jaya Prakash Narayan College of Engineering (Id: C-19643)",
  "Jayaprakash Narayan Educational Society Group of Institutions (Id: C-19756)",
  "JB Institute of Engineering & Technology (Id: C-19615)",
  "Jesus PG College (Id: C-19536)",
  "J J College of Pharamcy (Id: C-19836)",
  "J.J Institute of Information (Id: C-19583)",
  "JNTUH College of Engineering Hyderabad (Id: C-19913)",
  "JNTUH College of Engineering Jagityala (Id: C-19872)",
  "JNTUH College of Engineering Manthani (Id: C-19808)",
  "JNTUH College of Engineering Sultanpur (Id: C-48148)",
  "Joginapally B.R Pharmacy College (Id: C-19510)",
  "Joginpally B.R Engineering College (Id: C-19540)",
  "Joseph Sriharsha & Mary Indraja Educational Society's St. Mary's Group of Institutions (Id: C-19880)",
  "Jyothisamithi College of Engineering & Technology (Id: C-19795)",
  "Jyothisamithi Institute of Technological Science (Id: C-19712)",
  "Jyothisamithi Institute of Technological Technology & Science (Id: C-19868)",
  "Jyothismathi College of Pharmacy (Id: C-19685)",
  "Jyothismathi Institute of Pharmaceutical Sciences (Id: C-19642)",
  "Kakatiya Institute of Management Studies(MBA) (Id: C-19574)",
  "Kakatiya Institute of Technolgy & Science for Women (Id: C-19589)",
  "Kamakshi College of Engineering & Technology (Id: C-19749)",
  "Kamala Institute of Technology & Science (Id: C-19928)",
  "Kamareddy Engineering College (Id: C-35909)",
  "Kasireddy Narayan Reddy College of Engineering & Research (Id: C-19693)",
  "KBR Engineering College (Id: C-19783)",
  "Keshav Memorial Institute of Technology (Id: C-19946)",
  "K.G Reddy College of Engineering & Technology (Id: C-19579)",
  "Khader Memorial College of Engineering & Technology (Id: C-19701)",
  "Khammam Institute of Technology & Science (Id: C-19567)",
  "KITE College of Professional Engineering Sciences (Id: C-19883)",
  "KITE Women's College of Professional Engineering Sciences (Id: C-19686)",
  "KLR College of Engineering & Technology (Id: C-19810)",
  "Kodada Institute of Technology &Science for Women (Id: C-19681)",
  "Kommuri Pratap Reddy Institute of Technology (Id: C-19602)",
  "Kottam Institute of Pharmacy (Id: C-19599)",
  "Krishna Murthy Institute of Technology & Engineering (Id: C-19772)",
  "Ksatriya College of Engineering (Id: C-19781)",
  "K.V.K College of Pharmacy (Id: C-19663)",
  "Kyasa Institute of Management Studies (Id: C-48147)",
  "Laksya Institute of Management (Id: C-19822)",
  "Lalitha College of Pharmacy (Id: C-35910)",
  "Laqshya Institute of Technology & Sciences (Id: C-19661)",
  "Learner's Land College of Pharamacy (Id: C-19704)",
  "Lords Institute of Engineering & Technology (Id: C-19616)",
  "Lotus Institute of Management Studies (Id: C-19791)",
  "Lumbini Group of Institutions (Id: C-48150)",
  "Madhira College of Engineering (Id: C-19638)",
  "Madhira Institute of Technology and Sciences (Id: C-19778)",
  "Madhira Institute of Technology & Sciences (Id: C-19798)",
  "Mahatma Gandhi Institute of Technology (Id: C-19793)",
  "Mahaveer Institute of Science &Technology (Id: C-19608)",
  "Maheswara College of Pharmacy (Id: C-19514)",
  "Maheswara Engineering College (Id: C-19580)",
  "Maheswara Institute of Pharmacy (Id: C-19621)",
  "Maheswara Institute of Technology (Id: C-19779)",
  "MAK COLLEGE OF PHARMACY, CHILKOOR (Id: C-44967)",
  "Malla Reddy College of Engineering for women (Id: C-19764)",
  "Malla Reddy College of Engineering & Technology (Id: C-19871)",
  "Malla Reddy Engineering College (Id: C-19830)",
  "Malla Reddy Engineering College for women (Id: C-19759)",
  "Malla Reddy Institute of Business Management (Id: C-19828)",
  "Malla Reddy Institute of Engineering and Technology (Id: C-19562)",
  "Malla Reddy Institute of Management & Technology (Id: C-19862)",
  "Malla Reddy Institute of Pharmaceutical Sciences (Id: C-19885)",
  "Malla Reddy Institute of Technology (Id: C-19734)",
  "Malla Reddy Institute of Technology & Sciences (Id: C-19785)",
  "Malla Reddy PG College (Id: C-27179)",
  "Mannan Institute of Science & Technology (Id: C-19675)",
  "Marconi Institute of Technology (Id: C-19884)",
  "Marri Educational Society's Marri Laxman Reddy Institute of Technology and Management (Id: C-19922)",
  "Matrix Institute of Technology (Id: C-19523)",
  "M.C.Gupta College of Business Management (Id: C-48146)",
  "Medak College of Engineering & Technology (Id: C-19903)",
  "Medak Institute of Technology & Pharmacy (Id: C-19870)",
  "Medha College of Engineering (Id: C-19620)",
  "Medha Institute of Science & Technology (Id: C-19863)",
  "Megha Institute of Engineering & Technology for women (Id: C-19916)",
  "Mina Institute of Engineering & Technology for Women (Id: C-19666)",
  "MLR Institute of Pharmacy (Id: C-19846)",
  "MLR Institute of Technology (Id: C-19753)",
  "M.N Rao Women's Engineering College (Id: C-19561)",
  "MNR College of Engineering & Technology (Id: C-19624)",
  "Moghal College of Engineering & Technology (Id: C-19895)",
  "Mohammadiya Institute of Technology (Id: C-19645)",
  "Mona College of Engineering & Technology (Id: C-19751)",
  "Moonray Institute of Pharmaceutical Sciences (Id: C-19923)",
  "Mother Theresa College of Engineering & Technology (Id: C-19677)",
  "Mother Theresa Institute of Science & Technology (Id: C-19901)",
  "Mother Theresa Pharmacy College (Id: C-19504)",
  "MRM College of Pharamacy (Id: C-19507)",
  "MRR college of B.Pharmacy (Id: C-19832)",
  "Mumtaz College of Engineering & Technology (Id: C-19717)",
  "Murthy Institute of Technology & Sciences (Id: C-19612)",
  "Nagarjuna Institute of Technology & Science (Id: C-19755)",
  "Nagole Institute of Technology & Science (Id: C-19691)",
  "NALANDA COLLEGE OF PHARMACY, CHARLAPALLY (Id: C-44959)",
  "Nalgonda Institute of Technology & Science (Id: C-19512)",
  "Nalla Malla Reddy Engineering College (Id: C-19609)",
  "Nalla Narasimha Reddy Education Society Group of Institutions (Id: C-19726)",
  "Narasimha Reddy Engineering College (Id: C-27180)",
  "Nava Bharat Institute of Pharmaceutical and Medical Sciences (Id: C-19568)",
  "Nawab Shah Alam Khan College of Engineering (Id: C-19565)",
  "Netaji Institute of Engineering & Technology (Id: C-19790)",
  "Netaji School of Business Management (Id: C-48151)",
  "Nethaji Institute of Pharmaceutical Sciences (Id: C-19768)",
  "New Netaji Institute of Technology (Id: C-19651)",
  "Nexus College of Science & Technology (Id: C-19918)",
  "Nigama Engineering College (Id: C-19835)",
  "Nishitha College of Engineering & Technology (Id: C-19610)",
  "Nizam Institute of Engineering & Technology (Id: C-19606)",
  "Nizam Institute of Pharmacy (Id: C-19634)",
  "Nobel College of Engineering & Technology for Women (Id: C-19784)",
  "Noor College of Engineering & Technology (Id: C-19792)",
  "Nova College of Engineering & Technology (Id: C-19731)",
  "Nova College of Pharmaceutical Education and Research (Id: C-27185)",
  "Nova Group of Institutions (Id: C-19787)",
  "NOVA PG COLLEGE (MBA), JAFFERGUDA (Id: C-44968)",
  "NRI Institute of Technology (Id: C-19819)",
  "Padmasri Dr. B.V Raju Institute of Technology (Id: C-19569)",
  "Panineeya Institute of Technology & Science (Id: C-19829)",
  "Pathfinder Engineering College (Id: C-19709)",
  "Patlolla Ramakrishna Reddy College of Pharmacy (Id: C-19729)",
  "P.Indra Reddy Memorial Engineering College (Id: C-19588)",
  "Pragathi Pharmacy College (Id: C-19847)",
  "Prasad Engineering College (Id: C-19535)",
  "Prasad Institute of Pharmaceutical Sciences (Id: C-19657)",
  "Prathap Narender Reddy College of Pharmacy (Id: C-19893)",
  "Prathishtha Institute of Pharmaceutical Sciences (Id: C-19938)",
  "Princeton College of Engineering & Technology (Id: C-19953)",
  "Princeton College of Pharmacy (Id: C-19889)",
  "Princeton Institute of Engineering & Technology For Women (Id: C-19848)",
  "PRIYADARSHINI INSTITUTE OF SCIENCE & TECHNOLOGY, CHINA KANJARLA (Id: C-44956)",
  "Procadence Institute of Pharmaceitical Sciences (Id: C-19818)",
  "Prof. Rama Reddy College of Engineering & Technology (Id: C-19655)",
  "Progressive Engineering College (Id: C-19857)",
  "PRRM College of Pharmacy (Id: C-19665)",
  "PRRM Engineering College (Id: C-19813)",
  "Pujya Shri Madhavanji College of Engineering & Technology (Id: C-19552)",
  "Pujya Shri Madhavanji Institute of Science & Technology (Id: C-19896)",
  "Pulipati Prasad Institute of Technology & Science & Technology (Id: C-19888)",
  "Pulla Reddy Engineering College (Id: C-19627)",
  "Pulla Reddy Institute of Pharmacy (Id: C-27186)",
  "Pulla Reddy Institute of Technology (Id: C-27181)",
  "Raja Mahendra College of Engineering (Id: C-19529)",
  "Ramananda Tirtha Engineering College (Id: C-19816)",
  "Ramappa Engineering College (Id: C-19774)",
  "RGR Siddhanthi College of Pharmacy (Id: C-19546)",
  "Rishi M.S. Institute of Engineering & Technology for Women (Id: C-19737)",
  "RKLK PG College (Id: C-19715)",
  "Rousseau Institute of Management Studies (Id: C-19644)",
  "Royal Institute of Technology & Science (Id: C-19658)",
  "RRS College of Engineering Technology (Id: C-19577)",
  "RVR Institute of Engineering & Technology (Id: C-19692)",
  "Sahaja Institute of Technology & Sciences (Id: C-19881)",
  "Sahaja School of Business (Id: C-36482)",
  "Sahasra College of Engineering for Women (Id: C-35082)",
  "Sai Pranavi College of Pharmacy (Id: C-19855)",
  "Sai Spurthy Institute of Technology (Id: C-19890)",
  "Sai Sudhir Institute of Engineering & Technology for Women (Id: C-19559)",
  "Samskruthi Faculty Business Management (Id: C-19887)",
  "Samskruti College of Engineering & Technology (Id: C-19771)",
  "Samskruti College of Pharmacy (Id: C-19679)",
  "Sana College of Engineering Technology & Research Institute (Id: C-19800)",
  "Sana college of Pharmacy (Id: C-19926)",
  "Sana Engineering College (Id: C-19941)",
  "Sarada Institute of Technology & Science (Id: C-19662)",
  "Saraswathi College of Pharmacy / Sciences (Id: C-36344)",
  "Scient Institute of Technology (Id: C-19898)",
  "Shaaz College of Engineering & Technology (Id: C-19869)",
  "Shadan College of Engineering & Technology (Id: C-19570)",
  "Shadan College of Pharmacy (Id: C-19905)",
  "Shadan Women's College of Engineering & Technology (Id: C-19942)",
  "Shadan Women's College of Pharmacy (Id: C-19626)",
  "Shahjehan College of Engineering & Technology (Id: C-19672)",
  "Siddhartha Institute of Engineering & Technology (Id: C-19939)",
  "Siddhartha Institute of Technology & Science (Id: C-19915)",
  "Sindhura College of engineering & Technology (Id: C-19553)",
  "SLC's College of Pharmacy (Id: C-19505)",
  "SLC's Institute of Engineering & Technology (Id: C-19590)",
  "Sphoorthy Engineering College (Id: C-19528)",
  "S.P.R College of Engineering & Technology (Id: C-19594)",
  "Sree Chaitanya College of Engineering (Id: C-27175)",
  "Sree Chaitanya Institute of Pharmaceutical Sciences (Id: C-19882)",
  "Sree Chaitanya Institute of Technological Sciences (Id: C-27178)",
  "Sree Chaitanya PG College (MBA) (Id: C-19659)",
  "Sree Chaitanya PG College(MCA) (Id: C-19575)",
  "Sree Datha Institute of Pharmacy (Id: C-19865)",
  "Sree Dattaha Group of Institutions (Id: C-19697)",
  "Sree Datta Institute of Engineering & Sciences (Id: C-19503)",
  "Sree Dattha School of Business Management (Id: C-19585)",
  "Sree Kavita Institute of Science Technology (Id: C-19557)",
  "Sree Kavitha College of Management and Information Technology (Id: C-19719)",
  "Sree Nagarjuna College of Pharmacy (Id: C-19544)",
  "Sreenidi Institute of Science &Technology (Id: C-19951)",
  "Sree Rama Institute of Science & Technology (Id: C-19851)",
  "Sree Vaanmayi Institute of Engineering & Technology (Id: C-19931)",
  "S.R Engineering College (Id: C-19754)",
  "SREYAS INSTITUTE OF ENGINEERING & TECHNOLOGY, TATTIANNNARAM (Id: C-44949)",
  "Sri Caitanya College of Engg& Tech,and Sri Chaitanya College of Business Management (Id: C-19746)",
  "Sri Chaitanya Institute of Management and Computer Sciences (Id: C-19732)",
  "Sridevi Women's Engineering College (Id: C-19689)",
  "Sri Hindu College of Engineering & Technology (Id: C-19647)",
  "Sri Indu Institute of Pharmacy (Id: C-19519)",
  "Sri Kavita Engineering College (Id: C-19640)",
  "Sri Kottam Tulasi Reddy Memorial College of Engineering (Id: C-19690)",
  "Sri K.S Raju Institute of Technology & Sciences (Id: C-19526)",
  "Sri Nagoji Rao Institute of Technology For Women (Id: C-19860)",
  "Srinivasa Pharmaceutical Institute and Centre for Research (Id: C-19805)",
  "Srinivas Reddy Institute of Technology (Id: C-35917)",
  "S R INTERNATIONAL INSTITUTE OF TECHNOLOGY, RAMPALLY (Id: C-44970)",
  "Sri Sai Educational Society's Group of Institutions (Id: C-19937)",
  "Sri Sarada College of Pharmacy (Id: C-19543)",
  "Sri Sarada Institute of Science & Technology (Id: C-19736)",
  "Sri Venkateswara Engineering College (Id: C-19853)",
  "Sri Visweswaraiah Institute of Technology & Science (Id: C-19560)",
  "Sri YPR College of Engineering & Technology (Id: C-19524)",
  "SRM PG College(MBA) (Id: C-19727)",
  "SRM PG College(MCA) (Id: C-19899)",
  "SRR Engineering College (Id: C-27172)",
  "SS Institute of Technology (Id: C-19854)",
  "SSJ College of Pharmacy (Id: C-19533)",
  "SSJ Engineering College (Id: C-19949)",
  "SSR Engineering College (Id: C-27182)",
  "SSR Institute of Engineering & Technology (Id: C-19804)",
  "St. Martin's Engineering College (Id: C-19780)",
  "St. Mary's College of Pharmacy (Id: C-19831)",
  "St. Mary's Engineering College (Id: C-19935)",
  "St. Mary's Group of Institutions (Id: C-19906)",
  "St. Peter's Engineering College (Id: C-19826)",
  "St. Peters's College of Pharmacy (Id: C-19917)",
  "Sudheer Reddy College of Engineering & Technology For Women (Id: C-27174)",
  "Sujala Bharathi Institute of Technology (Id: C-19775)",
  "Sultan Ul Uloom College of Pharmacy (Id: C-19591)",
  "Sumathi Reddy Institute of Technology For Women (Id: C-19954)",
  "Suprabhath College of Engineering & Technology (Id: C-19842)",
  "SUPRABHATH P G COLLEGE, RAGHAVAPUR (Id: C-44960)",
  "Supraja Institute of Technology & Sciences (Id: C-19694)",
  "Sushtrut Institute of Pharmacy (Id: C-19522)",
  "S.V College of Engineering & Technology (Id: C-19907)",
  "S.V Institute of Engineering & Technology (Id: C-19699)",
  "SVS Group of Institutions (Id: C-19684)",
  "SVVR Educational Society Group of Institutions (Id: C-19827)",
  "Swami Ramananda Thirtha Institute of Pharmaceutical Sciences (Id: C-19600)",
  "Swami Ramanandathirtha Institute of Science & Technology (Id: C-19532)",
  "Swami Vivekananda Institute of Pharmaceutical Sciences (Id: C-19900)",
  "Swami Vivekananda Institute of Technology (Id: C-19765)",
  "Swarna Bharathi College of Engineering (Id: C-19641)",
  "Swarna Bharathi Institute of Management Science, Khammam (Id: C-27522)",
  "SWARNA BHARATHI INSTITUTE OF MANAGEMENT SCIENCE, PAKABANDA (Id: C-44953)",
  "Swarna Bhrathi Institute of Science Technology (Id: C-19947)",
  "Syed Hashim College of Science & Technology (Id: C-19740)",
  "Symbiosis Institute of Technology & Science (Id: C-19801)",
  "Talla Padmavathi College of Engineering (Id: C-19618)",
  "Teegala Krishna Reddy College of Pharmacy (Id: C-19773)",
  "Teegala Krishna Reddy Engineering College (Id: C-27173)",
  "Teegala Ram Reddy College of Pharmacy (Id: C-19817)",
  "Teja College of Pharmacy (Id: C-19814)",
  "The Younis Sultan College of Engineering (Id: C-19812)",
  "Thirumala college of Pharmacy (Id: C-19633)",
  "Thirumala Engineering College (Id: C-19520)",
  "TKR College of Engineering & Technology (Id: C-19714)",
  "Trinety College of Engineering and Technology (Id: C-19671)",
  "Trinety College of Engineering & Technology (Id: C-19698)",
  "TRR College of Engineering (Id: C-19511)",
  "TRV College of Engineering & Technology (Id: C-19824)",
  "Tudi Narsihma Reddy Institute of Technology & Sciences (Id: C-27184)",
  "Tudi Ram Reddy Institute of Technology & Sciences (Id: C-27176)",
  "Turbo Machinery Institute of Technology & Sciences (Id: C-19914)",
  "UNITY COLLEGE OF PHARMACY, RAIGIR (Id: C-44961)",
  "UNITY PG COLLEGE, RAIGIR (Id: C-44962)",
  "Ushodaya Institute of Management & Technology (Id: C-19530)",
  "Vaagdevi College of Engineering (Id: C-19948)",
  "Vaagdevi College of Pharmacy (Id: C-19653)",
  "Vaagdevi Engineering College (Id: C-19861)",
  "Vaageswari Institute of Management Sciences (Id: C-19506)",
  "Vageswari College of Engineering (Id: C-19628)",
  "Vageswari Engineering College (Id: C-19932)",
  "Vageswari Institute of Pharmaceutical Sciences (Id: C-19636)",
  "Vanjari Seethaiah Memorial Engineering College (Id: C-19541)",
  "Varada Reddy College of Engineering (Id: C-19934)",
  "Vardaman College of Engineering (Id: C-19650)",
  "Vathsalya College of Pharmacy (Id: C-19525)",
  "Vathsalya Institute of Science & Technology (Id: C-19668)",
  "Venkateswara Institute of Pharmaceutical Sciences (Id: C-19806)",
  "Vidya Bharathi Institute of Technology (Id: C-19927)",
  "Vidya Jythi Institute of Technology (Id: C-19582)",
  "Vidya Nikethan Institute of Technology (Id: C-19933)",
  "Vidya Vikas Institute of Technology (Id: C-19676)",
  "VIF College of Engineering & Technology (Id: C-19502)",
  "Vignana Bharathi Institute of Technology (Id: C-19700)",
  "Vignan Institute of Pharmaceutical Sciences (Id: C-19630)",
  "Vignan Institute of Technology & Sciences (Id: C-19678)",
  "Vignan's Institute of Management & Technology For Women (Id: C-19622)",
  "Vignan's Institute of Technology & Aeronautical Engineering (Id: C-19796)",
  "Vijaya College of Engineering for Women (Id: C-19646)",
  "Vijaya College of Pharmacy (Id: C-36348)",
  "Vijaya Engineering College (Id: C-19820)",
  "Vijaya Krishana Institute of Technology & Sciences (Id: C-19631)",
  "Vijaya Rural Engineering College (Id: C-19635)",
  "Vijay College of Pharmacy (Id: C-35912)",
  "Vijay Institute of Technology & Science (Id: C-19834)",
  "VIKAS COLLEGE OF PHARMACEUTICAL SCIENCES, RAYANIGUDEM (Id: C-44963)",
  "VIKAS COLLEGE OF PHARMACY, VIKAS NAGAR (Id: C-44971)",
  "Vishnu Institute of Pharmaceutical Education and Research (Id: C-19613)",
  "Vishnu Sree Institute of Technology (Id: C-19856)",
  "Vision College of Pharmaceutical Sciences (Id: C-19629)",
  "Visvesvaraya College of Engineering Technology (Id: C-19859)",
  "Viswa Bharathi College of Engineering (Id: C-19670)",
  "Viswa Bharathi Institute of Technology & Sciences (Id: C-19908)",
  "VISWA BHARATHI PG COLLEGE OF ENGINEERING & MANAGEMENT, BRINDAVAN (Id: C-44950)",
  "VITS Women's Engineering College (Id: C-19744)",
  "Vivekananda Group of Institutions (Id: C-19763)",
  "Vivekananda Institute of Science & Technology (Id: C-19648)",
  "Vivekananda Institute of Technology and Science (Id: C-19696)",
  "Vivekananda Institute of Technology & Science (Id: C-19802)",
  "Vivekananda's Institute of Engineering & Technology (Id: C-36350)",
  "VMR Institue of Technology & management Sciences (Id: C-19902)",
  "VNR Vignanajyothi Institute of Engineering & Technology (Id: C-19667)",
  "Centre for Cellular and Molecular Biology (CCM) (Id: C-8331)",
  "Military College of Electronics and Mechanical Engineering (Id: C-8323)",
  "COLLEGE OF FINE ARTS (Id: C-17028)",
  "CSIIT COLLEGE OF ARCHITECTURE (Id: C-17031)",
  "DECCAN SCHOOL OF ARCHITECTURE AND PLANNING (Id: C-47713)",
  "JBR ARCHITECTURE COLLEGE (Id: C-47711)",
  "JNIAS SCHOOL OF PLANNING AND ARCHITECTURE (Id: C-47712)",
  "MASTERJI COLLEGE OF ARCHITECTURE (Id: C-47714)",
  "MASTERJI COLLEGE OF ARCHITECTURE (Id: C-17030)",
  "SCHOOL OF PLANNING AND ARCHTECTURE (Id: C-17029)",
  "SV COLLEGE OF ARCHITECTURE (Id: C-17025)",
  "VAISHNAVI COLLEGE OF ARCHITECTURE (Id: C-17027)",
  "ABV Government Degree College, Jangaon 506 167 (Id: C-27267)",
  "Acharya Degree College, D.No. 18-144/26, Dwarakapet Road, Opp. Fire Station, W.No. 18, Narsampet (Id: C-27234)",
  "Adarsha Law College, Balasamudram, Hanamkonda, Warangal (Id: C-27205)",
  "Alluri Institute of Management Sciences, Hunter Road, Hanamkonda (Id: C-27541)",
  "Alluri Institute of Management Sciences(MCA), Hunter Road, Hanamkonda (Id: C-27310)",
  "ALLURI SETHA RAMARAJU DEGREE COLLEGE CHINTOOR (Id: C-47933)",
  "Anniebesant College of Education, Kranthi Nagar, Ballepally, Khammam (Id: C-27264)",
  "Annie Besant PG College, Kranthinagar, Ballepally, Khammam (Id: C-27543)",
  "Annie Besant PG College (MCA), Kranthinagar, Ballepally, Khammam (Id: C-27409)",
  "Aryabhatta Degree College, Balaji Nagar, Khammam (Id: C-27405)",
  "A.S.M. College for Women, Fort Road, Warangal 506 002 (Id: C-27325)",
  "Aurobindo College of Pharmaceutical Sciences, Gangadevipally, Machapur, Geesugonda (Id: C-27476)",
  "Aurora Degree College, Near KUC X Roads, Vidyaranyapuri, Hanamkonda (Id: C-27307)",
  "Avanthi Degree College, Zafargadh (Id: C-27437)",
  "Avinash Institute of Management, Waddepally, Hanamkonda (Id: C-27483)",
  "AVV Degree College, SVN Road, Warangal 506 002 (Id: C-27339)",
  "Balaji Institute of Pharmaceutical Sciences, Laknepally (V), Narsampet (M), Warangal (Id: C-27265)",
  "Balaji Institute of Pharmacy, Laknepally (V), Narsampet (M), Warangal (Id: C-27586)",
  "BBM vaari Gayathri Degree College, Nehru Nagar, Khammam (Id: C-27585)",
  "Bharathi Degree College, H.No. 11-27-16, Kothawada, Warangal (Id: C-27498)",
  "Bharathi Degree College, H.No. 4-4, Near Bus Stand, Wardhannapet, Warangal (Id: C-27219)",
  "Bhargavi Degree College, Kishanpura, Hanamkonda 506 001 (Id: C-27311)",
  "Bhavitha Degree College, # 8-1-1/3, Shamshir Nagar, Ward No. 8, Bellampally (Id: C-27415)",
  "Bishop Azaraiah Degree College, Dornakal, Warangal District (Id: C-27199)",
  "Blue Birds College of Pharmacy, Bheemaram-Chintagattu Road, Hanamkonda, Warangal (Id: C-27442)",
  "Browns College of Education, Ammapalem, Thanikella, Khammam (Id: C-27423)",
  "Browns College of Pharmacy, Ammapalem, Thanikella, Khammam (Id: C-27384)",
  "Browns PG College, Ammapalem, Tanikella, Konijerla, Khammam (Id: C-27456)",
  "Care College of Pharmacy, Oglapur (V), Athmakur (M), Warangal (Id: C-27472)",
  "Chaitanya College of Pharmacy Education & Research, Hanamkonda (Id: C-27431)",
  "Chaitanya Degree College, College Road, Mancherial (Id: C-27443)",
  "Chaitanya Degree College, Kishanpura, Hanamkonda 506 001 (Autonomous) (Id: C-27279)",
  "Chaitanya Institute of Pharmaceutical Sciences, Rampur (V), Dharmasagar (M), Warangal (Id: C-27420)",
  "Chaitanya Institute of Technology & Science, Madikonda, Hanamkonda (Id: C-27440)",
  "Chaitanya PG College, Kishanpura, Hanamkonda (Autonomous) (Id: C-27497)",
  "Chanakya Degree College, # 20-139 & 140, College Road, Mancherial (Id: C-27252)",
  "Chanakya Degree College, # 5-11-732 (New), Priyadarshini Nagar, Nirmal (Id: C-27524)",
  "CKM Arts & Science College, Desaipet Road, Warangal 506 006 (Id: C-27373)",
  "CKM Arts & Science College(PG), Desaipet, Warangal (Id: C-27243)",
  "College of Teacher Education, Lashkar Bazar, Hanamkonda (Id: C-27224)",
  "College of Teacher Education (Tribal Welfare), Bhadrachalam (Id: C-27394)",
  "College of Teacher Education (Tribal Welfare), Lalctekdi, Utnoor (Id: C-27297)",
  "C.V. Raman Degree College, Hanuman Nagar, Mancherial (Id: C-27574)",
  "Deeksha Degree College, # 1-4-125/5, Adarsha Nagar, Siddapur Road, Nirmal (Id: C-27570)",
  "DEVI DEGREE COLLEGE, GOVINDARAOPET (Id: C-47969)",
  "Dhanvanthari Institute of Management Sciences, Sujathanagar, Kothagudem, Khammam (Id: C-27330)",
  "Dr. M.R. Reddy College of Education, Parkal (Id: C-27407)",
  "Dr. M.R. Reddy Degree College, Parkal 506 164 (Id: C-27359)",
  "Dr. Rajendra Prasad B.Ed. College, Asifabad (Id: C-27438)",
  "Dr. RJC College of Higher Education, Trunk Road, Khammam (Id: C-27485)",
  "DRS College of Education, Thorrur (Id: C-27365)",
  "DRS Degree College, Mamillagudem, Khammam (Id: C-27392)",
  "Educare College of Education, Jangaon (Id: C-27546)",
  "Ekashila College of Education, Hyderabad Road, Jangaon (Id: C-27514)",
  "Ekashila Degree College, Jangaon 506 167 (Id: C-27281)",
  "Fathima College of Education, Fathima Nagar, Kazipet, Warangal (Id: C-27274)",
  "Gaayathri Institute of Management Studies, Raghunadhapalem, Khammam Urban, Khammam District (Id: C-27470)",
  "Ganapathi College of Education, Parkal (Id: C-27360)",
  "Ganapathy Degree College, H.No. 9-18, Mahadevpur Road, Parkal (Id: C-27560)",
  "GAYATRI DEGREE COLLEGE (Id: C-47970)",
  "GAYATRI DEGREE COLLEGE, DHAMMAPETA (Id: C-47961)",
  "Geervani Degree College, Mudhol (V&M) (Id: C-27277)",
  "Geethanjali Degree College for Women, H.No. 5-11-139 & 140, Naimnagar, Hanumakonda (Id: C-27532)",
  "Gnana Saraswathi (GSR) Degree College, Nirmal (Adarsha Womens) (Id: C-27221)",
  "Gokuldas Purushothamdas Ladda (GPL) Degree College, Nirmal Road, Bhainsa (Id: C-27391)",
  "Goutham Degree College,Opp. Univ. Arts & Sc. College,Subedari,Hanamkonda (Id: C-27296)",
  "Gouthami Degree College, # 1-2-12/15, Shanthinagar, Adilabad (Id: C-27555)",
  "Gouthami Degree College, 4-76, BC Colony, Old Bazar,Mahabubabad 506 101 (Id: C-27501)",
  "Government Degree College, Bellampally 504 251 (Id: C-27455)",
  "Government Degree College, Bhadrachalam (Id: C-27346)",
  "Government Degree College, Bhupalpally (Id: C-27484)",
  "Government Degree College, Chennoor 504 201 (Id: C-27385)",
  "Government Degree College, Cherial (Id: C-27568)",
  "Government Degree College, Eturu Nagaram (Id: C-27573)",
  "Government Degree College for Men, Adilabad (Id: C-27353)",
  "Government Degree College for Women, Adilabad (Id: C-27444)",
  "Government Degree College for Women, Khammam (Id: C-27253)",
  "Government Degree College for Women, Mancherial (Id: C-27529)",
  "Government Degree College for Women, Nirmal (Id: C-27248)",
  "Government Degree College, Garla (Id: C-27372)",
  "Government Degree College, Luxettipet (Id: C-27305)",
  "Government Degree College, Madhira (Id: C-27506)",
  "Government Degree College, Mahabubabad (Id: C-27275)",
  "Government Degree College, Mancherial 504 208 (Id: C-27449)",
  "Government Degree College, Manuguru (Id: C-27511)",
  "Government Degree College, Marripeda (Id: C-27571)",
  "Government Degree College, Mulug (Id: C-27232)",
  "Government Degree College, Narsampet 506 132 (Id: C-27247)",
  "Government Degree College, Nelakondapally (Id: C-27499)",
  "Government Degree College, Nirmal 504 106 (Id: C-27473)",
  "Government Degree College, Paloncha (Id: C-27545)",
  "Government Degree College, Parkal (Id: C-27371)",
  "Government Degree College, Rangasaipet, Warangal (Id: C-27306)",
  "Government Degree College, Thorrur (Id: C-27584)",
  "Government Degree College, Utnoor (Id: C-27482)",
  "Government Degree College, Yellandu (Id: C-27200)",
  "Gowthami Degree College, Cherla (V&M) (Id: C-27289)",
  "Gowthami Degree College, Laxmidevipally, Kothagudem (Id: C-27352)",
  "GRP Government Degree College, Bhainsa 504 103 (Id: C-27399)",
  "Holy Faith College of Education, Paloncha (Id: C-27328)",
  "Holy Faith College of Education, Sathupally (Id: C-27467)",
  "Indira Degree College, 1-15-31, 32, Balaji Nagar, Sirpur Kaghaznagar (Id: C-27500)",
  "Islamia Arts & Science College, Opp. MGM Hospital, Warangal 506 007 (Id: C-27202)",
  "JADHAV MANIKRAO DEGREE COLLEGE, INDRAVELLY (Id: C-47936)",
  "Jalagam Vengal Rao (JVR) Government Degree College, Sathupally (Id: C-27354)",
  "Jangaon College of Education, Jangaon (Id: C-27434)",
  "Jangaon Institute of Pharmaceutical Sciences, Jangaon, Warangal (Id: C-27557)",
  "Jaya Degree College, Nakkalagutta, Hanamkonda 506 001 (Id: C-27457)",
  "Jaya Institute of Business Management, Palvancha, Khammam District (Id: C-27450)",
  "Jaya Institute of Technology & Science for Women, Near Padmakshamma Temple, Hanumakonda, Warangal (Id: C-27383)",
  "Jayamukhi College of Education, Narsampet (Id: C-27496)",
  "Jayamukhi College of Pharmacy, Maqdumpur, Narsampet, Warangal (Id: C-27246)",
  "Jayamukhi Institute of Management Sciences, Maqdumpur, Narsampet, Warangal (Id: C-27245)",
  "JMJ Degree College for Women, Karunapuram, Peddapendial 506 151 (Id: C-27433)",
  "JVR Pragathi Degree College, # 3-97, Near Bus Stand, Kusumanchi (Id: C-27227)",
  "Kakatiya College of Computer Science, Hunter Road, Warangal (Id: C-27493)",
  "Kakatiya Degree College, 3-32, Behind SBH, Thorrur 506 163 (Id: C-27530)",
  "Kakatiya Degree College, Post Office Road, Sathupally (SHR) (Id: C-27212)",
  "Kakatiya Government College, Hanamkonda 506 001 (Id: C-27519)",
  "kakatiya Inistutute of Technology & Science(mca),yerragattu,Warangal (Id: C-32595)",
  "Kakatiya Institute of Pharmaceutical Sciences, KITS Road, Pembarthy (V), Hasanparthy (M), Warnagal (Id: C-27516)",
  "Kakatiya Institute of Technology & Science(mba), Yerragattu Hillocks, Bheemaram, Hasanparthy, Warangal (Id: C-27448)",
  "Kakatiya Institute of Technology & Science(pg), Yerragattu Hillocks, Chinthagattu, Bheemaram, Hasanparthy, Warangal (Id: C-27332)",
  "Kakatiya Institute of Technology & Science, Yerragattu Hillocks, Bheemaram, Hasanparthy, Warangal (Id: C-27400)",
  "Kakatiya Mahila Degree College, Kaoji Sgtreet, Nakkalagutta, Hanamkonda (Id: C-27572)",
  "Karimala Sai Degree College, 6-60, Beet Bazar, Luxettipet (Id: C-27475)",
  "Kavitha Degree College, Upendrayya Nagar, Khammam (Id: C-27531)",
  "Kavitha Memorial Degree College, NST Road, Khammam (Id: C-27461)",
  "Kavitha Memorial P.G. College, NST Road, Khammam (Id: C-27271)",
  "Kavitha PG College (Id: C-40801)",
  "Khammam College of Pharmacy, Allipuram (V), Khammam (Id: C-27348)",
  "KLMR DEGREE COLLEGE, KANNAPUR KADAM(M) (Id: C-47937)",
  "KLR College of Business Management, Paloncha (Id: C-27427)",
  "KLR College of Education, Paloncha (Id: C-27236)",
  "KLR College of Pharmacy, Paloncha, Khammam District (Id: C-27312)",
  "KLR Degree College, Ambedkar Centre, Paloncha (Id: C-27369)",
  "KLR Institute of Management & IT, Ramavaram, Kothagudem, Khammam Dist. (Id: C-27515)",
  "KNR Degree College, 14-52, Khanapur (V&M) (Id: C-27396)",
  "KOMARAM BHEEM DEGREE COLLEGE, GUNDALA (Id: C-47934)",
  "Krishnaveni Arts & Science Degree College, H.No. 1-17, Ambedkar Centre, Manuguru (Id: C-27537)",
  "Krishnaveni Degree College, Laxmidevipally, Kothagudem (Id: C-27251)",
  "Krishnaveni Degree College, Vidyanagar, Adilabad (Manjeera) (Id: C-27210)",
  "Kristhu Jyothi Degree College, Reddygudem, Thallada, Khammam (Id: C-27278)",
  "KSR Degree College for Women, D.No. 19-214,Warangal Road, Narsampet (Id: C-27453)",
  "K V RAMANA MEMORIAL DEGREE COLLEGE, VR PURAM (Id: C-47962)",
  "Lal Bahadur College of Education, Warangal (Id: C-27211)",
  "Lal Bahadur College, Sardar Patel Road, Warangal 506 007 (Id: C-27550)",
  "Lal Bahadur P.G. College(MBA), S.V.P. Road, Warangal (Id: C-27395)",
  "Lal Bahadur P.G. College, S.V.P. Road, Warangal (Id: C-27302)",
  "Laqshya College of Computer Studies, Tanikella, Khammam (Id: C-27266)",
  "Laqshya College of Management, Tanikella, Khammam (Id: C-27412)",
  "Little Flower Degree College, # 7-48/2, 49 & 59, Burgumpahad (Id: C-27322)",
  "Little Flower Degree College, Parvathagiri, Warangal District (Id: C-27262)",
  "Madeena B.Ed. College, Kothagudem (Id: C-27563)",
  "Maharshi Degree College, H.No. 2-77/8, Santhoshnager, Ameenapuram, Kesamudram 506 112 (Id: C-27272)",
  "Maharshi Degree College, H.No. 3-32/7, Near Balaji Nursing Home, Thorrur (Id: C-27301)",
  "Maharshi Degree College, H.No. 4-73/2, Main Road, Palakurthy (V&M) (Id: C-27287)",
  "Maharshi Degree College, Mulug 506 343 (Id: C-27430)",
  "Mahboobia Panjetan Degree College, Matwada, Warangal (Id: C-27235)",
  "Mahboobia Panjetan PG College, Janikunta, Gorrekunta, Geesugonda, Warangal (Id: C-27336)",
  "Mahboobia Panjetan PG College (MCA), Janikunta, Gorrekunta, Geesugonda, Warangal (Id: C-27534)",
  "Maheshwara College of Education, Maheshwaram, Narsampet (Id: C-27575)",
  "Manair College of Law, V.V. Palem, Khammam (Id: C-27376)",
  "Manair College of Management, VV Palem, Khammam (Id: C-27286)",
  "Mancherial Institute of Mathematical Sciences,#20-531,Indira Nagar,Mancherial (Id: C-27300)",
  "Mancherial Vidyaniketan Degree College, Mancherial(119) (Id: C-30004)",
  "Margadarshi College of Education, Mahabubabad (Id: C-27356)",
  "Masterji Degree College, Hunter Road, Subedari, Hanamkonda (Id: C-27521)",
  "Masterji Institute of Information Technology, Madikonda, Hanamkonda (Id: C-27259)",
  "MATHRU SRI DEGREE COLLEGE FOR WOMEN, HASANPARTHY (Id: C-47971)",
  "Max Institute of Pharmaceutical Sciences, Velugumatla (V), VV Palem (Po), Khammam (Id: C-27478)",
  "MES College of Education, Arempula, Khammam (Id: C-27370)",
  "Modern Degree College, # 2-17, Beside UTF Office, Madhira (Id: C-27367)",
  "Mohammadiya Institute of Computer Technology, Arempula, Khammam (Id: C-27207)",
  "Mohammadiya Institute of Management, Arempula, Khammam (Id: C-27255)",
  "Mohammadiya Institute of Pharmacy, Barugudem, Arempula, Khammam (Id: C-27351)",
  "Mother Theresa College of Education Mahabubabad (Id: C-27577)",
  "Mother Theresa College of Education, Paloncha (Id: C-27273)",
  "Mother Theresa College of Education, Sathupally (Id: C-27551)",
  "Mother Theresa Degree College, # 19-4-15/1, Gollagatta Road, Bhadrachalam (Id: C-27535)",
  "Muduganti Suryamma College of Education Rajampet, Asifabad (Id: C-27217)",
  "Mukharam Agarwal Memorial Mancherial Vidyaniketan Degree College for Women, # 7-163, Ganga Reddy Road, Mancherial (Id: C-27350)",
  "Nalanda Degree College, # 13-306/12, Near IB, Mancherial (Sri Harsha) (Id: C-27329)",
  "Nalanda Degree College, H.No. 10-138, Mulug (Id: C-27401)",
  "Nalanda Degree College, H.No. 2-2-22/A/1,Near RTC Bus stand, Mahabubabad (Id: C-27552)",
  "Nalanda Degree College, Mavla Road, Adilabad 504 001 (Id: C-27471)",
  "Nandana Degree College, # 5-11-718, Priyadarshini Nagar, Nirmal (Id: C-27556)",
  "National Degree College, Bollorugudem, Paloncha (Id: C-27357)",
  "Nava Bharath Degree College, Nethaji Road, Sathupally (Id: C-27462)",
  "Naveena Degree College, Nehru Nagar, Khammam (Gowtham) (Id: C-27536)",
  "N.B.R. Degree College, Shastri Nagar, Nirmal (Id: C-27549)",
  "Nethaji Institute of Pharmaceutical Sciences, Somidi, Kazipet, Warangal (Id: C-27338)",
  "New Science Degree College, Hunter Road, Hanamkonda (Id: C-27294)",
  "New Science Degree College, Majdoor Nagar, Main Road, Bhupalpally (Id: C-27298)",
  "New Science Degree & PG College, Hunter Road, Hanamkonda, Warangal (Id: C-27333)",
  "Nirmal Hriday Degree College, # 4-55, Opp. Railway Station, Singareni (V&M) (Id: C-27403)",
  "ORUGALLU DEGREE COLLEGE, ENKOOR (Id: C-47963)",
  "Padmavathi Degree College for Women, Kothawada, Warangal (Id: C-27321)",
  "Panchsheel College of Education, Nirmal (Id: C-27366)",
  "Pathfinder Institute of Pharmacy Education & Research, Near Warangal Airport, Warangal (Id: C-27340)",
  "Pingle Government Degree College for Women, Waddepally, Warangal (Id: C-27256)",
  "Pragathi School of Business, Hunter Road, Warangal (Id: C-27318)",
  "Prathibha Degree College, Kalluru (Id: C-27229)",
  "Prerana Degree College, Block No. 12, Islampura, Mancherial (Id: C-27454)",
  "Priyadarshini Degree College, Kutir Complex, Opp. Bus Stand, Kothagudem (Id: C-27285)",
  "Priyadarshini Degree College, Nehru Nagar, Khammam (Id: C-27422)",
  "PSR Memorial Degree College, Ambedkar Centre, Bhadrachalam (Id: C-27436)",
  "Pulipati Prasad College of Pharmaceutical Sciences, Khammam (Id: C-27410)",
  "Rahman s College of Education, Jangaon (Id: C-27345)",
  "RAJA RISHI DEGREE COLLEGE, BACHANNAPET (Id: C-47940)",
  "Rams Degree College, Bhadrachalam (Sampurna, Erragunta) (Id: C-27463)",
  "R.D. Women s Degree College, H.No. 5-10-50/A, Kishanpura, Hanamkonda (Id: C-27528)",
  "REBBANA ARTS AND SCIENCE DEGREE COLLEGE, REBBENA (Id: C-47938)",
  "RJC College of Education, Khammam (Id: C-27510)",
  "RJRM Degree College, Marripeda (Id: C-27257)",
  "R.K.P. Degree College, SCCL Primary School Building, A-Zone, Ramakrishnapuram, Mandamarri (M) (Id: C-27398)",
  "RRM Degree College, Hyderabad Road, Jangaon (Id: C-27517)",
  "Saahithi Degree College of Science and Arts, No. 14 basthi, Yellandu (Id: C-27231)",
  "Sacred Heart College of Arts & Science, Thallampadu (Id: C-27548)",
  "Sadhana Degree College, Muthyampet, Dandepally (M), Adilabad (Id: C-27293)",
  "Sadhana Degree College, near MRO Office, Yellandu (Id: C-27203)",
  "Sahasra Institutue of Pharmaceutical Sciences,Warangal (Id: C-41027)",
  "Sai Ram Degree College, Near Bus Stand, Thorrur 506 163 (Id: C-27492)",
  "Sai Teja College of Education, Kallem Road, Jangaon (Id: C-27381)",
  "SAI TEJA DEGREE COLLEGE, KOWTALA (Id: C-47967)",
  "Samaikya Degree College, H.No. 5-5-88, Kankara Boad, Mahabubabad (Id: C-27465)",
  "Samatha Degree College, Thorrur 506 163 (Id: C-27469)",
  "Sangamithra Degree College, H.No. 4-67/4, Near Police Station, Bhupalpally (Id: C-27204)",
  "SANJANA DEGREE COLLEGE, GHANPUR (Id: C-47972)",
  "Santhiniketan Degree College, Ayyagaripet, Sathupally (Id: C-27540)",
  "Saraswathi Degree College, Yerrupalem (Id: C-27276)",
  "SARAYU DEGREE COLLEGE, GUDUR (Id: C-47973)",
  "Seelam Pulla Reddy Memorial Degree College, CPS Road, Madhira (Id: C-27344)",
  "Seelam Sidda Reddy & Jyothi (SSRJ) Arts & Science College, Khammam (Id: C-27313)",
  "Shaarvani Degree College, 5-9-171 and 172, Kishanpura, Hanamkonda 506 001 (Id: C-27363)",
  "Shantiniketan Degree College, Near Fly Over Bridge, Mancherial 504 208 (Id: C-27319)",
  "Shivani Arts & Science Degree College for Women, Maruthi Nagar, Mandamarri (Id: C-27238)",
  "Siddartha Degree College, H.No. 7-4, Beside Hanuman Temple, Main Road, Bhupalpally, Warangal District (Id: C-27241)",
  "Siddartha Degree College, Siddartha Nagar, Narsampet (Id: C-27295)",
  "Siddartha Degree College, Wyra (Id: C-27280)",
  "Siddartha Gowtham Degree College, Velerupadu, Khammam District (Id: C-27411)",
  "SINDHUJA DEGREE COLLEGE, MAIN ROAD NARMETTA (Id: C-47941)",
  "Singareni Collieries Womens Degree College, Kothagudem (Id: C-27447)",
  "Singareni Mahila Degree College, # 16-41, Andugulapet (V), Mandamarri (Id: C-27547)",
  "S.K.E. Degree College, Sirpur Kaghaznagar 504 296 (Id: C-27355)",
  "S.N. Degree College, Opp. KDC, Hanamkonda (Id: C-27508)",
  "Sneha Degree College, Government Hospital Road, Yellandu (Id: C-27445)",
  "SPURTHI DEGREE COLLEGE, GHANPUR (Id: C-47974)",
  "Sravanthi College of Education, Dharmaram (Id: C-27303)",
  "SR & BGNR Government College, Khammam (Id: C-27254)",
  "S.R. College of Pharmacy, Ananthasagar (V), Hasanparthy (M), Warangal (Id: C-27334)",
  "S.R. Degree College, Balasamudram, Hanamkonda (Id: C-27576)",
  "Sree College of Pharmacy, Nayakulagudem (V), Kothagudem (M), Khammam (Id: C-27268)",
  "SREENIDHI DEGREE COLLEGE, MADHIRA (Id: C-47964)",
  "Sri Arunodaya Degree College, Amba Complex, Bheemaram, Hasanparthy (M) (Id: C-27490)",
  "Sri Aurobindo Institute of Education, Jangaon (Id: C-27402)",
  "Sri Bhagavathi Degree College, #1-1/1, Uthkoor-Luxettipet, Near Police Station, Luxettipet (Id: C-27479)",
  "Sri Chaitanya Degree College, Bheemaram,Warangal (Id: C-40805)",
  "SRI CHAITANYA DEGREE COLLEGE, KOWTALA (Id: C-47968)",
  "Sri Chaitanya Degree College, Near Bus Stand, Narsampet (Id: C-27553)",
  "Sri Chaitanya Degree College, Rajampet, Asifabad (Id: C-27488)",
  "Sri Chaitanya Degree College, Tekulapally (Id: C-27389)",
  "SRI CHAITANYA GOUTHAMI DEGREE COLLEGE, D No 2-21/1 MAIN ROAD, TEKULAPALLI (Id: C-47942)",
  "Sri Durgeswara Mahila Sanskrit Andhra (SDMSA) Kalasala, Girmajipet, Warangal (Oriental) (Id: C-27386)",
  "Sri Gaayathri College of Management Sciences, Mulug Road, Warangal (Id: C-27216)",
  "Sri Gaayathri Degree College, Ramnagar, Hanamkonda (Id: C-27495)",
  "Sri Gowthami Degree College, Kunavaram, Khammam (Id: C-27408)",
  "Sri Kakatiya Degree College, Bhadrachalam (Gowthami, Nelakondapally) (Id: C-27583)",
  "Sri Kakatiya Institute of Pharmaceutical Sciences, Unikicherla (Id: C-27566)",
  "Sri Pulaji Baba Degree College, # 1-36/1, Near IB Chowk, Utnoor (Id: C-27260)",
  "SRI PULIPATI PRASAD ARTS AND SCIENCE DEGREE COLLEGE, KONIJERLA (Id: C-47965)",
  "Sri Rajah Raghava Raju Venkata Krishnam Raju Memorial (SRRRVKRM) Degree College, # 2-108, Godavari Ferry Point Road, Venkatapuram (Id: C-27481)",
  "Sri Rama Chandra Arts & Science Government College, Kothagudem (Id: C-27512)",
  "SRI RAMA GOWTHAMI DEGREE COLLEGE, WAZEED (Id: C-47966)",
  "Sri Rama Krishna Degree College, Dwarakapet Road, Narsampet (Id: C-27421)",
  "Sri Sai Balaji College of Education, Thorrur (Id: C-27288)",
  "Sri Sai Degree College, Kunavaram Road, Bhdrachalam (Id: C-27426)",
  "Sri Sai Prasanthi Degree College, Kunavaram, Khammam (Id: C-27377)",
  "Sri Shivani College of Pharmacy,Warangal (Id: C-41028)",
  "SRI SRI GAYATHRI DEGREE COLLEGE, GHANPUR (Id: C-47975)",
  "Sri Surya Degree College, Thallada (Id: C-27317)",
  "Sri Vani Degree College, V.M. Banzar, Penubally (Id: C-27513)",
  "SRI VIDWAN DEGREE COLLEGE FOR WOMEN, HASANPARTHY (Id: C-47976)",
  "Sri Vidya Degree College, Sundaraiah Nagar, Bandarugudem, Manuguru (Id: C-27282)",
  "SRI VIKAS DEGREE COLLEGE, NEKKONDA (Id: C-47945)",
  "SRI VIKAS DEGREE COLLEGE, SINGARENI (Id: C-47943)",
  "SRI VIKAS DEGREE COLLEGE, SIRPUR (Id: C-47944)",
  "Sri Vishweswara Sanskrit Andhra (SVSA) Kalasala, Station Road, Warangal (Oriental) (Id: C-27565)",
  "Sri Vivekananda College of Education, Mahabubabad (Id: C-27404)",
  "SRK Degree College,Cherial (Id: C-40804)",
  "SS Degree College, Dharmaram, Geesugonda (M), Warangal (Id: C-27284)",
  "St. Anns College of Education, Venkatapuram (V), Mudigonda (M) (Id: C-27226)",
  "St. John MBA College, Yellapur, Warangal (Id: C-27582)",
  "St. John P.G. College, Yellapur, Warangal (Id: C-27316)",
  "St. John P.G. College, Yellapur, Warangal (MCA) (Id: C-27518)",
  "St. John School of Management, Yellapur (V), Hasanparthy (M), Warangal (Id: C-27240)",
  "St. John s College of Pharmacy, Yellapur, Hasanparthy (M), Warangal (Id: C-27314)",
  "St. Joseph s P.G. College, Rampoor, Warangal (Id: C-27388)",
  "St. Lawrence College of Education, Arempula, Khammam (Id: C-27230)",
  "St. Mary's Colelge of Education,Jangaon (Id: C-40802)",
  "St. Mary s PG College (MCA), Hyderabad Road, Jangaon (Id: C-27368)",
  "St. Peter s College of Education, Vidyanagar, Hanamkonda (Id: C-27477)",
  "St. Peter s Institute of Pharmaceutical Sciences, Vidyanagar, Hanamkonda (Id: C-27569)",
  "St. Thomas Degree College, H.No. 21-37/8, Cherial (V&M), Warangal District (Id: C-27435)",
  "Susheela College of Education, Madhira (Id: C-27466)",
  "Susheela Memorial Degree College, Didugupadu (V), Madhira (Id: C-27579)",
  "SUVIDYA DEGREE COLLEGE, CHITYAL (Id: C-47977)",
  "S.V. Degree College, Market Road, Parkal (Id: C-27416)",
  "S.V.G. Degree College, Laxman Chanda, Adilabad 504 106 (Id: C-27489)",
  "S.V.G.S. Degree College, Near Petrol Bunk, Bonakal (Id: C-27432)",
  "SVR College of Education, Madhira (Id: C-27413)",
  "S.V.S.PG College, Bheemaram, Ramaram, Mandal: Hasanparthy, Warangal (Id: C-27458)",
  "Swathi Women s Degree College, 1-23/1A, CCC X Roads, Teegal Pahad (GP), Mancherial (M) (Id: C-27213)",
  "Swetha Degree College, # 7-90, 7-91/1, Near Bus Stand, Chennur (Id: C-27393)",
  "Takshashila Degree College, Rayaparthy (Id: C-27538)",
  "Talasila Degree College, Paloncha (Id: C-27561)",
  "Talla Padmavathi College of Education, Orus,Kareemabad, Warangal (Id: C-27468)",
  "The Vazir Sultan College of Engineering, V.V. Palem, Khammam (Id: C-27337)",
  "Thorrur College of Education, Thorrur (Id: C-27220)",
  "Thushara Degree College, H.No. 2-5-639, Subedari, Hanamkonda (Id: C-27527)",
  "Thushara P.G. School of Information Science, Rampoor, Warangal (Id: C-27578)",
  "Trinity PG College, Regulachelaka, Khammam (Id: C-27486)",
  "University Arts &Science College ,Subedari,Hanamkonda (Id: C-27223)",
  "University college of Engineering,Kothagudam (Id: C-27616)",
  "University Law college (Id: C-27614)",
  "University P.G. College, Khammam (Id: C-32593)",
  "University P.G. College, Nirmal (Id: C-32592)",
  "University P.G. College, Subedari,Hanamkonda (Id: C-32594)",
  "Vaagdevi College of Education, Parkal (Id: C-27299)",
  "Vaagdevi College of Engineering, Bollikuknta, Warangal (Id: C-27419)",
  "Vaagdevi College of Pharmacy, Ramnagar, Hanamkonda, Warangal (Id: C-27290)",
  "Vaagdevi Degree College, 13-21, Thimmapur Area, Khanapur (V&M) (Id: C-27349)",
  "Vaagdevi Degree College, 47&54, Boath (P&M) (Id: C-27375)",
  "Vaagdevi Degree College, Kishanpura, Hanamkonda (Id: C-27558)",
  "VAAGDEVI DEGREE COLLLEGE, MANCHERIAL (Id: C-48006)",
  "Vaagdevi Degree & PG College, Kishanpura, Hanamkonda (Id: C-27378)",
  "Vaagdevi Institute of Management Sciences, Bollikunta, Warangal (PG) (Id: C-27580)",
  "Vaagdevi Institute of Pharmaceutical Sciences, Bollikunta, Warangal (Id: C-27364)",
  "Vaasavi Degree College, H.No. 5-51,Pulluri Ramaiah Palli,Bhupalpally506 168 (Id: C-27261)",
  "Vagdevi Arts & Science Degree College, 4-3-41, Opp. New Bus Stand, Bhuktapur, Adilabad (Id: C-27244)",
  "Vamsee Vinay Degree College, Vemsoor Road, Sathupally (Id: C-27452)",
  "Vasavi Degree College, # 2-264, Kallur (V), Kuntala (M) (Id: C-27218)",
  "Vasavi Degree College, RR Complex, Court Road, Mahabubabad (Id: C-27533)",
  "Vashishta Degree College, Manjulapur, Nirmal 504 106 (Id: C-27564)",
  "Vasundhara Degree College, Surya Complex, Industrial Area, Sirpur Khagaznagar (Id: C-27258)",
  "VEDHANIDI DEGREE COLLEGE, LOKESHWARAM (Id: C-47939)",
  "Vidya Bharathi Degree College, Tandoor (Id: C-27225)",
  "Vidya Jyothi Degree & P.G. College, Station Ghanpur 506 144 (Id: C-27331)",
  "Vidyarthi Degree College, # 1-2-13/1, Ravindranagar, Adilabad (Id: C-27250)",
  "Vignana Bharathi Degree College, H.No. 5-4-109, Kankara Boad, Maha (Id: C-27417)",
  "Vignana Bharathi Degree College, H.No. 5-4-109, Kankara Boad, Mahabubad (PG) (Id: C-27249)",
  "Vijaya Bharathi Degree College, H.No. 8-2-75, TDP Centre, Bandarugudem, Manuguru (Id: C-27327)",
  "Vikas Degree College, # 1-119/1, Ponkal, Jannaram (M) (Id: C-27382)",
  "Vikas Degree College, 1-3-85, Mahabubabad (Id: C-27237)",
  "Vikas Degree College, H.No. 1-2-235, Opp. Govt. Hospital, Jangaon 506 167 (Id: C-27292)",
  "Vikas Degree College, Station Road, Khammam (Id: C-27503)",
  "Vinuthna College of Management, Hasanparthy, Warangal (Id: C-27341)",
  "Vinuthna Institute of Technology & Science, Hasanparthy (V&M), Warangal (Id: C-27502)",
  "Vishwas Degree College, H.No. 5-13/1, Rajeev Chowrastha, Palakurthy (V&M), Warangal District (Id: C-27554)",
  "Viswambhara College of Education, Bollikunta, Warangal (Id: C-27335)",
  "Vivekananda College of Education, Adilabad (Id: C-27324)",
  "Vivekananda College of Education, Narsampet (Id: C-27487)",
  "Vivekananda Degree College, Narsampet (Id: C-27406)",
  "VIVEKANAND A DEGREE COLLEGE, NEAR GUNDALA (Id: C-47935)",
  "Vivekananda Degree College, Vidhyanagar colony, Echoda (V&M) (Id: C-27581)",
  "Vivekavardhani Degree College for Women, Laxmidevipally, Kothagudem (Id: C-27505)",
  "Vivekavardhani Degree College, Kothagudem (Id: C-27206)",
  "Vivekavardhani Institute of Management, Laxmidevipally, Kothagudem (Id: C-27309)",
  "Vivekavardhini Degree College, Near Bus Stand, Mancherial (Id: C-27214)",
  "VKDVS Raju Degree College, Aswaraopet (Id: C-27379)",
  "V.R. College of Management of Information Technology, Sri Sainath Mega Green Cilty, Battupally Road, Sy. No.185A1, Village: Ammavaripet, Kothapally (H), GP Hanamkonda Mandal, Warangal (Id: C-27362)",
  "Warangal Institute of Technology & Science, Oorugonda (V), Athmakur (M), Warangal (Id: C-27291)",
  "YAKUB REDDY DEGREE COLEGE, HASANPARTHY (Id: C-47978)",
  "Yasmeen B.Ed. College (Id: C-40803)",
  "ALIMINETI MADHAVA REDDY MEMORIAL COLLEGE OF EDUCATION, CHOUTUPPAL (Id: C-33169)",
  "AL-MADINA COLLEGE OF EDUCATION, NALGONDA (Id: C-33287)",
  "ANANTHA COLLEGE OF EDUCATION, SURYAPET (Id: C-33156)",
  "ARFAATH COLLEGE OF EDUCATION, MIRYALGUDA (Id: C-33114)",
  "ARUNODAYA DEGREE COLLEGE, NAKREKAL (Id: C-33154)",
  "ARUNODAYA PG COLLEGE NAKREKAL (Id: C-33204)",
  "AURORA'S COLLEGE OF EDUCATION, BHONGIR (Id: C-33223)",
  "AURORA'S LEGAL SCIENCES INSTITUTE, NALGONDA (Id: C-33292)",
  "A.V.M COLLEGE OF EDUCATION, NKREKAL (Id: C-33222)",
  "AVM DEGREE COLLEGE, NAKREKAL (Id: C-33240)",
  "AVM PG COLLEGE, NAKREKAL (Id: C-33273)",
  "AZEEZIA COLLEGE OF EDUCATION, NALGONDA (Id: C-33288)",
  "BHONGIR COLLEGE OF EDUCAITON BHONGIR (Id: C-33177)",
  "CHAITANYA BHARATHI DEGREE COLLEGE, HUZURNAGAR (Id: C-33192)",
  "CHANIKYA DEGREE COLLEGE, CHOUTUPPAL (Id: C-33209)",
  "CHINMAY CHANDRAMATHI COLLEGE OF EDUCAITON, DEVARAKONDA (Id: C-33146)",
  "DON BOSCO DEGREE COLLEGE, NALGONDA (Id: C-33166)",
  "DON BOSCO PG COOLLEGE NALGONDA (Id: C-33194)",
  "DUGYALA GOPAL RAO MEMORIAL DEGREE COLLEGE, THUNGATURTHY (Id: C-33179)",
  "DVM COLLEGE OF BUSINESS MANAGEMENT, CHERLAPALLY (Id: C-33220)",
  "DVM COLLEGE OF EDUCATION, NALGONDA (Id: C-33198)",
  "ENRICH COLLEGE OF EDUCAITON, MIRYALAGUDA (Id: C-33126)",
  "EV REDDY MEMORIAL DEGREE COLLEGE, KODAD (Id: C-33181)",
  "EVR MEMORIAL PG COLLEGE, KODAD (Id: C-33262)",
  "GOKUL COLLEGE OF EDUCAITON, NALGONDA (Id: C-33150)",
  "GOUTAMI DEGREE COLLEGE, BHONGIR (Id: C-33283)",
  "GOUTAMI DEGREE COLLEGE, SURYAPET (Id: C-33129)",
  "GOUTMI DEGREE COLLEGE, SURYPET (Id: C-33258)",
  "GOVERNMENT DEGREE COLLEGE, ALIR (Id: C-33164)",
  "GOVERNMENT DEGREE COLLEGE, CHANDUR (Id: C-33196)",
  "GOVERNMENT DEGREE COLLEGE FOR WOMEN, NALGONDA (Id: C-33259)",
  "GOVERNMENT DEGREE COLLEGE, NAKREKAL (Id: C-33211)",
  "GOVERNMENT DEGREE COLLEGE, RAMMANNAPET (Id: C-33221)",
  "GOVT. COLLEGE OF TEACHER EDUCAITON, NAGARJUNASAGAR (Id: C-33256)",
  "GOVT. DEGREE COLLEGE FOR WOMEN, NALGONDA (Id: C-33155)",
  "GOVT. DEGREE COLLGE, NAKREKAL (Id: C-33238)",
  "HOLYCROSS COLLEGE OF EDUCAITION, SURYAPET (Id: C-33210)",
  "HRD COLLEGE FOR TEACHER EDUCATION, DEVARAKONDA (Id: C-33143)",
  "HRD DEGREE COLLEGE, DEVARAKONDA (Id: C-33119)",
  "HRD DEGREE & PG COLLEGE, DEVARAKONDA (Id: C-33218)",
  "JAGRUTHI DEGREE COLLEGE, BHONGIR (Id: C-33206)",
  "JAGRUTHI PG COLLEGE, BHONGIR (Id: C-33269)",
  "JBM DEGREE COLLEGE, NARAYANPUR (Id: C-33270)",
  "KAKATIYA DEGREE COLLEGE, NALGONDA (Id: C-33161)",
  "KAKATIYA PG COLLEGE NALGONDA (Id: C-33121)",
  "KAVITHA MEMORIAL COLLEGE OF TEACHER EDUCAITON, DEVARAKONDA (Id: C-33130)",
  "KHADAR MEMORIAL COLLEGE OF TEACHER EDUCAITON, MIRYALAGUDA (Id: C-33286)",
  "KHATIZA KUTHUN COLLEGE OF EDUCAITON, NIDMANOOR (Id: C-33257)",
  "KNM GOVT. DEGREE COLLEGE, MIRYALGUDA (Id: C-33295)",
  "KODAD INSTITUTE OF INFORMATICS FOR WOMEN, KODAD (Id: C-33281)",
  "KODAD INSTITUTE OF INFORMATICS FOR WOMEN(MCA), KODAD (Id: C-33135)",
  "KRR GOVT. DEGREE COLLEGE, KODAD (Id: C-33160)",
  "MA BEIG COLLEGE OF EDUCAITON, NALGONDA (Id: C-33128)",
  "MADAVA INSTITUE OF ADVANCED STUDY IN EDUCAION, BHONGIR (Id: C-33266)",
  "MADHIRA INSTITUTE OF TECHNOLOGY & SCIENCE, KODAD (Id: C-33243)",
  "MADHIRA INSTITUTE OF TECHNOLOGY & SCIENCE(MCA), KODAD (Id: C-33108)",
  "MADINA COLLEGE OF EDUCAITON, HUZURNAGAR (Id: C-33272)",
  "MAHARSHI DEGREE COLLEGE, SURYAPET (Id: C-33276)",
  "MAITRI DEGREE COLLEGE, NALGONDA (Id: C-33277)",
  "MARRIGUDA DEGREE COLLEGE, MARRIGUDA (Id: C-33190)",
  "MATRUSHRI DEGREE COLLEGE, CHOUTUPPAL (Id: C-33151)",
  "MC MEMORIAL DEGREE COLLEGE, HALIA (Id: C-33142)",
  "MJR COLLEGE OF EDUCAITON, MIRYALAGUDA (Id: C-33214)",
  "MKR GOVT COLLEGE, DEVARAKONDA (Id: C-33285)",
  "MKR GOVT. DEGREE COLLEGE, DEVARAKONDA (Id: C-33183)",
  "MKR MEMORIAL DEGREE COLLEGE, POCHAMPALLY (Id: C-33116)",
  "MOHAMMADEN'S COLLEGE OF DEVARAKONDA (Id: C-33271)",
  "MOTHER MARY COLLGE OF EDUCAITON CHARLAPALLY (Id: C-33113)",
  "MOTHER TERESA COLLEGE OF EDUCAIOTN, SURYAPET (Id: C-33125)",
  "MOTHER TERESA COLLEGE OF EDUCAITON, ANANTARAM (Id: C-33111)",
  "MRR MEMORIAL DEGREE COLLEGE, KODAD (Id: C-33110)",
  "MSR COLLEGE OF EDUCAITON, SURYAPET (Id: C-33201)",
  "NAGARJUNA COLLEGE OF EDUCAITON, MIRYALAGUDA (Id: C-33279)",
  "NAGARJUNA GOVT. COLLEGE, NALGONDA (Id: C-33207)",
  "NAGARJUNA PG COLLEGE(MCA), MIRYALAGUDA (Id: C-33280)",
  "NAGARJUNA PG COLLEGE, MIRYALAGUDA (Id: C-33141)",
  "NALANDA COLLEGE OF ARTS & COMMERCE, CHOUTUPPAL (Id: C-33189)",
  "NALANDA DEGREE COLLEGE, MIRYALAGUDA (Id: C-33149)",
  "NALANDA DEGREE COLLEGE, NALGONDA (Id: C-33195)",
  "NALANDA MCA COLLEGE, SURYAPET (Id: C-33219)",
  "NALGONDA DEGREE COLLEGE, NALGONDA (Id: C-33203)",
  "NARKETPALLY COLLEGE OF EDUCAITON, CHARLAPALLY (Id: C-33294)",
  "NEELAGIRI DEGREE COLLEGE, NALGONDA (Id: C-33170)",
  "NEELAGIRI DEGREE & PG COLLEGE, NALGONDA (Id: C-33132)",
  "NEW ARABINDO DEGREE COLLEGE, NEREDCHERLA (Id: C-33184)",
  "NIZAM INSTITUTE OF ENGINEERING & TECHNOLOGY, DESHMUKHI (Id: C-33245)",
  "PADALA DEGREE COLLEGE, THURKAPALLY (Id: C-33225)",
  "PRAGATHI ARTS&SCIENCE DEGREE COLLEGE, TIRUMALGIRI (Id: C-33244)",
  "PRAGATHI DEGREE COLLEGE, CHOUTUPPAL (Id: C-33233)",
  "PRAGATHI DEGREE COLLEGE, VALIGONDA (Id: C-33159)",
  "PRIYADARSHANI DEGREE COLLEGE, HUZURNAGAR (Id: C-33193)",
  "PRIYADARSHANI DEGREE COLLEGE, SURYAPET (Id: C-33290)",
  "PRIYADARSHINI PG COLLEGE, HUZURNAGAR (Id: C-33284)",
  "PVRR MEMORIAL COLLEGE OF EDUCATION, YELLAREDDYGUDEM (Id: C-33186)",
  "RAJARAM MEMORIAL DEGREE COLLEGE, SURYAPET (Id: C-33230)",
  "RAMAKRISHNA DEGREE COLLEGE, HALIA (Id: C-33174)",
  "RKLK COLLEGE OF EDUCAITON, SURYAPET (Id: C-33274)",
  "RKLK DEGREE COLLEGE, SURYAPET (Id: C-33168)",
  "RKLK PG COLLEGE SURYAPET (Id: C-33224)",
  "RKLK WOMENS DEGREE COLLEGE, SURYAPET (Id: C-33139)",
  "SAHITHI COLLEGE OF EDUCAITION, TIRUMALAGIRI (Id: C-33236)",
  "SAI COLLEGE OF LIBRARY SCIENCE SURYAPET (Id: C-33180)",
  "SAIKRUPA DEGREE COLLEGE, BHONGIR (Id: C-33171)",
  "SAI KRUPA DEGREE & PG COLLEGE BHONGIR (Id: C-33144)",
  "SAIRAM DEGREE COLLEGE, MOTKUR (Id: C-33115)",
  "SAI VIKAS PG COLLEGE, KODAD (Id: C-33153)",
  "SANA COLLEGE OF BUSINESS MANAGEMENT, KODAD (Id: C-33182)",
  "SANA COLLEGE OF TEACHER EDUCAITON, KODAD (Id: C-33136)",
  "SANJEEVANI COLLEGE OF EDUCAITON, KONDAMALLEPALLY (Id: C-33138)",
  "SHALIVAHANA DEGREE COLLEGE, KONDAMALLEPALLY (Id: C-33246)",
  "SHANTHINIKETHAN PG COLLEGE(MCA), MIRYALAGUDA (Id: C-33205)",
  "SHANTHINIKETHAN PG COLLEGE, MIRYALAGUDA (Id: C-33191)",
  "SHANTINIKETAN DEGREE COLLEGE, MIRYALAGUDA (Id: C-33213)",
  "SHANTINIKETHAN COLLEGE OF EDUCAIOTION, MIRYALAGUDA (Id: C-33278)",
  "SHANTINIKETHAN PG COLLEGE, MIRYALAGUDA (Id: C-33200)",
  "SIDDHARTHA DEGREE COLLEGE, SURYAPET (Id: C-33212)",
  "SIDDU COLLEGE OF EDUCAION, HUZURNAGAR (Id: C-33109)",
  "SIDHARTHA PG COLLEGE SURYAPET (Id: C-33163)",
  "SLNS COLLEGE BHONGIR (Id: C-33215)",
  "SLNS DEGREE COLLEGE, ALAIR (Id: C-33265)",
  "S.L.N.S. SANSKRIT VIDYAPEETH, YADAGIRIGUTTA (Id: C-33157)",
  "SOGHRA COLLEGE OF TEACHER EDUCAITON, KONDA BHEEMANAPALLY (Id: C-33188)",
  "SPANDANA DEGREE COLLEGE, SURYAPET (Id: C-33167)",
  "SPANDANA PG COLLEGE SURYAPET (Id: C-33268)",
  "SRI CHAITANYA DEGREE COLLEGE, CHITYAL (Id: C-33237)",
  "SRI CHAITANYA DEGREE COLLEGE, MAAL (Id: C-33131)",
  "SRI CHAITANYA DEGREE COLLEGE, NALGONDA (Id: C-33175)",
  "SRI HINDU DEGREE COLLEGE, RAMANNAPET (Id: C-33137)",
  "SRI KRISHNADEVARAYA COLLEGE OF EDUCATION, NALGONDA (Id: C-33178)",
  "SRI LAXMI NARASIMHA SWAMY DEGREE COLLEGE, BHONGIR (Id: C-33133)",
  "SRI MALLIKARJUNA DEGREE COLLEGE, NAKREKAL (Id: C-33260)",
  "SRINAGARJUNA DEGREE COLLEGE, MIRLAYAGUDA (Id: C-33199)",
  "SRI NAGARJUNA DEGREE COLLEGE, MIRYALAGUDA (Id: C-33120)",
  "SRI NAVABHARAT DEGREE COLLEGE, BHONGIR (Id: C-33208)",
  "SRI NAVABHARAT DEGREE & PG COLLEGE BHONGIR (Id: C-33267)",
  "SRINIDHI DEGREE COLLEGE CHILKUR (Id: C-33241)",
  "SRI POOJITHA DEGREE COLLEGE, SURYAPET (Id: C-33147)",
  "SRI RAGHAVENDRA COLLEGE OF EDUCATION, NALGONDA (Id: C-33187)",
  "SRI RAGHAVENDRA DEGREE COLLEGE, NALGONDA (Id: C-33296)",
  "SRI RAMALINGESHWARA DEGREE COLLEGE NARKETPALLY (Id: C-33158)",
  "SRI SAI DEGREE COLLEGE (CO-EDUCATION), THIRUMALAGIRI (Id: C-33185)",
  "SRI SAI DEGREE COLLEGE, SURYAPET (Id: C-33152)",
  "SRI SAI PG COLLEGE SURYAPET (Id: C-33148)",
  "SRI SAI TRIVENI DEGREE COLLEGE, SURYAPET (Id: C-33197)",
  "SRI SAI TRIVENI PG COLLEGE SURYAPET (Id: C-33122)",
  "SRI SAI VIKAS DEGREE COLLEGE, KODAD (Id: C-33202)",
  "SRI SANTOSH DEGREE COLLEGE, MOTKUR (Id: C-33239)",
  "SRI SARASWATHI DEGREE COLLEGE, RAJAPET (Id: C-33248)",
  "SRI SATYASAI DEGREE OCLLEGE, DEVARAKONDA (Id: C-33250)",
  "SRI SNEHA DEGREE COLLEGE, BHONGIR (Id: C-33162)",
  "SRI VASAVI DEGREE COLLEGE NAGARJUNA SAGAR (Id: C-33216)",
  "SRI VENKATESHWARA COLLEGE OF EDUCATION, NALGONDA (Id: C-33227)",
  "SRIVENKATESHWARA DEGREE COLLEGE, KONDAMALLEPALLY (Id: C-33264)",
  "SRI VENKATESHWARA DEGREE COLLEGE, SURYAPET (Id: C-33231)",
  "SRI VENKATESHWARA DEGREE & PG COLLEGE, KODAD (Id: C-33228)",
  "SRI VIDYABHARATHI PG COLLEGE, MAMILLAGUDA (Id: C-33293)",
  "SRI VIDYABHARATI DEGREE COLLEGE, NALGONDA (Id: C-33242)",
  "SRI VINAYAKA DEGREE COLLEGE, SURYAPETA (Id: C-33226)",
  "SRUJANA DEGREE COLLEGE, HALIA (Id: C-33253)",
  "SSR COLLEGE OF EDUCAITON, NALGONDA (Id: C-33217)",
  "STANFORD COLLEGE OF EDUCATION, HANUMAPUR (Id: C-33252)",
  "STANFORD PG COLLEGE, BHONGIR (Id: C-33234)",
  "STANFORD WOMENS DEGREE COLLEGE, BHONGIR (Id: C-33229)",
  "ST. FRANCIS COLLEGE OF EDUCATION, SURYAPET (Id: C-33140)",
  "ST. GEORGE'S INSTITUTE OF BUSINESS ADMINISTRATION, BHONGIR (Id: C-33176)",
  "ST. MARRY'S PG COLLEGE OF COMPUTER SCIENCE, DESHMUKHI (Id: C-33232)",
  "ST. MARY'S COLLEGE OF EDUCATION, DESHMUKHI (Id: C-33112)",
  "ST. MARY'S PG COLLEGE OF MANAGEMENT STUDIES, DESHMUKHI (Id: C-33172)",
  "ST.MARY'S PG COLLEGE OF MANAGEMENT STUDIES, DESHMUKHI (Id: C-33134)",
  "SUGUNA DEGREE COLLEGE, KODAD (Id: C-33249)",
  "TRIVENI ARTS & SCIENCE DEGREE COLLEGE, KODAD (Id: C-33117)",
  "UJWALA DEGREE COLLEGE, VALIGONDA (Id: C-33124)",
  "UNIVERISYT COLLEGE OF ARTS & SOCIAL SCIENCE, NALGONDA (Id: C-33145)",
  "UNIVERSAL COLLEGE OF EDUCATION, KODAD (Id: C-33254)",
  "UNIVERSITY COLLEGE OF COMMERCE & BUSINESS MANAGEMENT, NALGONDA (Id: C-33127)",
  "UNIVERSITY COLLEGE OF SCIENCE & INFORMATICS, NALGONDA (Id: C-33289)",
  "UNIVERSITY COLLEGE OF SCIENCE & INFORMATICS, YELLAREDDYAGUDA (Id: C-33251)",
  "VASAVI DEGREE COLLEGE NAKREKAL (Id: C-33118)",
  "VASTHSALYA COLLEGE OF BUSINESS MANAGEMENT, BHONGIR (Id: C-33235)",
  "VASTHSALYA COLLEGE OF BUSINESS MANAGEMENT(MCA), BHONGIR (Id: C-33275)",
  "VATHSALYA COLLEGE OF EDUCATION, BHONGIR (Id: C-33291)",
  "VENKATESHWARA PG COLLEGE SURYAPET (Id: C-33255)",
  "VENNELA INSTITUTE ADVANCED STUDY IN EDUCATION, SURYAPET (Id: C-33123)",
  "VENNELA INSTITUTE OF BUSINESS ADMINISTRATION, ANNANTHARAM (Id: C-33282)",
  "VIJETHA DEGREE COLLEGE, MIRYALAGUDA (Id: C-33247)",
  "VIJETHA DEGREE MIRYALAGUDA (Id: C-33261)",
  "VIKAS CHRISTIAN COLLEGE OF EDUCATION, SURYAPET (Id: C-33165)",
  "Indian National Centre for Ocean Information Services, Ocean Valley, P.B. No.21, IDA Jeedimelta P.O., Hyderabad-500055 (Id: C-16865)",
  "National Institute of Nutrition Indian Council of Medical Research, Jawai, Osmania, Hyderabad-500007 (Id: C-16903)",
  "MANUU POLYTECHNIC, RANGAREDDY (Id: C-46610)",
  "Insitute of Public Exterprise, Osmania University Campus, Hyderbad, AP (Id: C-17469)",
  "Mahathma Gandhi National Insitute of Research & Social Action, Gagan Mahal Road, Domalguda, Hyderabad (Id: C-17515)",
  "School of Business Management -Hyderabad Campus (Id: C-14056)",
  "NATIONAL INSTITUTE OF FASHION TECHNOLOGY, HYDERABAD (Id: C-47472)",
  "Abhyudaya Oriental College (Id: C-26126)",
  "Academy of Management Studies (Id: C-25974)",
  "Acharya Degree College (Id: C-25477)",
  "ACME Degree College (Id: C-26113)",
  "Adam College of Education (Id: C-25482)",
  "Adam College of Hotel Management (Id: C-25909)",
  "Adarsha Degree College (Id: C-25884)",
  "AES College of Education (Id: C-25856)",
  "AKLR Govt. Andhra Oriental College (Id: C-25999)",
  "AKM Oriental College (Id: C-25649)",
  "Aliens Degree College (Id: C-25837)",
  "Ali Yavar Jung National Institute for the Hearing Handicapped (Id: C-25746)",
  "Allen Alfred College of Education (Id: C-25875)",
  "Al-Quarmoshi Institute of Business Management (Id: C-25451)",
  "Amjad Ali Khan College of Business Administration (Id: C-26080)",
  "Amrat Kapadia Navajeevan Degree College for Women (Id: C-25481)",
  "AMS College of Arts, Science & Commerce for Women (Id: C-25512)",
  "AMS College of Law College for Women (Id: C-25737)",
  "AMS School of Informatics (Id: C-26123)",
  "Andhra Yuvathi Mandal School of Business for Women (Id: C-25930)",
  "Annie Besant Womens Degree College (Id: C-25537)",
  "Anuradha Memorial Degree College (Id: C-25893)",
  "Anwarul-Uloom (Id: C-26008)",
  "Anwar-Ul-Uloom College of Business Administration (Id: C-25612)",
  "Anwarul-Uloom College of Computer Science (Id: C-25554)",
  "Anwar Ul-Uloom College of Education (Id: C-25425)",
  "AP College of Education (Id: C-26088)",
  "Apex College of Computers and Management (Id: C-26166)",
  "Apollo Institute of Hospital Administration (Id: C-26045)",
  "Apollo Institute of Hospital Management (Id: C-26116)",
  "Aradhana College of Education (Id: C-25940)",
  "Aradhana School of Business Management (Id: C-25443)",
  "Aristotle P.G.College (Id: C-25563)",
  "Arunodaya Degree College (Id: C-25871)",
  "Arya College of Pharmacy (Id: C-25552)",
  "Aryan College of Hotel Management (Id: C-25916)",
  "Ashritha Womens Degree College (Id: C-25796)",
  "ASP Oriental College (Id: C-25843)",
  "Atomic Minerals Directorate for Exploration and Research (Id: C-25458)",
  "Aurobindo College of Business Management (Id: C-25806)",
  "Aurobindo Institute of Computer Science (Id: C-25497)",
  "Aurobindo Institute of Computer Science (Olive P.G College for Computer Science) (Id: C-26134)",
  "Auroras Degree College (Id: C-25547)",
  "Aurora's Management Research Academy (Id: C-25814)",
  "Auroras Management & Research Institute (Id: C-25847)",
  "Aurora's School of Business (Id: C-26132)",
  "Aurora's School of Computer Science & Research (Id: C-25789)",
  "Avanthi Degree College (Id: C-25756)",
  "Avanthi P.G. College (Id: C-26112)",
  "A.V. College of Arts, Science & Commerce (Id: C-25729)",
  "A V P G CENTRE (GAGANMAHAL) (Id: C-48811)",
  "A.V. P.G. CENTRE (GAGANMAHAL) (Id: C-48810)",
  "AVRA Laboratories Pvt. Ltd. (Id: C-25517)",
  "Azad College of Computers (Id: C-25784)",
  "Azad Degree College (Id: C-26165)",
  "Azad Institute of Management (Id: C-25432)",
  "Azam Degree College (Id: C-26047)",
  "Badruka College PG Centre (Id: C-25894)",
  "Badruka Degree College (AN) (Id: C-25564)",
  "Badruka Degree College (Day) (Id: C-25984)",
  "Baptist Degree College (Id: C-25485)",
  "Bapuji Degree College (Id: C-26100)",
  "Bapuji Institute of Science & Technology (Id: C-26177)",
  "Basaveshwara Institute of Information Technology (Id: C-26181)",
  "BBCIT (Id: C-26082)",
  "Bhagwan Mahavir Medical Research Centre (Id: C-26099)",
  "Bhagyaradhi Degree College (Id: C-26135)",
  "Bharat Degree College for Women (Id: C-25813)",
  "Bharathiya Vidya Bhavans Vivekananda College of Science, Humanities & Commerce (Id: C-26108)",
  "BHARATH P G COLLEGE FOR WOMEN (IBRAHIMPATNAM) (Id: C-48849)",
  "Bharat P.G. College for Women (Id: C-25536)",
  "Bhasker Law College (Id: C-26106)",
  "Bhavans New Science Degree College (AN) (Id: C-25631)",
  "Bhavans New Science Degree College (Day) (Id: C-25743)",
  "BJR Govt. Degree College (Id: C-25515)",
  "Blooms College of Computers & Electronics (Id: C-25908)",
  "Blooms College of Hotel Management (Id: C-25507)",
  "BMR Degree College (Gajwel) (Id: C-25730)",
  "BMR Degree College (Siddipet) (Id: C-25701)",
  "Bright Institute of Management (Id: C-25774)",
  "Brindavan Institute of Teacher Education (Id: C-26137)",
  "CAP Degree College (Id: C-25505)",
  "CAP Institute of Hotel Management (Id: C-26115)",
  "CARE Hospitals (Id: C-26121)",
  "CAT Degree & PG College (Id: C-25680)",
  "Central Forensic Science Laboratory (Id: C-25705)",
  "Central Research Institute for Dryland Agriculture (Id: C-26182)",
  "Central Research Institute of Unani Medicine (Id: C-25541)",
  "Centre for Liver Research & Diagnostics (Id: C-25595)",
  "Centre for Materials for Electronics Technology (Id: C-25445)",
  "Centre for Organization Development (Id: C-25711)",
  "Chaitanya Bharathi Degree College (Id: C-25509)",
  "Chaitanya Bharathi Institute of Technology (Id: C-25622)",
  "Chatrapathi Shivaji Degree College (Id: C-25499)",
  "Chef College of Hotel Management (Id: C-25819)",
  "Cherry's College of Hotel Management & Culinery Arts (Id: C-25492)",
  "C.M. Institute of Management (Id: C-26078)",
  "COGNIZANT Degree College of Commerce & Science (Id: C-25816)",
  "College of Defence Management (Id: C-26095)",
  "College of Languages (Id: C-25689)",
  "College of Law for Women (AMS) (Id: C-25953)",
  "College of Teacher Education, AMS (Id: C-25895)",
  "CSI College of Education (Id: C-25724)",
  "C.S.I. Institute of P.G. Studies (Id: C-25882)",
  "C.S.R. Business School (Id: C-25514)",
  "Culinary Academy of India (Id: C-26015)",
  "David Memorial College of Education for Women (Id: C-25759)",
  "David memorial College of Pharmacy (Id: C-25602)",
  "David Memorial Degree College (Id: C-25773)",
  "David Memorial Institute of Management (Id: C-26067)",
  "Deccan College of Education (Id: C-25770)",
  "Deccan College of Engineering & Technology (Id: C-25435)",
  "Deccan School of Management (Id: C-25720)",
  "Deccan School of Pharmacy (Id: C-44490)",
  "DECCAN SCHOOL OF PHARMACY (Id: C-50253)",
  "Defence Research Development Laboratories (Id: C-26197)",
  "Dewan Bahadur Padma Rao Modiliar Degree College for Women (Id: C-25735)",
  "Dharmavanth Degree College (Id: C-25835)",
  "Directorate of Oilseeds Research (Id: C-25748)",
  "Directorate of Rice Research (Id: C-25906)",
  "Doctus (Id: C-25826)",
  "Don Bosco Degree College (Id: C-25767)",
  "Dr.B.R.Ambedkar College of Law (Id: C-25454)",
  "Dr. B. R. Ambedkar Degree College (Id: C-26068)",
  "Dr. B.R. Ambedkar Institute of Management & Technology (Id: C-25740)",
  "Dr. Narayana College of Hotel Management (Id: C-25931)",
  "Dr. Reddy's Laboratories (Id: C-25603)",
  "D.V.M Degree College of Commerce & Science (Id: C-26171)",
  "Einstein College of Business Management (Id: C-25618)",
  "Einstein College of Education (Id: C-25876)",
  "Ellenki Degree College (Narsapur) (Id: C-26092)",
  "Ellenki Degree College (Sangareddy) (Id: C-26077)",
  "Ellenki Degree College (Toopran) (Id: C-25670)",
  "Farah Institute of Computer Science (Id: C-25912)",
  "FROBEL'S DEGREE COLLEGE (Id: C-48843)",
  "Gajwel College of Education (Id: C-25494)",
  "Galaxy Degree College (Id: C-25495)",
  "GALAXY Degree College (Id: C-25616)",
  "Galaxy Degree college (Shalibanda) (Id: C-26124)",
  "Gandhian College of Education (Id: C-25965)",
  "Gandhian Institute of management (Id: C-25660)",
  "Gauthami Degree College (Id: C-26109)",
  "Gauthami Degree College (Chintal) (Id: C-25637)",
  "Gayatri Degree College (Urban Co Education) (Id: C-25597)",
  "Geetanjali Degree College (Id: C-25439)",
  "Geetanjali Degree College for Women (Id: C-25717)",
  "Geethanjali Degree College (Id: C-25625)",
  "Global College of Education (Id: C-25981)",
  "Global Education centre (Id: C-25933)",
  "Global Hospitals (Id: C-26023)",
  "Global Institute of Hotel Management (Id: C-25483)",
  "Global Institute of Management (Id: C-25610)",
  "GMR College of Education (Id: C-25678)",
  "G.M. Sanghi Degree College (Id: C-26125)",
  "Gokaraju Rangaraju College of Pharmacy (Id: C-26127)",
  "Gokaraju Rangaraju Institute of Hotel Management (Id: C-26143)",
  "Gokul Degree College (Id: C-25548)",
  "Goutami Degree College (Id: C-25732)",
  "Gouthami Degree College for Women (Id: C-25544)",
  "GOVERNMENT DEGREE COLLEGE (NARSAPUR) (Id: C-49877)",
  "Govt. City College (Id: C-25863)",
  "Govt. College of Physical Education (Id: C-25823)",
  "Govt. Degree College (Chavella) (Id: C-25890)",
  "Govt. Degree College (Dubbak) (Id: C-25423)",
  "Govt. Degree College for Women (Begumpet) (Id: C-25611)",
  "Govt. Degree College for Women (Gajwel) (Id: C-25983)",
  "Govt. Degree College for Women (Hussainialam) (Id: C-25846)",
  "Govt. Degree College for Women (Sangareddy) (Id: C-26035)",
  "Govt. Degree College for Women (Siddipet) (Id: C-25719)",
  "Govt. Degree College (Gajwel) (Id: C-26086)",
  "Govt. Degree College (Hayathnagar) (Id: C-25463)",
  "Govt. Degree College (Ibrahimpatnam) (Id: C-26036)",
  "Govt. Degree College (Kukatpally) (Id: C-25535)",
  "Govt. Degree College (Medak) (Id: C-25964)",
  "GOVT. DEGREE COLLEGE (MIRDODDI) (Id: C-48796)",
  "Govt. Degree College (Narayankhed) (Id: C-25844)",
  "Govt. Degree College (Patancheru) (Id: C-25824)",
  "Govt. Degree College (Sadasivpet) (Id: C-26180)",
  "Govt. Degree College (Siddipet) (Id: C-25620)",
  "Govt. Degree College (Tandur) (Id: C-25641)",
  "Govt. Degree College (Zaheerabad) (Id: C-25687)",
  "Gowtami Degree College (Id: C-26004)",
  "G. Pulla Reddy College of Pharmacy (Id: C-26083)",
  "G. Pulla Reddy Degree & P.G College (Id: C-25887)",
  "Grahambell Institute of Technology & Science (Id: C-25452)",
  "Grahambell PG College (Id: C-25628)",
  "Grahambell PG College (Id: C-25945)",
  "Green Fields College of Hotel Management (Id: C-25579)",
  "Green Park College of Hotel management (Id: C-25960)",
  "Gulam Ahmed College of Education (Id: C-25524)",
  "G.V.K. Emergency Management & Research Institute (Id: C-25426)",
  "Haindavi Degree College (Id: C-25534)",
  "HAINDAVI DEGREE COLLEGE (KAPRA) (Id: C-48852)",
  "Harshini Degree College (Id: C-25989)",
  "Hashvitha P.G College (Id: C-26028)",
  "Hellen Keller's Instiute of Research and Rehabilitation for the Disabled Children (Id: C-25479)",
  "Hindi Mahavidyalaya Degree College (Id: C-25674)",
  "Hindu Degree College for Women (Id: C-26084)",
  "HITS Degree College (Id: C-25733)",
  "Holy Cross Degree College for Women (Id: C-25780)",
  "Holy faith P.G College (Id: C-25721)",
  "Holy mary Institute of Technology & Management (Id: C-25757)",
  "Holy Mary Tec.College of Education (Id: C-25575)",
  "Holy Mother P.G College (Id: C-26141)",
  "Holy Trinity College of Education (Id: C-25793)",
  "Horizon Institute of Technology (Id: C-25601)",
  "HRD Degree & P.G College (Id: C-25853)",
  "Hyderabad Presidency College (Id: C-25530)",
  "Hyderabad Presidency Degree College (Id: C-26051)",
  "Hyderabad School of Management (Id: C-25560)",
  "Hyderabad Study circle (Id: C-25955)",
  "Ibrahimpatnam Degree College (Id: C-25424)",
  "Ideal Degree College for Women (Id: C-25587)",
  "IIMC Degree College (Id: C-25468)",
  "IITM Degree College (Id: C-25865)",
  "Indian Institute of Chemical Technology (Id: C-26148)",
  "Indian Institute of Hotel management & Culinery Arts (Id: C-25911)",
  "Indira Gandhi Degree College for Women (Id: C-25672)",
  "Indira Mahila Degree College (Id: C-25638)",
  "Indira Priyadarshini Government Degree College for Women (Id: C-25500)",
  "Indira Priyadarshini Govt. Degree College for Women (Id: C-25913)",
  "Information and Research Academy of Aurora (Id: C-25751)",
  "Information and Research Institute of Aurora (Id: C-25968)",
  "Innova Institute of Allied Sciences (Id: C-26150)",
  "Institute of Advanced Study in Education (Id: C-25693)",
  "Institute of Computers and Business Management (Id: C-25828)",
  "Institute of Library Science (Id: C-25488)",
  "Institute of Management Studies P.G Centre (Id: C-25448)",
  "Institute of Public Enterprises (Id: C-26169)",
  "International Advanced Research Centre for Powder Metallurgy (Id: C-25941)",
  "INTERNATIONAL DEGREE COLLEGE (TOLICHOWKI) (Id: C-48814)",
  "Islamia College of Education (Id: C-25982)",
  "Islamia College of Education (Id: C-25739)",
  "Islamia College of Enginering & Technology for Women (Id: C-25920)",
  "Islamia Degree College (Id: C-25833)",
  "I S O Degree College (Id: C-26009)",
  "Jagruthi Degree College (Id: C-25520)",
  "Jagruthi Degree College (Chevalla) (Id: C-25935)",
  "Jagruthi Degree College (Malkajgiri) (Id: C-25696)",
  "Jagruthi Degree College (Narayanguda) (Id: C-25849)",
  "Jagruthi Degree College (Shankarpally) (Id: C-25803)",
  "Jagruthi Womens Degree College (Id: C-25467)",
  "Jahanavi Degree College for Women (Id: C-25469)",
  "Jahanavi Degree College (Narayanaguda) (Id: C-25428)",
  "Jahanavi Degree College (Secunderabad) (Id: C-25754)",
  "J.B Institute of Hotel Management (Id: C-25886)",
  "Jesus P.G College (Id: C-26176)",
  "John Bauer College of Hotel Management (Id: C-26167)",
  "Kakatiya Degree College (Id: C-25462)",
  "Kamineni Hospitals (Id: C-25805)",
  "Karanam Padmavathi Memorial Degree & P.G College (Id: C-25489)",
  "Karuna P.G. College of Business Management (Id: C-25862)",
  "Karuna P.G College of Computers Applications (Id: C-25870)",
  "Kasturba Gandhi Degree College for Women (Id: C-26105)",
  "Katriya Institute of Excellence in Hotel Management (Id: C-26188)",
  "KEN Degree College (Id: C-25540)",
  "Keshav Memorial Degree & P.G. College (Id: C-25928)",
  "K.G.R Institute of Technology & Management (Id: C-25926)",
  "KIMS Hospital (Id: C-26061)",
  "Kingston College of Education (Id: C-26131)",
  "Kingston P.G. College (Id: C-25872)",
  "K.L.R. DEGREE COLLEGE (Id: C-48842)",
  "Kommuri Pratap Reddy Institute of Management (Id: C-25570)",
  "Kranthi (Alpha) Degree College (Id: C-25658)",
  "Krishnamurthy Institute of Management (Id: C-25529)",
  "KRR Govt College (Id: C-25491)",
  "K.R.R Institute of Information Technology (Id: C-25838)",
  "KRR Vignan Degree College for Women (Id: C-25585)",
  "K.V. Ranga Reddy Degree College for Women (Id: C-25832)",
  "KV Ranga Reddy Law College (Id: C-25942)",
  "Lal Bahadur Degree College (Id: C-25605)",
  "Lalitha College of Education (Id: C-25836)",
  "Lalitha Degree College (Id: C-25899)",
  "Lalitha Degree & P.G. College (Id: C-26144)",
  "Lateefia Arabic College (Id: C-25684)",
  "Leo Academy of Hospitality & Tourism Management (Id: C-25802)",
  "Lepra Blue Peters Research Centre (Id: C-25760)",
  "Leyas College of Education (Id: C-25996)",
  "Little Flower Degree College (Id: C-25471)",
  "Little Flower Degree College (Id: C-25881)",
  "L.N. Gupta Degree College (Id: C-26136)",
  "Lokamanya Tilak College of Business Management (Id: C-26114)",
  "Lokamanya Tilak P.G College of Information & Technology (Id: C-25782)",
  "Loyala Academy (Id: C-25991)",
  "Madina Degree College (Id: C-25661)",
  "Magene Life Sciences Pvt. Ltd (Id: C-26058)",
  "Mahatma Gandhi College of Law (Id: C-25858)",
  "Mahbub Degree College (Id: C-26199)",
  "Mahila Dakshata Samithi Degree College for Women (Id: C-25450)",
  "Maitreyi Degree College for Women (Id: C-26173)",
  "MAK Azad College of Education (Id: C-25607)",
  "Mallareddy College of Education (Id: C-25671)",
  "Malla Reddy College of Education (Id: C-25604)",
  "Malla Reddy College of Pharmacy (Id: C-25573)",
  "Malla Reddy Institute of Management (Id: C-25860)",
  "Manjeera College of Education (Id: C-25750)",
  "Manjeera Degree College (Patancheru) (Id: C-25925)",
  "Manjeera Degree College (Ramayampet) (Id: C-25734)",
  "Man Power Development College (Id: C-26163)",
  "MANTRA School of Business Management (Id: C-25558)",
  "Marathi Maha Vidyalaya (Id: C-25490)",
  "Marwadi Siksha Samithi Law College (Id: C-25850)",
  "Maryum Institute of Computer Science (Id: C-26020)",
  "Master (Vignan) Degree College (Id: C-25708)",
  "Matrix Laboratory Ltd. (Id: C-25533)",
  "Matrusree College of Graduate Studies (Id: C-26111)",
  "Matrusri Enginering College (Id: C-25498)",
  "Matrusri Institute of P.G. Studies (Id: C-25527)",
  "MD. RAFIUDDIN MEMORIAL INSTITUTE OF MANAGEMENT (Id: C-48847)",
  "Medwin Hospital (Id: C-26029)",
  "Megana Degree College (Id: C-25980)",
  "Mega Womens Degree College (Id: C-25446)",
  "Merit Institute of Business Management & Technology (Id: C-26179)",
  "MESCO College of Pharmacy (Id: C-25521)",
  "Mesco Degree College (Id: C-25829)",
  "MESCO Institute of Management & Computer Science (Id: C-26079)",
  "Methodist College of Engineering & Technology (Id: C-26074)",
  "Methodist Degree College (Id: C-26041)",
  "M.G. Degree College (Id: C-25659)",
  "Millennium College of Education (Id: C-25692)",
  "MNR College of Pharmacy (Id: C-25572)",
  "MNR College of Teacher Education (Id: C-25741)",
  "MNR Degree College (Id: C-25785)",
  "MNR Teacher Education College (Id: C-25818)",
  "Modern College of Education (Id: C-25919)",
  "Moghal College of Education (Id: C-25455)",
  "Moghul College of Business Management (Id: C-25831)",
  "Mother Teresa College of Management & Computer Applications (Id: C-25966)",
  "Mother Teresa P.G. College (Chowdariguda) (Id: C-26070)",
  "Mother Teresa P.G. College (NFC Nagar) (Id: C-25948)",
  "Mother Theresa College of Pharmacy (Id: C-25461)",
  "M.R.M Institute of Management (Ibrahimpatnam) (Id: C-25927)",
  "M S Degree College for Women (Nalgonda X Roads) (Id: C-25744)",
  "M S Degree College for Women (Shalibanda) (Id: C-26072)",
  "M S Degree College for Women (Tolichowki) (Id: C-25988)",
  "Muffakham Jah College of Engineering & Technology (Id: C-25464)",
  "Mumtaz Degree College (Id: C-25749)",
  "Musheerabad Degree College for Women (Id: C-25896)",
  "MVG Memorial Degree College (Id: C-26066)",
  "MVSR Engineering College (Id: C-25615)",
  "Nagarjuna College of Education (Id: C-25943)",
  "Nagarjuna Degree College (Mutrajpally) (Id: C-25545)",
  "Nagarjuna Degree & P.G College (Sangareddy) (Id: C-25566)",
  "Nalanda Degree College (Id: C-26094)",
  "NARAYANA Degree College (Id: C-25742)",
  "National Centre for Compositional Characterization of Materials (Id: C-25993)",
  "National College of Education (Id: C-25710)",
  "National Environmental Engineering Research Institute (Id: C-26189)",
  "National Geophysical Research Institute (Id: C-25915)",
  "National Institute for the Mentally Handicapped (Id: C-25709)",
  "National Institute of Nutrition (Id: C-25522)",
  "National Remote Sensing Centre (Id: C-26200)",
  "National Research Centre for Sorghum (Id: C-25430)",
  "Nava Bharathi College of Education (Id: C-26119)",
  "Navabharathi College of P.G Studies (Id: C-25713)",
  "Nava Chaitanya Degree College (Id: C-25550)",
  "Nawabshahala Khan College of Education (Id: C-25723)",
  "N.B. Science Degree College (Id: C-25647)",
  "Neelam Sanjeeva Reddy College of Education (Id: C-26073)",
  "Nehru Memorial Govt. Degree College (Id: C-25765)",
  "Netra vidhyalayam Degree College for Blind (Id: C-25460)",
  "New Adarsh Degree College (Id: C-25809)",
  "New Badruka Degree College (Id: C-25594)",
  "New Generation's Degree College (Id: C-26146)",
  "New Govt. Degree College (Khairtabad) (Id: C-25706)",
  "New Horizon Degree College (Id: C-25668)",
  "New India Institute of Computer Science (Id: C-25958)",
  "NEW MADINA DEGREE COLLEGE (SHAIKPET) (Id: C-48808)",
  "New Noble Degree College (Id: C-25591)",
  "New Scholars Degree College (Id: C-25429)",
  "New Science Degree College (Id: C-25682)",
  "New Siddhartha Degree College for Women (Id: C-25629)",
  "New Silver Jubilee Degree College (Id: C-25861)",
  "Niraj College of Hotel Management (Id: C-26178)",
  "Niraj Institute of Professional Studies (Id: C-26007)",
  "Nizam College, Basheerbagh (Id: C-25476)",
  "Nizam's Institute of Business Management (Id: C-25630)",
  "Noble College of Education (Id: C-25798)",
  "Noble Degree College (Id: C-25676)",
  "Noble P.G College (MBA/MCA) (Id: C-26057)",
  "Noble P.G College (MCA) (Id: C-25487)",
  "Non Ferrous Material Technology Development Centre (Id: C-25970)",
  "Nooria Arabia College (Id: C-25892)",
  "Nova Degree College (Id: C-25963)",
  "Nruputunga Degree College (Id: C-25478)",
  "OGA & Exhibhition Society College of Education (Id: C-25825)",
  "Olive College of Education (Id: C-26016)",
  "Omega College of Business Management (Id: C-25569)",
  "Omega College of Computer Application (Id: C-25593)",
  "Omega College of Pharmacy (Id: C-25716)",
  "Omega Degree College (Id: C-25634)",
  "Omega Degree College (Id: C-25506)",
  "Omega Degree College (Habsiguda) (Id: C-25677)",
  "Omega P.G College (Id: C-25459)",
  "Oriental Urdu College (Id: C-25752)",
  "Padala Rama Reddy Law College (Id: C-26014)",
  "Padala Ram Reddy Degree College (Id: C-26190)",
  "Pallavi College of Education (Id: C-26021)",
  "Pallavi College of Teacher Education (Id: C-25436)",
  "Pallavi Degree College (Id: C-25493)",
  "Pandit Narendra Oriental College (Id: C-26040)",
  "Panineeya Mahavidyala College of Education (Id: C-25830)",
  "Pannala ram reddy college of business managememt (Id: C-25511)",
  "Pasha College of Education (Id: C-25686)",
  "Pasha Noble Degree & P.G College (New Noble Degree College) (Id: C-25747)",
  "Pendekanti Institute of Management (Id: C-25951)",
  "Pendekanti Law College (Id: C-25633)",
  "Peoples College of Arts, Science & Commerce (Id: C-25702)",
  "P.G. College, Medak (Id: C-26024)",
  "P.G. College, Mirzapur (Id: C-26147)",
  "P.G. College of Law, Basheerbagh (Id: C-26025)",
  "P.G College of Physical Education (Id: C-25496)",
  "P.G. College, Secunderabad (Id: C-25883)",
  "P.G. College, Siddipet (Id: C-25885)",
  "P.G. College, Vikarabad (Id: C-25932)",
  "Pinnacle Institute of Hotel Management (Id: C-25698)",
  "Pioneer Degree College (Id: C-25640)",
  "Pioneer Institute of Hotel Management (Id: C-26120)",
  "PJR'S Memorial Sai Teja Degree College (Id: C-25679)",
  "PMR Degree College (Id: C-26133)",
  "Ponuganti Madhava rao degree College (Id: C-26011)",
  "Ponugoti Madhav Rao Law College (Id: C-25608)",
  "Poojya Sri Madhavananji College of Education (Id: C-25934)",
  "Pragathi Degree College (Id: C-25975)",
  "Pragathi Degree College (Co-Ed.) (Id: C-26139)",
  "Pragathi Degree College for Women (Id: C-25791)",
  "Pragathi Mahavidyalaya Degree College (Id: C-25880)",
  "Pragathi Women's Degree College (Id: C-25936)",
  "PRAGATHI WOMEN'S DEGREE COLLEGE, CHANDA NAGAR (Id: C-50251)",
  "Pragati College of Education (Id: C-25539)",
  "Pragna College of Education (Id: C-25675)",
  "Pragna P.G. College (Id: C-25442)",
  "Pragnya Degree College (Id: C-25538)",
  "Pragnya Womens Degree College (Id: C-25578)",
  "Prajwala Degree College (Id: C-26022)",
  "PRANATHI DEGREE COLLEGE (Id: C-48846)",
  "Prathiba College of Library Science (Id: C-26013)",
  "Prathiba Degree College (Id: C-25571)",
  "Prathibha Degree College (Id: C-25444)",
  "Prathibha Degree College (Ibrahimpatnam) (Id: C-25727)",
  "Prathibha Degree College (Vikarabad) (Id: C-25840)",
  "Pratibha Degree College (Id: C-25897)",
  "Pratibha Degree College (Id: C-25725)",
  "Presidency College of Arts, Science (Id: C-25480)",
  "Presidency College of Education for Girls (Id: C-25472)",
  "Presidency School of Management & Computer Science (Id: C-25688)",
  "Princenton Degree College (Id: C-25549)",
  "Princess Shehkar Degree College for Women (Id: C-25778)",
  "Princeton College of Education (Id: C-25781)",
  "Princeton P.G. College of Information Technology (Id: C-25574)",
  "Princeton P.G. College of Management (Id: C-25939)",
  "Priyadarshini College of Business Management (Id: C-25681)",
  "Priyadarshini College of Pharmaceutical Sciences (Id: C-25568)",
  "Priyadarshini Collge of Computers Science & Research (Id: C-25994)",
  "Priyadarshini Degree College (Id: C-25666)",
  "Priyanka Degree College for Women (Id: C-26031)",
  "PRR College of Commerce & Management (Id: C-25561)",
  "Pulla Reddy Institute of Computer Sciences (Id: C-25703)",
  "P.V Ramreddy P.G College (Id: C-25592)",
  "Qutubshahi P.G College (Id: C-26110)",
  "Rabindranath College of Education (Id: C-26010)",
  "Rachana College of Journalism (Id: C-25621)",
  "Radhe Krishna Degree College (Id: C-25949)",
  "RadheKrishna Women's College (Id: C-25841)",
  "Railway Degree College (Id: C-26044)",
  "Rainbow Integrated Degree College (Id: C-26128)",
  "Ramadevi College of Education (Id: C-25924)",
  "Rani Rudrama Devi Degree & P.G College (Id: C-25902)",
  "Ravi P.G. College (Id: C-26098)",
  "RBVRR College for Women (Id: C-26006)",
  "RBVRR College of Pharmacy (Id: C-25722)",
  "RBVRR Degree College (Id: C-25473)",
  "RBVRR Institute of Technology (Id: C-25775)",
  "Reah School of Business Management (Id: C-25434)",
  "Reeman College of Education (Id: C-26194)",
  "Regency College of Hotel Management (Id: C-25821)",
  "Residency College (Id: C-25704)",
  "Residency College of Education (Id: C-26117)",
  "R.G Kedia College of Commerce (Id: C-25502)",
  "R.G. Kedia Degree College (Id: C-25553)",
  "RGR Siddhanthi College of Education (Id: C-25619)",
  "R G R SIDDHANTHI COLLEGE OF M.C.A. (Id: C-48813)",
  "RGR Siddhanthi Degree College (Id: C-25683)",
  "R G R SIDDHANTHI P.G. COLLEGE (Id: C-48812)",
  "Rishi College of Education (Id: C-25513)",
  "Rishi Degree College (Id: C-25827)",
  "Rishi UBR Degree College for Women (Id: C-25556)",
  "R.K Degree College (Golkonda X Roads) (Id: C-26196)",
  "Robert Louis Institute of Technology (Id: C-25910)",
  "Roda Mistry College of Social Work & Research Centre (Id: C-26055)",
  "Roda Mistry Degree College (Id: C-26155)",
  "Ronald Ross P.G. College of Computer Science (Id: C-26152)",
  "Ronald Ross PG.College of Management Studies (Id: C-26034)",
  "Roots Degree College (Id: C-25440)",
  "Royal Degree College (Id: C-25663)",
  "Royal Degree College for Women (Id: C-26153)",
  "Royal Degree College (Rural Co-Education) (Id: C-25794)",
  "RRD Degree College (Id: C-25839)",
  "Saanvi P.G College of Women (Id: C-26042)",
  "Sai Chaitanya Degree College (Id: C-25700)",
  "Sai Chaitanya Degree College (Id: C-26183)",
  "Sai Gowthami Degree College (Id: C-25584)",
  "Sai Pranavi P.G College (Id: C-25653)",
  "Sai Sudhir Degree College (Id: C-25795)",
  "Sai Sudhir P.G. College (Id: C-25648)",
  "Sai Teja Degree College (Id: C-25804)",
  "Saketa Degree College (Id: C-25898)",
  "Samatha Degree College (Id: C-25588)",
  "Samhitha Degree College (Id: C-26063)",
  "Samhitha Degree College for Women (Id: C-25848)",
  "Sanga Mithra Degree College (Id: C-25557)",
  "Sanskrit Academy (Id: C-26184)",
  "SAP Degree College (Id: C-26154)",
  "Sarada College of Hotel Management (Id: C-25528)",
  "Saradha Degree College for Women (Id: C-26027)",
  "Sarojinii Naidu P.G College for Women (Id: C-26157)",
  "Sarojini Naidu (S.N) Vanitha Maha Vidhyalaya Degree College for Women (Id: C-25822)",
  "Sarvepally Radhakrishna Degree College (Id: C-26122)",
  "Scholars Degree College (Id: C-25972)",
  "Scholars Womens Degree College (Id: C-25715)",
  "Scient College of Education (Id: C-26185)",
  "S.D Signodia College of Arts, Commerce & P.G Centre (Id: C-25859)",
  "S.D. Signodia Degree College (Id: C-26198)",
  "Shadan College of Education (Id: C-25921)",
  "Shadan Degree College for Men (Id: C-25755)",
  "Shadan Degree College for Women (Id: C-25662)",
  "Shadan Educational Society (Id: C-25855)",
  "Shadan Institute of Computer Studies (Boys) (Id: C-26170)",
  "Shadan Institute of Computer Studies (Girls) (Id: C-25923)",
  "Shadan Institute of Management Studies for Boys (Id: C-25954)",
  "Shadan Institute of Management Studies for Gilrs (Id: C-25901)",
  "Shahjahan College of Business Management (Id: C-25815)",
  "Shahjahan College of Computer Applications (Id: C-26052)",
  "Shahnaz College of Education (Id: C-25779)",
  "Shalivahana Degree College (Id: C-26064)",
  "Shanthinikethan P.G. College (Id: C-26107)",
  "Shanti Degree College (Id: C-25623)",
  "Shantinikethan Degree College for Women (Id: C-26030)",
  "Sharada Degree College (Id: C-25438)",
  "Sharadha Vidhyalaya Degree & P.G College for Women (Id: C-25598)",
  "Sharavanthi P.G. College (Id: C-25643)",
  "Shivani Womens Degree College (Id: C-25736)",
  "Shree Shakthi College of Hotel Management (Id: C-25433)",
  "Shree Swaminarayan Gurukul College of Education (Id: C-26186)",
  "Shree Uma degree & P.G College (Id: C-26191)",
  "Siddharatha College of Education (Id: C-25874)",
  "Siddharatha Degree College (Co-Education) (Id: C-26056)",
  "Siddhartaha Degree College for Women (Id: C-26130)",
  "Siddhartha College of Education (Id: C-25656)",
  "Siddhartha Degree College (Id: C-25555)",
  "Siddhartha Institute of Computer Science (Id: C-25510)",
  "Siddhartha Institute of Technology & Science (formerly Siddharatha Technical Institute) (Id: C-25977)",
  "SIDDIPET COLLEGE OF EDUCATION (SIDDIPET) (Id: C-49878)",
  "Silver Jubilee Degree College (Id: C-25508)",
  "Sindhu Degree College (Id: C-26140)",
  "Sindu Degree College (Id: C-25867)",
  "Sir Newtons Degree College (Id: C-26069)",
  "Sir Newtons Degree College for Women (Id: C-25523)",
  "Siva Sivani Degree College (Id: C-25447)",
  "SLC's MCA College (Id: C-26018)",
  "SLR College of Hotel Management (Id: C-25952)",
  "Smt. A. Shyamala Devi Degree College for Women (Id: C-26175)",
  "S.N. Degree College for Women (Id: C-26174)",
  "Sneha Degree College (Id: C-25787)",
  "S.N. Vanita Mahavidyalaya College for Women (Pharmacy) (Id: C-25626)",
  "SPANDANA WOMEN'S DEGREE COLLEGE (Id: C-48845)",
  "Spark Institute of Management & Computer (Id: C-25484)",
  "SP Degree College (Id: C-25518)",
  "Spoorthy Degree College for Women (Id: C-25504)",
  "Spoorthy Degree & P.G. College (Id: C-26039)",
  "SR College of Teacher Education (Id: C-25772)",
  "Sree Anatha Padmanabha Degree College (Id: C-25769)",
  "Sree Ganavani Degree College (Id: C-25889)",
  "Sree Hanuman Vayam Shala Degree College for Women (Id: C-25845)",
  "Sreenidhi Degree College (Id: C-26003)",
  "Sree Ramchandra Arts & Science College (Id: C-25503)",
  "Sree Ratna Degree College (Id: C-25973)",
  "Sree Vani Women's Degree & P.G College (Id: C-25596)",
  "Sree Venkateshwara Degree College (Id: C-26159)",
  "Sree Vignan Degree College (Id: C-25764)",
  "Sri Aurbindo Degree College (Id: C-26075)",
  "Sri Balaji P.G College (Id: C-26054)",
  "Sri Chaitanya Degree College (Id: C-25738)",
  "Sri Chaitanya Degree College (Dubbaka) (Id: C-26193)",
  "Sri Chaitanya Degree College (Ghatkesar) (Id: C-26149)",
  "SRI CHAKRA COLLEGE OF EDUCATION, IBRAHIMPATNAM (Id: C-50252)",
  "Sri Chakra Institute of Computer Sciences (MCA) (Id: C-25562)",
  "Sri Giri College of Business Management (Id: C-25644)",
  "Sri Gujarathi Vidhya Mandir Degree College for Women (Id: C-25449)",
  "Sri Gujarathi Vidya Mandir (Id: C-25526)",
  "Sri Indu College of Education (Id: C-25834)",
  "Sri Indu Institute of Management (Id: C-25854)",
  "Sri Indu P.G College (Id: C-26103)",
  "Sri Krupa Institute of Pharmaceutical Sciences (Id: C-26048)",
  "Sri Manikanta Sharanam Degree College (Id: C-26202)",
  "Sri Maruthi Degree College (Id: C-25771)",
  "Sri Nagarjuna Degree College (Id: C-26161)",
  "Sri Nalanda Degree College (Id: C-25697)",
  "Sri Nidhi College of Education (Id: C-25917)",
  "Srinidhi Degree College (Id: C-25929)",
  "Srinivasa Degree College (Medak) (Id: C-25475)",
  "Srinivasa Degree College (Narayankhed) (Id: C-25900)",
  "Sripadha Akshara Degree College (Id: C-25652)",
  "Sri Padmanabha Degree College (Id: C-25474)",
  "Sri Padmavathi Mahila Kalasala (Id: C-25667)",
  "Sri Pannalal Pitti Degree College for Women (Id: C-25453)",
  "Sri Ramalingeshwara Degree College (Id: C-25427)",
  "Sri Ram Degree College (Id: C-25866)",
  "Sri Sadana Degree College (Id: C-25581)",
  "Sri Sai Degree College (Id: C-25851)",
  "Sri Sai Degree College (Id: C-26081)",
  "Sri Sai Degree & P.G College (Id: C-26187)",
  "Sri Sai Degree & P.G College (Id: C-26164)",
  "Sri Sai Vignan Bharathi Degree College (Id: C-25800)",
  "Sri Sai Vignan Bharathi Degree College for Women (Id: C-25465)",
  "Sri Saraswathi Vidhyalaya Degree College (Id: C-25995)",
  "SRI SHARADA P G COLLEGE FOR WOMEN (KUKATPALLY) (Id: C-48850)",
  "Sri Shardha Degree College for Women (Id: C-25914)",
  "Sri Vagdevi Degree College (Id: C-25470)",
  "Sri Vani Degree College (Id: C-25609)",
  "Sri Vani Degree College (Id: C-26033)",
  "Sri Venkateshwara B.P.Ed College (Id: C-26000)",
  "Sri Venkateshwara College of Education (Id: C-26026)",
  "Sri Venkateshwara College of Education (Id: C-25669)",
  "Sri Venkateshwara College of Fine Arts (Id: C-25946)",
  "Sri Venkateshwara College of Pharmacy (Id: C-25998)",
  "Sri Venkateshwara Commerce Degree College (Id: C-25888)",
  "SRI VENKATESHWARA DEGREE COLLEGE (PARGI) (Id: C-48848)",
  "Sri Venkateswara Degree College (Id: C-25691)",
  "Sri Vidhya College of Education (Id: C-25542)",
  "Sri Vidya Degree College (Co-Education) (Id: C-26102)",
  "Sri Viveka Vardhini Degree College (Id: C-25891)",
  "S.R.M. College of Education (Id: C-25869)",
  "St. Agnes College of Education (Id: C-25456)",
  "St. Alphonsa College of Education (Id: C-25790)",
  "Stanley Degree And P.G College for Women (Id: C-25651)",
  "Stannley College of Engineering & Technology for Women (Id: C-25820)",
  "Stannly Degree College (Id: C-25947)",
  "St. Anns College of Education (Id: C-26005)",
  "St. Anns College of Education for Women (Id: C-25606)",
  "St. Anns Degree College for Women (Malkajgiri) (Id: C-25808)",
  "St. Anns Degree College for Women (Mallapur) (Id: C-26091)",
  "St. Anns Degree College for Women (Mehdipatnam) (Id: C-25788)",
  "St.Ann's P.G College for Women (Mallapur) (Id: C-25624)",
  "St. Anthonys P.G Collge (Id: C-25992)",
  "Star Institute of Technology (Id: C-26037)",
  "St. Augustien P.G College (Id: C-26151)",
  "St. Daniels Degree College (Id: C-25985)",
  "Stella Marie Degree College (Id: C-25967)",
  "St. Francis College for Women (Id: C-25990)",
  "St. Francis Degree College for Women (Id: C-26195)",
  "St.Francis Institute of Management (Id: C-26085)",
  "St.Francis PG College (Id: C-25801)",
  "St.Francis Xavier College of Computer Science (Id: C-25799)",
  "St. Francis Xavier Degree College (Id: C-25580)",
  "St. George College of Education (Id: C-25486)",
  "St. George Degree College for Women (Id: C-25868)",
  "St.John Institute of Science & Technology (Id: C-25457)",
  "St.John P.G College (Seriguda) (Id: C-25731)",
  "St.Johns College of Education (Id: C-26156)",
  "St.Johns P.G College (Id: C-25525)",
  "St. Joseph's College (Id: C-26101)",
  "St.Joseph's College (Id: C-25559)",
  "St. Joseph's College of Education (Id: C-25904)",
  "St. Joseph's Degree College (Id: C-25600)",
  "St.Joseph's Degree & P.G College (Id: C-26019)",
  "St. Judes College of Education (Id: C-25792)",
  "St.Martins Institute of Business Management (Id: C-25441)",
  "St.Martins P.G College of Technology (Id: C-25957)",
  "St. Mary Degree College (Id: C-26032)",
  "St. Marys Centenary Degree College (Id: C-25532)",
  "ST. MARY'S COLLEGE (KUSHAIGUDA) (Id: C-48844)",
  "St. Mary's College of Education (Id: C-25617)",
  "St. Mary's College of Education (Id: C-25766)",
  "St.Marys College of Education (Id: C-25810)",
  "St. Patricks Degree & P.G College (Id: C-25978)",
  "St. Paul's College of Management & Information Technology (Id: C-26053)",
  "St.pauls College of Pharmacy (Id: C-25811)",
  "St. Pauls College of Pharmacy (Id: C-25962)",
  "St. Pauls Degree College (Id: C-25745)",
  "St.Pauls P.G College of Management & Information Technology (Id: C-25437)",
  "St.Pious X Degree and P.G College for Women (Id: C-25903)",
  "St. Pious X P.G (M.B.A) College for Women (Id: C-25879)",
  "St.stephens P.G College (Id: C-26050)",
  "St.Vincent P.G College (Id: C-25695)",
  "St.Xaviers P.G College (Gopanpally) (Id: C-25783)",
  "St.Xaviers P.G College (HMT Town Ship) (Id: C-25971)",
  "Sujatha Degree College for Women (Id: C-26093)",
  "Sultan-Ul-Uloom Law College (Id: C-25650)",
  "Sunshine College of Education (Id: C-25842)",
  "Suprabath College of Education (Id: C-25812)",
  "Suprabhat Institute of Computer Studies (Id: C-25655)",
  "Suprabhat Institute of Management Studies (Id: C-26087)",
  "S.V.B. Degree College (Id: C-25531)",
  "S.V Degree College (Id: C-25852)",
  "S V G Degree College (Id: C-25817)",
  "SVG Degree College (Id: C-25937)",
  "S.V Model College of Management (Id: C-25657)",
  "SVP National Police Academy (Id: C-25918)",
  "S.V.R School of Business Management (Id: C-26160)",
  "SVVVS College (Id: C-25519)",
  "Swami Vivekananda College of Computer Science and Management (Id: C-25567)",
  "Swamy Vivekananda P.G College (Id: C-25431)",
  "Swathi Degree College (Id: C-25707)",
  "Swathi Institute of Technology & Science (Id: C-26201)",
  "Swayamkrushi Self Reliance for the Mentally Challenged (Id: C-26096)",
  "Sweekar Degree College of ASLP (Id: C-26142)",
  "Sweekar Rehabilitation Institute for Handicapped (Id: C-25961)",
  "Syo Narayan Ramcharan Patwari P.G College of Commerce (Id: C-25768)",
  "Takshashila Degree College (Id: C-25956)",
  "Tapadia Diagnostic Centre (Id: C-25726)",
  "TARA Govt. College (Id: C-25718)",
  "The Mothers Degree College (Id: C-25516)",
  "The Mothers Degree College for Women (Id: C-25763)",
  "T.H.P Institute of Research & Rehabilitation for the Mentally Handicapped (Id: C-25950)",
  "TKR Institute of Management & Science (Id: C-25807)",
  "TMSS College of Management (Id: C-25590)",
  "TMSS Degree College for Women (Id: C-25714)",
  "UK College of Education (Id: C-25582)",
  "Unique Degree College for Women (Id: C-25786)",
  "University College for Women, Koti (Id: C-25938)",
  "University College of Science, Saifabad (Id: C-25761)",
  "Urdu Arts College (Eve) (Id: C-25762)",
  "Ushodaya Mahila Degree College (Id: C-26071)",
  "Vandana Degree College (Id: C-25639)",
  "Vani Degree College for Women (Id: C-25864)",
  "Vanitha Degree College for Women (Id: C-25873)",
  "Vasavi College of Engineering (Id: C-26162)",
  "Vashista Degree College (Id: C-26129)",
  "Vasundara Degree College (Co-Education) (Id: C-26002)",
  "Vasundara Women's Degree College (Id: C-25645)",
  "Velangini College of Education (Id: C-25728)",
  "Vidya Dayani College of Information Technology (Id: C-25646)",
  "Vidya Dayani Degree College for Women (Id: C-25758)",
  "Vidya Dayani Degree & P.G College (UG) (Id: C-25997)",
  "Vidyapeeth Degree College (Id: C-25576)",
  "Vidya Sagar Degree College (Id: C-26001)",
  "Vignan College of Education (Id: C-25987)",
  "Vignan Degree College (Bandlaguda) (Id: C-25673)",
  "Vignan Degree College (Shamshabad) (Id: C-25777)",
  "Vignan Jyothi Institute of Arts (Id: C-25613)",
  "Vijaya Bharathi College of Education (Id: C-25466)",
  "Vijaya Karan's Degree College (Id: C-25969)",
  "Vijayanagar College of Commerce (Id: C-25690)",
  "Vijaya P.G College (Id: C-26076)",
  "Vijaya Sai Degree College (Id: C-25543)",
  "Vijaya School of Business Management (Id: C-26012)",
  "Vijetha Degree College (Id: C-26104)",
  "Vikas College of Education (Id: C-25959)",
  "Vikas Degree College (Id: C-26145)",
  "Villa Marie Degree College for Women (Id: C-26065)",
  "Vinayaka College of I.T. and Business Management (Id: C-26049)",
  "Vishwa Bharathi Arts & Science Degree College (Id: C-26089)",
  "Vishwa Bharathi Degree College (Id: C-25627)",
  "VISHWA CHAITANYA WOMENS DEGREE COLLEGE (Id: C-48851)",
  "Vishwa Vishwani Institute of Systems & Management (Id: C-25636)",
  "Visionary Degree College (Id: C-25979)",
  "Vision P.G College (Id: C-25976)",
  "Vivekananda College of Education (Id: C-25878)",
  "Vivekananda Degree College (Kukatpally) (Id: C-25944)",
  "Vivekananda Degree College (Sithaphal Mandi) (Id: C-25694)",
  "Vivekananda Govt. Degree College (Id: C-26043)",
  "VIvekananda P.G College (Id: C-25654)",
  "Vivekananda School of P.G. Studies (Id: C-25589)",
  "V.V. College (AN) (Id: C-25905)",
  "V.V. College (Day) (Id: C-26138)",
  "V.V. College of Arts, Commerce & Science and PG Studies (Id: C-26172)",
  "VVR P.G College of Technology (Id: C-25685)",
  "Wesley Degree College (Co-Edn) (Id: C-25565)",
  "Wesley Degree College for Women (Id: C-26017)",
  "Wisdom Degree College (Id: C-25922)",
  "Yadaiah College of Education (Id: C-25635)",
  "Yashoda Hospital (Id: C-25642)",
  "YPR College of Education (Id: C-25614)",
  "YPR degree College (Id: C-25599)",
  "YSR's Spoorthy DegreeCollege (Id: C-26060)",
  "Adarsha College of Education, Narayanpet (Id: C-21952)",
  "Adarsha Degree & P.G College, Mahabubnagar (Id: C-22023)",
  "Adarsh College of Teacher Education, Mahabubnagar (Id: C-21942)",
  "Adarsh Post Graduate College of Computer Sciences, Mahabubnagar (Id: C-27165)",
  "Al-Madina College of Education, Mahabubnagar (Id: C-21986)",
  "Amritha Akshitha College of Education, Metpally, Wanaparthy (Id: C-21981)",
  "Carlo Bovini Memorial Degeree College, Kalwakurthy (Id: C-22003)",
  "Chaitanya Degree college, Achampet (Id: C-21940)",
  "C.Laxma Reddy College of Education, Telkapally (Id: C-22035)",
  "Dr. BRR Govt. College, Jadcherla (Id: C-21969)",
  "Dr.Sarvepally Radha Krishnan College of Education, Narayanpet (Id: C-21979)",
  "Gayathri College of Education, Wanaparthy (Id: C-21941)",
  "Gayathri Degree & P.G College, Wanaparthy (Id: C-22006)",
  "Geethanjali Degree College, Nawabpet (Id: C-22038)",
  "Goverdhan Reddy Degree College,Telkapally (Id: C-21971)",
  "Govt. College of Teacher Education, Mahabubnagar (Id: C-22018)",
  "Govt. Degree College, Amrabad (Id: C-21994)",
  "Govt. Degree College , Atmakur (Id: C-21985)",
  "Govt. Degree College Co- Edn Nagarkurnool (Id: C-21966)",
  "Govt. Degree College for Women, Gadwal (Id: C-21998)",
  "Govt. Degree College for Women, Nagarkurnool (Id: C-22024)",
  "Govt. Degree College for Women, Wanaparthy (Id: C-21965)",
  "Govt. Degree College , Kalwakurthy (Id: C-22026)",
  "Govt. Degree College , Kodangal (Id: C-22039)",
  "Govt. Degree College , Kollapur (Id: C-21947)",
  "Govt. Degree College, Shadnagar (Id: C-21997)",
  "Govt. Degree & P.G College for Men, Wanaparthy (Id: C-22009)",
  "Gowthami Degree College, Mahabubnagar (Id: C-21953)",
  "GSN College of Education, Achempet (Id: C-21949)",
  "Jadcherla P.G College, Jadcherla (Id: C-21982)",
  "Jagruthi Degree College, Shadnagar (Id: C-22010)",
  "Kotha Kota Sri Vidya Degree College, Kothakota (Id: C-21964)",
  "Lahoti Degree College, Kondanagal (Id: C-21961)",
  "MALD Govt. Degree College, Gadwal (Id: C-22004)",
  "Manasa College of Education, Kothakota (Id: C-22034)",
  "Modern College of Education, Nagarkurnool (Id: C-21938)",
  "M. V. S. Govt. Degree & P.G College, Mahabubnagar (Id: C-22031)",
  "Nagarjuna College of Education, Vallabnagar, Mahabubnagar (Id: C-21963)",
  "Nalanda College of Education, Mahabubnagar (Id: C-21990)",
  "Navabharathi College of Education, Pebbair (Id: C-22029)",
  "Navodaya College of Education, Nagarkurnool (Id: C-21974)",
  "Navodaya Degree College, Maddur (Id: C-22036)",
  "Niveditha Degree College, Kothakota (Id: C-22041)",
  "Nizam College of Education, Mahabubnagar (Id: C-22044)",
  "Noor College of Education, Shadnagar (Id: C-21980)",
  "N. T.R. Govt. Degree & P.G College for (W), Mahabubnagar (Id: C-21995)",
  "Palamuru University (Id: C-21972)",
  "P.H.R.M Degree & P.G College, Mahabubnagar (Id: C-21943)",
  "Pragathi Arts & Science Degree & P.G College, Achampet (Id: C-21968)",
  "Pragathi College of Education, Nagarkurnool (Id: C-22043)",
  "Radiance College of Education, Yenugonda, Mahabubnagar (Id: C-22013)",
  "Rathnagiri Degree College, Kollapur (Id: C-21987)",
  "Sadhana Degree College, Nagarkurnool (Id: C-22042)",
  "Sai College of Education, Narayanpet (Id: C-21975)",
  "Sai Krishna P.G College, Wanaparthy (Id: C-21950)",
  "Sardar Vallabhai Patel D. C, Shadnagar (Id: C-21956)",
  "Scholars Degree College, Wanaparthy (Id: C-21973)",
  "Scholors College of Education, Wanaparthy (Id: C-22017)",
  "Sharada College of Education, Mahabubnagar (Id: C-21960)",
  "Siddartha College of Education, Bandameedipally, Mahabubnagar (Id: C-21977)",
  "Smt.Sarojini Ramulamma College of Pharmacy, Mahabubnagar (Id: C-21945)",
  "Smt. Y. R. Degree College, Kalwakurthy (Id: C-21983)",
  "Spoorthi Degree College, Kothakota (Id: C-22007)",
  "Sree Sai Degree College, Kalwakurthy (Id: C-21991)",
  "Sri Ayyappa Swamy Degree College, Makthal (Id: C-21970)",
  "Sri Bijju Ananthaiah Memorial Degree College, Shadnagar (Id: C-22002)",
  "Sri Bramarambika Mallikarjuna College of Education, Kalwakurthy (Id: C-22019)",
  "Sri Chaitanya Degree & P.G College, Mahabubnagar (Id: C-22005)",
  "Sri Datta Brindavana Institute of Teacher Education, Narayanpet (Id: C-21944)",
  "Sri Krishnaveni Degree College, Kalwakurthy (Id: C-21951)",
  "Sri Ramakrishna Vivekananda D.C, Kosgi (Id: C-21946)",
  "Sri Saichaitanya Degree College, Hanwada (Id: C-21957)",
  "Sri Sai College of Education, Jadcherla (Id: C-22021)",
  "Sri Sai P.G College, Nagarkurnool (Id: C-21962)",
  "Sri Sai Teja College of Education, Mahabubnagar (Id: C-21993)",
  "Sri Shiva Sai Degree College, Ieej (Id: C-22014)",
  "Sri Srinivasa Degree College, Kollapur (Id: C-22001)",
  "Sri U. M. Govt. Degree College, Kondanagula (Id: C-22046)",
  "Sri Vani Degree College, Wanaparthy (Id: C-22000)",
  "Sri Vasavi Degree College, Mahabubnagar (Id: C-21955)",
  "Sri Vasavi Raja Prathap College of Education, Mahabubnagar (Id: C-22030)",
  "Sri Veerabadra Degree College, Koilkonda (Id: C-22045)",
  "Sri Vekateshwara Swamy College, Kadthal (Id: C-22022)",
  "Sri Venkateshwara College of Education, Mahabubnagar (Id: C-21978)",
  "St. Marry College of Education, Mahabubnagar (Id: C-21989)",
  "St. Thomos College of Education, Putanpally, Gadwal (Id: C-22028)",
  "Surya Degree College, Marikal (Id: C-21958)",
  "Suryalaxmi Degree College, Narayapet (Id: C-21992)",
  "S. V. Govt. Arts & Science Degree & P.G College, Palem (Id: C-21939)",
  "S.V.Govt.Oreintal College, Palem (Id: C-22032)",
  "S.V.M College of Education, Gadwal (Id: C-22027)",
  "S.V. M. Degeree & P.G College, Gadwal (Id: C-22008)",
  "Swamy Vivekananda Degree & P.G College, MBNR (Id: C-22012)",
  "Tagore College of Education, Ieez (Id: C-22040)",
  "Triveni Degree College, Achampet (Id: C-22025)",
  "Ushodaya College of Education, Wanaparthy (Id: C-22033)",
  "Vaishnavi College of Education, Mahabubnagar (Id: C-21967)",
  "Veerabhadra Degree College,Pebbair (Id: C-21948)",
  "Venkata Sai College of Teacher Education, Devarakadra (Id: C-22020)",
  "Vidya Degree College, Marikal (Id: C-22016)",
  "Vijeta Degree College, Wanaparthy (Id: C-21988)",
  "Vikas Degree College, (Co-Education), Atmakur (Id: C-22011)",
  "Viswashanti Degree College, Alam pur 'X' Road (Id: C-22037)",
  "Viswa Vikas College of Education, Shadnagar (Id: C-21954)",
  "Vivekananda College of Computers, Shadnagar (Id: C-21984)",
  "Vivekananda College of Education, Chattanpalli (Id: C-21959)",
  "Vivekananda Degree College, Shadnagar (Id: C-21996)",
  "V.R.K Degree College, Nagarkurnool. (Id: C-21999)",
  "W. C. C. M, Wanaparthy (Id: C-21976)",
  "School of Folk and Tribalore, Warangal (Id: C-39292)",
  "Indian Institute of Chemical Technology, Hyderabad 500037 (Id: C-41552)",
  "National Remote Sensing Agency, Dept. of Space, Govt. of India, Balanagar, Hyderabad 500037 (Id: C-42060)",
  "RAJIV GANDHI UNIVERSITY OF KNOWLEDGE TECHNOLOGIES, BASAR (Id: C-45101)",
  "A.K. VISHWANTHA REDDY DEGREE COLLEGE, MULKANOOR, BHEEMADEVARAPALLY (Id: C-21555)",
  "ALETI RAJA REDDY DEGREE COLLEGE, VELAGTOOR. (Id: C-21588)",
  "ALPHORES DEGREE COLLEGE, KARIMNAGAR (Id: C-21488)",
  "ALPHORES INSTITUTE OF MATHEMATICAL SCIENCES, VAVILALAPALLY, KARIMNAGAR (Id: C-21624)",
  "ALPHORES WOMENS DEGREE & PG COLLEGE JAGTIAL ROAD, KARIMNAGAR (Id: C-21605)",
  "APOORVA DEGREE COLLEGE, KARIMNAGAR (Id: C-21471)",
  "ARAVINDO DEGREE COLLEGE, MARKANDEYA COLONY, GODAVARIKHANI (Id: C-21506)",
  "ARORA DEGREE COLLEGE, MUKARAMPURA , KARIMNAGAR (Id: C-21539)",
  "AURORA COLLEGE OF EDUCATION, GOVINDAPALLY ROAD, JAGITIAL, KNR (Id: C-21617)",
  "AYYAPPA DEGREE COLLEGE, MPP ROAD, ELLANTHAKUNTA (Id: C-21578)",
  "AYYAPPA DEGREE COLLEGE, VIDYANAGAR, NEAR SBH, SIRCILLA (Id: C-21545)",
  "BRILLIANT DEGREE COLLEGE, SBH LANE, SIRCILLA (Id: C-21573)",
  "CHANAKYA DEGREE COLLEGE, NEAR CITY CABLE, JAMMIKUNTA (Id: C-21529)",
  "CHANAKYA DEGREE & PG COLLEGE, NEAR CITY CABLE, JAMMIKUNTA (Id: C-21591)",
  "CRESCENT COLLEGE OF EDUCATION , MUKARAMPURA, KARIMNAGAR (Id: C-21509)",
  "GANDHI MEMORIAL DEGREE COLLEGE, MARKANDEYA COLONY, GODAVARIKHANI (Id: C-21552)",
  "GANDHI MEMORIAL DEGREE & PG COLLEGE, MARKANDEYA COLONY, GODAVARIKHANI (Id: C-21623)",
  "GANDHI MEMORIAL MAHILA DEGREE COLLEGE, THIRUMALA NAGAR, GODAVARIKHANI (Id: C-21582)",
  "GAYATHRI DEGREE COLLEGE, (V&M):YELLAREDDYPET (Id: C-21497)",
  "GAYATHRI DEGREE & PG COLLEGE, PRAGATHI NAGAR, PEDDAPALLY (Id: C-21551)",
  "GAYATHRI PG COLLEGE NEAR NEW COURT, RANGAMPALLY, PEDDAPALLY (Id: C-21500)",
  "GEETHA DEGREE COLLEGE, NEW BYPASS KORUTLA ROAD, VEMULAWADA (Id: C-21507)",
  "GNANODAYA DEGREE COLLEGE, NEAR COURT METPALLY (Id: C-21604)",
  "GNANODAYA DEGREE COLLEGE OPP: BYPASS, RAIKAL (Id: C-21527)",
  "GOURISHETTY VENKATAIAH MEMORIAL COLLEGE OF EDUCATION, JAGITIAL ROAD, KNR (Id: C-21543)",
  "GOUTHAMI SAI DEGREE & PG COLLEGE OPP: SHIVALAYAM, MARKANDEYA COLONY, GODAVARIKHANI (Id: C-21499)",
  "GOUTHAM SAI DEGREE COLLEGE, GODAVARIKHANI (Id: C-21484)",
  "GOVERNMENT DEGREE COLLEGE, CHOPPADANDI (Id: C-21537)",
  "GOVERNMENT DEGREE COLLEGE FOR WOMEN, JAGTIAL (Id: C-21493)",
  "GOVERNMENT DEGREE COLLEGE, HUSNABAD (Id: C-21479)",
  "GOVERNMENT DEGREE COLLEGE, MAHADEVAPUR (Id: C-21596)",
  "GOVERNMENT DEGREE COLLEGE, METPALLY (Id: C-21483)",
  "GOVERNMENT DEGREE COLLEGE, NERELLA, GAMBHIRRAOPET (Id: C-21515)",
  "GOVERNMENT DEGREE & PG COLLEGE FOR WOMEN, KARIMNAGAR (Id: C-21554)",
  "GOVERNMENT DEGREE & PG COLLEGE, GODAVARIKHANI (Id: C-21550)",
  "GOVT. DEGREE COLLEGE, AGRAHARAM (Id: C-21477)",
  "GOVT. DEGREE COLLEGE FOR WOMEN, JAGTIAL (Id: C-21563)",
  "GOVT. DEGREE COLLEGE FOR WOMEN, KARIMNAGAR (Id: C-21600)",
  "GOVT. DEGREE COLLEGE, GODHAVARIKHANI (Id: C-21556)",
  "GOVT. DEGREE COLLEGE, HUZURABAD (Id: C-21526)",
  "GOVT. DEGREE COLLEGE, JAMMIKUNTA (Id: C-21498)",
  "GOVT. DEGREE COLLEGE, KORATLA (Id: C-21625)",
  "GOVT. DEGREE COLLEGE, MANTHANI (Id: C-21503)",
  "GOVT, DEGREE COLLEGE, PADDAPALLY (Id: C-21542)",
  "HERAMBHU SCHOOL OF BUSINESS, BHUPATIPUR, SULTANBAD (Id: C-21609)",
  "JAGRUTHI DEGREE COLLEGE, 20-462, VIDYANAGAR, HUZURABAD (Id: C-21489)",
  "JAGRUTHI DEGREE COLLEGE, VIDYANAGAR, HUZURABAD (Id: C-21570)",
  "JANARDHAN REDDY COLLEGE OF EDUCATION INDIRANAGAR COLONY, HUZURABAD (Id: C-21478)",
  "JAWAHARLAL NEHRU DEGREE COLLEGE, VEMULAWADA (Id: C-21481)",
  "JAWAHARLAL NEHRU DEGREE & PG COLLEGE, MALLARAM ROAD, VEMULAWADA (Id: C-21593)",
  "JAWAHARLAR NEHRU COLLEGE OF EDUCATION MALLARAM RD, VEMULAWADA (Id: C-21474)",
  "JAYASREE DEGREE COLLEGE, KARIMNAGAR (Id: C-21601)",
  "JUSTICE KUMARAIAH COLLEGE OF LAW, MUKTESHWARA COMPLEX, M.M. THOTA, KARIMNAGAR (Id: C-21535)",
  "JYOTHI COLLEGE OF EDUCATION, THADOOR (V), SIRCILLA (M), KNR (Id: C-21610)",
  "KAKATIYA DEGREE COLLEGE, GANESH NAGAR, JAMMIKUNTA (Id: C-21536)",
  "KAKATIYA DEGREE COLLEGE , NEAR BUS STAND, KAMALAPUR (Id: C-21614)",
  "KAKATIYA INSTITUTE AND MANAGEMENT STUDIES, KOTHAPALLY (H), KARIMNAGAR (Id: C-21565)",
  "KIMS DEGREE & PG COLLEGE, NEAR BUS STAND, OPP. KALABHARATHI LANE, KARIMNAGAR (Id: C-21599)",
  "LOYOLA COLLEGE OF EDUCATION, REKURTHI, MALKAPUR (P), KARIMNAGAR (Id: C-21611)",
  "MAHARSHI DEGREE COLLEGE, GODAVARIKHANI (Id: C-21615)",
  "MANAIR COLLEGE OF EDUCATION, KARIMNAGAR (Id: C-21504)",
  "MANAIR INSTITUTE OF MANAGEMENT STUDIES, PADMANAGAR (GP), KARIMNAGAR (Id: C-21519)",
  "MASTERS DEGREE COLLEGE, BHAGATH NAGAR, KARIMNAGAR (Id: C-21568)",
  "MATHRUSRI DEGREE COLLEGE, GANDHI NAGAR ROAD, HUZURABAD (Id: C-21530)",
  "NALANDA DEGREE COLLEGE , KARIMNAGAR ROAD, JAGTIAL (Id: C-21485)",
  "NARENDRA DEGREE COLLEGE, CHOULAMADDI (V), METPALLY (Id: C-21581)",
  "NAVODAYA DEGREE COLLEGE, DHARMAPURI (Id: C-21557)",
  "NSV DEGREE COLLEGE NEAR OLD BUS STAND, JAGTIAL (Id: C-21482)",
  "PRAGATHI DEGREE COLLEGE, GOPALRAO PET, RAMADUGU (Id: C-21512)",
  "PRAGATHI DEGREE COLLEGE, KALVACHERLA, KAMANPUR (Id: C-21577)",
  "RAMA KRISHNA DEGREE COLLEGE, JAGTIAL (Id: C-21549)",
  "RAMA KRISHNA DEGREE & PG COLLEGE , VANI NAGAR, JAGTIAL (Id: C-21494)",
  "RASHMIDHAR TEJA COLLEGE OF EDUCATION, NEAR D40 CANAL, KOUSALYANAGAR, KORATLA (Id: C-21523)",
  "RASHMIDHAR TEJA DEGREE COLLEGE , OPP: BUS STAND, KORATLA (Id: C-21603)",
  "RASHMIDHAR TEJA DEGREE COLLEGE, OPP: BUS STAND, KORATLA (Id: C-21567)",
  "RBVRR COLLEGE OF EDUCATION, KARIMNAGAR (Id: C-21501)",
  "ROSHINI DEGREE COLLEGE, RAGHAVULU NAGAR, NEAR BUS STAND MANTHANI (Id: C-21496)",
  "ROUSSEAU COLLEGE OF TEACHER EDUCATION, VENKATRAOPALLY, NARSINGAPUR (P), BOINPALLI (M), KARIMNAGAR (Id: C-21561)",
  "SADHANA COLLEGE OF EDUCATION, NEAR BUS STAND, MANTHANI-505184 (Id: C-21595)",
  "SAI RAM DEGREE COLLEGE, MUKKU BACHI MALLAIAH HOUSING COMPLEX, MARKET ROAD, JAMMIKUNTA (Id: C-21538)",
  "SANGA MITRA DEGREE COLLEGE BESIDES ANDHRA BANK, HUSNABAD (Id: C-21569)",
  "SANGA MITRA DEGREE & PG COLLEGE, AKKANNAPET ROAD, HUSNABAD (Id: C-21576)",
  "SANGHAMITHRA COLLEGE OF EDUCATION, AKKANNAPET ROAD,HUSNABAD (Id: C-21513)",
  "SATAVAHANA DEGREE COLLEGE, HUZURABAD (Id: C-21475)",
  "SHALINI COLLEGE OF EDUCATION, RAMAKRISHNA COLONY, NUSTULAPUR, KARIMNAGAR (Id: C-21495)",
  "SHANTA INSTITUTE OF PG COLLEGE, BORNAPALLY, HUZURABAD (Id: C-21473)",
  "SHANTHINIKETAN DEGREE COLLEGE, ALLURI ROAD, 8 INC. COLONY, GODAVARIKHANI (Id: C-21516)",
  "SHARADHA DEGREE COLLEGE, MANAKONDUR (Id: C-21486)",
  "SHIVANI DEGREE & PG COLLEGE , MANKAMMATHOTA, KARIMNAGAR (Id: C-21618)",
  "SHIVANI DEGREE & PG COLLEGE, MANKAMMATHOTA, KARIMNAGAR (Id: C-21480)",
  "SHIVA SHIVANI INSTITUTE OF MANAGEMENT STUDIES, GANAGADHARA (Id: C-21525)",
  "SHREE VASHISTA COLLEGE OF EDUCATION NEAR VAARTHA UNIT, ALGUNOOR, THIMMAPUR, KARIMNAGAR (Id: C-21566)",
  "SKLNR COLLEGE OF EDUCATION, SARASWATHI NAGAR, JAGTIAL (Id: C-21514)",
  "SKNR DEGREE COLLEGE, JAGITAL (Id: C-21540)",
  "SKNR GOVERNMENT ARTS & SCIENCE COLLEGE, DHARMAPURI ROAD, JAGTIAL (Id: C-21607)",
  "SLN DEGREE COLLEGE , GUNDLAPALLY (V), BEJJANKI (Id: C-21590)",
  "SREE CHAITANYA DEGREE COLLEGE, GOLLAPALLY (Id: C-21472)",
  "SREE CHAITANYA DEGREE COLLEGE, M.M.THOTA, KARIMNAGAR (Id: C-21505)",
  "SREENIDHI DEGREE COLLEGE, KURIKYAL (Id: C-21547)",
  "SREE VASHISTHA INSTITUTE OF MANAGEMENT STUDIES, BADDIPALLY (V), KAMANPUR (P) KARIMNAGAR (Id: C-21572)",
  "SRI ADARSHA DEGREE COLLEGE, KOHEDA (Id: C-21571)",
  "SRI ARUNODAYA DEGREE COLLEGE, KORATLA (Id: C-21528)",
  "SRI BALAJI COLLEGE OF PHARMACY, CHOPPADANDI, KARIMNAGAR (Id: C-21562)",
  "SRI BALAJI COLLEGE OF PHARMACY, CHOPPADANDI (V&M), KARIMNAGAR (Id: C-21544)",
  "SRI CHAITANYA DEGREE COLLEGE, KARIMNAGAR (Id: C-21558)",
  "SRI CHAITANYA PG COLLEGE, SHANTINAGAR, C/O. GOUTHAMINAGAR, GODAVARIKHANI (Id: C-21583)",
  "SRI CHAITANY DEGREE COLLEGE, DHARMAPURI (Id: C-21598)",
  "SRI CHAITNYA DEGREE COLLEGE, MAIN ROAD, GODAVARIKHANI (Id: C-21548)",
  "SRI GEERAVANI INSTITUTE OF MANAGEMENT, CHOPPANDI (Id: C-21546)",
  "SRI HARSHITHA DEGREE COLLEGE,KATARAM (Id: C-21502)",
  "SRI MITHRA DEGREE COLLEGE MUSTHABAD (Id: C-21597)",
  "SRI VAAGDEVI DEGREE COLLEGE, HUZURABAD (Id: C-21592)",
  "SRIVANI DEGREE COLLEGE, OLD JANDA, SULTANABAD (Id: C-21587)",
  "SRI VIDYA JYOTHI DEGREE COLLEGE SRI RAM NAGAR, JAGTIAL (Id: C-21589)",
  "SRM DEGREE COLLEGE, KARIMNAGAR (Id: C-21584)",
  "SRM DEGREE &PG COLLEGE, GEETHA BHAVAN CHOWRASTA, MUKARAMPURA, KARIMNAGAR (Id: C-21476)",
  "SRR COLLEGE OF PHARMACEUTICAL SCIENCES, VALBHAPUR (V), ELKATURTHI (M), KARIMNAGAR (Id: C-21490)",
  "SRR GOVERNMENT COLLEGE, KARIMNAGAR (Id: C-21560)",
  "SRR GOVT. DEGREE COLLEGE, KARIMNAGAR (Id: C-21564)",
  "SURYA COLLEGE OF EDUCATION, Vill&Post: Nukapally Mond: Malyala, JAGTIAL (Id: C-21620)",
  "SWAMY VIVEKANADA DEGREE COLLEGE, DHARMARAM (Id: C-21608)",
  "SWAMY VIVEKANANDA DEGREE COLLEGE, NEAR BUS STAND, DHARMARAM (Id: C-21520)",
  "TRINITY COLLEGE OF EDUCATION, KASULAPALLY, PEDDAPALLY (Id: C-21575)",
  "TRINITY COLLEGE OF EDUCATION, PEDDAPALLY (Id: C-21622)",
  "TRINITY COLLEGE OF EDUCATION, STATION ROAD, PEDDAPALLY (Id: C-21606)",
  "TRINITY COLLEGE OF PHARMACEUTICAL SCIENCES, PRAGATHINAGAR, PEDDAPALLY, KARIMNAGAR (Id: C-21531)",
  "TRINITY DEGREE COLLEGE JYOTHI NAGAR, NTPC, RAMAGUNDAM (Id: C-21510)",
  "TRINITY DEGREE COLLEGE, PRAGATHI NAGAR, PEDDAPALLY (Id: C-21586)",
  "UNIVERSITY COLLEGE, LMD, KARIMNAGAR (Id: C-21621)",
  "UNIVERSITY COLLEGE, SATAVAHANA UNIVERSITY, KARIMNAGAR (Id: C-21613)",
  "UNIVERSITY COLLEGE, SATAVAHANA UNIVERSITY, KARIMNAGAR (B.PHARM) (Id: C-21559)",
  "UNIVERSITY COLLEGE, SATAVAHANA UNIVERSITY, KARIMNAGAR (MBA) (Id: C-21524)",
  "UNIVERSITY COLLEGE, SATAVAHANA UNIVERSITY, LMD LEFT FLANK, KARIMNAGAR (MCA) (Id: C-21585)",
  "VAAGESWARI COLLEGE OF PHARMACY, BESIDE LMD POLICE STATION, THIMMAPUR, KARIMNAGAR (Id: C-21532)",
  "VAAGESWARI COLLEGE OF PHARMACY, THIMMAPUR, KARIMNAGAR (Id: C-21518)",
  "VAAGESWARI DEGREE COLLEGE MUKARAMPURA ROAD, KARIMNAGAR (Id: C-21579)",
  "VAGDEVI DEGREE COLLEGE, KORUTLA ROAD, BESIDE AMC, VEMULAWADA (Id: C-21553)",
  "VANI NIKETAN DEGREE COLLEGE, KARIMNAGAR (Id: C-21619)",
  "VANI NIKETAN DEGREE & PG COLLEGE , MUKARAMPURA, KARIMNAGAR (Id: C-21616)",
  "VANI NIKETAN INSTITUTE OF MANAGEMTNT STUDIES, MUKARAMPURA, KARIMNAGAR-505002 (Id: C-21521)",
  "VANI NIKETHAN VIDYA SAMITHI, MUKARAMPURA, KARIMNAGAR (Id: C-21602)",
  "VANISRI DEGREE COLLEGE KARIMNAGAR (Id: C-21487)",
  "VASAVI DEGREE COLLEGE, KALVASRIRAMPUR (Id: C-21522)",
  "VIDYALATHA DEGREE COLLEGE OF COMMERCE & BUSINESS MANAGEMENT KARIMNAGAR (Id: C-21533)",
  "VIKAS DEEGREE COLLEGE, MANKAMMATHOTA, KARIMNAGAR (Id: C-21594)",
  "VIKAS DEGREE COLLEGE, 70-2-51, SIDHULAWADA, SIRCILLA (Id: C-21511)",
  "VIKAS DEGREE COLLEGE, RATHNAPUR (V), KAMANPUR (Id: C-21574)",
  "VIVEKANANDA DEGREE COLLEGE, HUSNABAD (Id: C-21491)",
  "VIVEKANANDA DEGREE COLLEGE, KARIMNAGAR (Id: C-21541)",
  "VIVEKANANDA DEGREE COLLEGE, RAMAVARAM ROAD, HUSNABAD (Id: C-21508)",
  "VIVEKANANDA DEGREE & PG COLLEGE, JAGTIAL ROAD, KARIMNAGAR (Id: C-21492)",
  "VIVEKANANDA PG COLLEGE, JAGTIAL ROAD, KARIMNAGAR (Id: C-21517)",
  "VODITHALA SRINIVASA RAO DEGREE COLLEGE HUZURABAD (Id: C-21612)",
  "College of Veterinary Science, Korutla (Id: C-29256)",
  "College of Veterinary Science, Rajendranagar, Hyderabad (Id: C-22047)",
  "Dairy Technology Programme, Kamareddy (Id: C-22054)",
  "Adarsh Hindi Maha Vidyalaya Degree College, Nizamabad (5001) (Id: C-35055)",
  "Care Degree College, Nizamabad (5002) (Id: C-35071)",
  "CSI Degree College, Nizamabad (5004) (Id: C-35044)",
  "Girraj Government College, Nizamabad (5005) (Id: C-35065)",
  "Gnyana Saraswathi Institute of Management, Nizamabad (5173) (Id: C-35035)",
  "Gouthami Degree College, Nizamabad (5006) (Id: C-35063)",
  "Gouthami PG College, Nizamabad (5221) (Id: C-35036)",
  "Govt. Arts & Science College, Armoor (5010) (Id: C-35057)",
  "Govt. Arts & Science College, Kamareddy (5009) (Id: C-35029)",
  "Govt. Degree College, Bichkunda (5011) (Id: C-35054)",
  "Govt. Degree College, Bodhan (5007) (Id: C-35050)",
  "Govt. Degree College, Morthad (5044) (Id: C-35037)",
  "Govt. Degree College, Yellareddy (5008) (Id: C-35039)",
  "GSR Degree College, Kamareddy (5012) (Id: C-35056)",
  "Indur College of Education, Bodhan (5281) (Id: C-35074)",
  "Indur PG College of Business Management, Bodhan (5171) (Id: C-35016)",
  "Kakatiya B.Ed College, Nizamabad (5282) (Id: C-35064)",
  "Karshak B.Ed College, Kamareddy (5283) (Id: C-35020)",
  "Katipally Ravinder Reddy College of Education, Nizamabad (5284) (Id: C-35073)",
  "Madhumalancha Degree College, Bodhan (5014) (Id: C-35043)",
  "Manjeera Degree College, Kamareddy (5015) (Id: C-35041)",
  "MSR Degree College, Nizamabad (5016) (Id: C-35075)",
  "Nalanda Degree College, Bheemghal (5019) (Id: C-35058)",
  "Nalanda Degree College for Women, Nizamabad (5017) (Id: C-35033)",
  "Narendra Degree College, Armoor (5020) (Id: C-35072)",
  "Narendra Womens Degree College, Armoor (5021) (Id: C-35059)",
  "Nishitha Degree College, Nizamabad (5022) (Id: C-35032)",
  "PJR'S Spoorthy Degree College, Kamareddy (5048) (Id: C-35049)",
  "Prachya Vidya Parishad Oriental College, Kamareddy (5381) (Id: C-35048)",
  "Pragathi College of Education, Banswada (5291) (Id: C-35068)",
  "Pragathi Degree College, Nizamabad (5023) (Id: C-35069)",
  "Pragna Degree College, Kamareddy (5045) (Id: C-35018)",
  "Priyadarshini College of Education, Armoor (5285) (Id: C-35030)",
  "Rama Krishna Degree & PG College, Kamareddy (5024) (Id: C-35021)",
  "Sandeepani Degree College, Kamareddy (5026) (Id: C-35031)",
  "Shashank Degree & PG College, Banswada (5027) (Id: C-35060)",
  "Siddhartha Degree College, Kamareddy (5028) (Id: C-35028)",
  "SPR Degree College, Dichpally (5050) (Id: C-35066)",
  "Sri Chaitanya College of Education, Bodhan (5286) (Id: C-35038)",
  "Sri Sadguru Bandayappa Swamy B.Ed. College, Bichkunda (5287) (Id: C-35045)",
  "Sri Sai College of Education, Nizamabad (5288) (Id: C-35024)",
  "Sri Sai Degree College, Nandipet (5030) (Id: C-35052)",
  "Sri Sai Raghavendra Degree College, Nizamabad (5029) (Id: C-35067)",
  "Sri Vagdevi Degree College, Nizamabad (5031) (Id: C-35014)",
  "Sri Vaishnavi Women's Degree College, Kamareddy (5046) (Id: C-35070)",
  "Sri Venkateshwara Degree College, Bodhan (5051) (Id: C-35025)",
  "Sri Vijaya Sai Degree College, Bodhan (5032) (Id: C-35053)",
  "Sri Vishwashanthi College, Nizamabad (5033) (Id: C-35022)",
  "SRNK Govt. Degree College, Banswada (5034) (Id: C-35076)",
  "S.R.S.P. Degree College, Balkonda (5025) (Id: C-35040)",
  "SSL Degree College, Banswada (5035) (Id: C-35042)",
  "St. Thomas College of Education, Bodhan (5289) (Id: C-35026)",
  "St. Thomas College of Management, Bodhan (5172) (Id: C-35015)",
  "SV Degree College, Gandhari (5054) (Id: C-35046)",
  "SV Degree College, Pitlam (5052) (Id: C-35019)",
  "SVN Degree College, Bichkunda (5036) (Id: C-35047)",
  "Ushodaya Degree College, Bodhan (5049) (Id: C-35061)",
  "Vaagdevi Degree College, Nizamabad (5038) (Id: C-35034)",
  "Vasistha Degree & PG College, Kamareddy (5037) (Id: C-35017)",
  "Vasu Degree College, Bodhan (5039) (Id: C-35023)",
  "Vijay College of Education for Women, Nizamabad (5290) (Id: C-35013)",
  "Vijay Degree & PG College, Armoor (5040) (Id: C-35062)",
  "Vijetha Degree & PG College, Armoor (5041) (Id: C-35051)",
  "Women's Degree College, Nizamabad (5042) (Id: C-35027)",
  "Administrative Staff College of India (Id: C-12974)",
  "Advanced Data Processing Research Institute (Id: C-12988)",
  "Advanced Numerical Research and Analysis Group (Id: C-12983)",
  "Advanced Technology Centre (ATC) of TCS (Id: C-12984)",
  "Asian Health Care Foundation (Id: C-12989)",
  "Aurigen Discovery Technologies (Id: C-13001)",
  "Bhagwan Mahavir Medical Research Centre (Id: C-12986)",
  "Bharat Biotech Foundation (Id: C-12970)",
  "Blue Peter Research Centre (Id: C-12996)",
  "Centre for Development of Advanced Computing (Id: C-12977)",
  "Centre for DNA Fingerprinting and Diagnostics (Id: C-12978)",
  "Centre for Economic and Social Studies (Id: C-12975)",
  "Computer Maintenance Corporation Ltd. (Id: C-12987)",
  "Defence Metallurgical Research Laboratory (Id: C-12995)",
  "Directorate of Oil Seeds Research (Id: C-12998)",
  "Directorate of Rice Research (Id: C-13002)",
  "Dr. Reddys Research Foundation (Id: C-12990)",
  "Global Medical Education and Research Centre (Id: C-12972)",
  "Indian Immunologicals (Id: C-12980)",
  "Indian Institute of Chemical Technology (Id: C-12994)",
  "Institute for Development and Research (Id: C-12982)",
  "Institute of Life Sciences (Id: C-12976)",
  "Institute of Public Enterprise (Id: C-13000)",
  "International Advanced Research Centre for Powder Metallurgy and New Materials (Id: C-12973)",
  "International Crops Research Institute for Life Sciences (Id: C-12992)",
  "L.V. Prasad Eye Research Institute (Id: C-12971)",
  "National Geophysical Research Institute (Id: C-12985)",
  "National Institute of Nutrition (Id: C-12979)",
  "National Institute of Rural Development (Id: C-12997)",
  "National Institute of Small Industry Extension Training (Id: C-12981)",
  "National Remote Sensing Agency (Id: C-13003)",
  "Non-ferrous Materials Technology Development Centre (Id: C-12993)",
  "Research Centre Imarat (Id: C-12999)",
  "Shantha Biotechnics (Id: C-12991)"
]